content/yocto.org
# -*- coding: utf-8; -*-
#+TITLE: Yocto notes
#+DESCRIPTION: Reference notes for Yocto
#+AUTHOR: Scott J. Crouch
#+EMAIL: scottjcrouch at jee-male
#+SETUPFILE: my-org-html-theme.setup
#+STARTUP: fninline overview
#+OPTIONS: H:4
#+OPTIONS: num:nil

* Links
:PROPERTIES:
:ID:       3e4f8b8c-b522-4900-953d-20ea0d528c08
:CUSTOM_ID: links
:END:
- [[https://docs.yoctoproject.org/][Yocto Docs]] ([[https://docs.yoctoproject.org/singleindex.html][single page]]; [[https://docs.yoctoproject.org/genindex.html][index]])
  - [[https://docs.yoctoproject.org/ref-manual/index.html][Reference manual]]
    - [[https://docs.yoctoproject.org/ref-manual/structure.html][Directory structure]]
    - [[https://docs.yoctoproject.org/ref-manual/classes.html][Classes]]
    - [[https://docs.yoctoproject.org/ref-manual/tasks.html][Tasks]]
    - [[https://docs.yoctoproject.org/ref-manual/devtool-reference.html][Devtool]]
    - [[https://docs.yoctoproject.org/ref-manual/features.html][Selectable features]]
      - [[https://docs.yoctoproject.org/ref-manual/features.html#machine-features][Machine-relevant]]
      - [[https://docs.yoctoproject.org/ref-manual/features.html#distro-features][Distro-relevant]]
      - [[https://docs.yoctoproject.org/ref-manual/features.html#image-features][Image-relevant]]
    - [[https://docs.yoctoproject.org/ref-manual/variables.html][Variables]]
    - [[https://docs.yoctoproject.org/ref-manual/varlocality.html][Variable contexts]]
  - [[https://docs.yoctoproject.org/bitbake/2.6/index.html][Bitbake]]
    - [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html][Syntax]]
      - [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html#variable-flags][Task-specific variable flags]]
    - [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-fetching.html][Fetching]]
    - [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-ref-variables.html][Variables (BitBake-specific)]]
  - [[https://docs.yoctoproject.org/sdk-manual/index.html][eSDK and app development]]
  - [[https://docs.yoctoproject.org/dev-manual/index.html][Development guide]]
    - [[https://docs.yoctoproject.org/dev-manual/packages.html][Working with packages]]
    - [[https://docs.yoctoproject.org/dev-manual/debugging.html][Debugging tools and techniques]]
    - [[https://docs.yoctoproject.org/dev-manual/qemu.html][Using QEMU with Yocto]]
    - [[https://docs.yoctoproject.org/dev-manual/sbom.html][Creating a Software Bill of Materials (SBOM)]]
  - [[https://docs.yoctoproject.org/test-manual/index.html][Testing]]
- Layers
  - [[https://www.yoctoproject.org/development/yocto-project-compatible-layers/][Yocto Project Curated Layer Index]]
  - [[https://layers.openembedded.org/layerindex/branch/master/layers/][OpenEmbedded Layer Index]]
- Code examples
  - [[https://github.com/shni9045/Qt5-Yocto][Qt5 + Yocto on RPi-4B]]
- Misc.
  - [[https://developer.ridgerun.com/wiki/index.php/Preparing_Yocto_Development_Environment_for_Debugging][Preparing Yocto Development Environment for Debugging]]
  - [[https://www.youtube.com/playlist?list=PLD4M5FoHz-TxMfBFrDKfIS_GLY25Qsfyj][Live Coding with Yocto Project]]
  - [[https://www.khronos.org/opengles/][OpenGL ES overview]]
* Terminology
:PROPERTIES:
:ID:       c09de665-9a71-43d6-b1f5-a1fd38b75b44
:CUSTOM_ID: terminology
:END:
*** Append
:PROPERTIES:
:ID:       d2fee7d5-7007-4e33-85cb-6c9a370990fd
:CUSTOM_ID: d2fee7d5-7007-4e33-85cb-6c9a370990fd
:END:
- append files have a =.bbappend= suffix
- these override/extend their eponymous [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] files (a =%= character acts as a
  wildcard), e.g.
  - =my-app_1.2.3.bbappend= applies only for the 1.2.3 version
  - =my-app_1.2.%.bbappend= applies only for the 1.2.y version
  - =my-app_1.%.bbappend= applies only for the 1.x and 1.x.y versions
  - =my-app_%.bbappend= applies for any version
- [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] basically just appends their contents to the end of the
  corresponding =.bb= file
- where there are multiple append files for the same [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] in different
  [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]], the layer's priority decides the order they'll be applied in
