yocto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yocto notes</title>
<meta name="description" content="Reference notes for Yocto" />
<meta name="generator" content="Org Mode" />
<link href='https://fonts.googleapis.com/css?family=EB Garamond' rel='stylesheet'>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Yocto notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#links">Links</a></li>
<li><a href="#terminology">Terminology</a>
<ul>
<li><a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">Append</a></li>
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a></li>
<li><a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a></li>
<li><a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">Build Directory</a></li>
<li><a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">Class</a></li>
<li><a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">Configuration</a></li>
<li><a href="#ff999862-e2a2-482c-93a4-55151cb59154">Dependency</a></li>
<li><a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">Devtool</a></li>
<li><a href="#887aaab6-76ef-43b5-8592-127935253e7a">Distro</a></li>
<li><a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">eSDK</a></li>
<li><a href="#e2c85bd3-accf-49ea-97ad-fa47a1bb272b">Fetcher</a></li>
<li><a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">Image</a></li>
<li><a href="#97e812dc-9fef-4f72-a931-4ae140862170">Include</a></li>
<li><a href="#d4009f0f-f371-454b-b30f-7fda430c0028">Layer</a></li>
<li><a href="#b1a75489-4822-43b0-8fd4-639d535cad33">Metadata</a></li>
<li><a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</a></li>
<li><a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">OpenEmbedded Build System</a></li>
<li><a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">Package</a></li>
<li><a href="#729ed304-8a4e-40f7-a72e-eec793809f77">Package feed</a></li>
<li><a href="#4f2876d0-3b4a-4be0-9f24-12b4922f7bb6">Package group</a></li>
<li><a href="#cd11671a-4982-43d0-92eb-f510bf1b5d22"><code>PR</code> Service</a></li>
<li><a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a></li>
<li><a href="#a4dfc074-83f5-47c6-a5c4-c1b6153b906a">Pseudo</a></li>
<li><a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">Recipe</a></li>
<li><a href="#ee4d8327-cb6b-4b13-8ca2-3d77cce33a81">SBOM</a></li>
<li><a href="#8254517c-069f-4c02-bcc0-989e195a3cdc">sstate-cache</a></li>
<li><a href="#f9b4ec65-a1e4-457a-a977-a5fb8c519c59">Source Directory</a></li>
<li><a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">Sysroot</a></li>
<li><a href="#b64a1dac-73c7-403b-9f43-2530b4fd9669"><code>wic</code></a></li>
</ul>
</li>
<li><a href="#77644b46-c404-4635-8cd4-f6d741c9f579">Build directory contents</a>
<ul>
<li><a href="#436f2635-0396-4400-a62f-30ca113b090c"><code>conf/</code></a></li>
<li><a href="#8924a89f-2052-4370-a549-a61d2475454b"><code>downloads/</code></a></li>
<li><a href="#3a21f6aa-2b60-4879-bf5b-9b19213bd3a8"><code>sstate-cache/</code></a></li>
<li><a href="#12ea9557-5155-49bc-830c-ce2cd727489d"><code>tmp/</code></a>
<ul>
<li><a href="#6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f"><code>tmp/work/</code></a></li>
<li><a href="#42ecbafa-3bd4-4d87-b351-017b5f0edb00"><code>tmp/work-shared/</code></a></li>
<li><a href="#a2382d7c-15f0-4838-83d5-3c982eaedc05"><code>tmp/deploy/</code></a>
<ul>
<li><a href="#96cb9dc9-6536-41bf-aa3f-d1d5dd58b173"><code>tmp/deploy/images/</code></a></li>
<li><a href="#f163942c-16fc-48bb-98d8-a083d6f78260"><code>tmp/deploy/&lt;package_type&gt;/</code></a></li>
<li><a href="#175e15db-e46d-4bee-92ec-a624b83c74d9"><code>tmp/deploy/licenses/</code></a></li>
<li><a href="#8740c2c8-f495-4768-90df-e6b5a8db0022"><code>tmp/deploy/sdk/</code></a></li>
</ul>
</li>
<li><a href="#dbeacf3e-590d-40b2-ae9b-b783984f2959"><code>tmp/sysroots-components/</code></a></li>
<li><a href="#d199bf7e-3375-4127-9c14-0bd47e3b9f1c"><code>tmp/log/</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#afbb604b-6575-481f-8619-e8e36f81855c">Setting up a build</a></li>
<li><a href="#6118f330-5f11-4f7e-8073-017544523f59">Useful commands</a></li>
<li><a href="#cae0bb7a-04bf-459c-a100-934338ec5ded">Building a target image</a></li>
<li><a href="#01866026-d3a7-47e1-8148-12966cdc99df">Creating a custom image recipe</a></li>
<li><a href="#dfb22ff0-7a48-4df5-b479-d591750e0354">Creating a custom distro configuration</a></li>
<li><a href="#ad945122-d7c0-44c4-8529-bc5ebd41039f">Customising an existing recipe</a>
<ul>
<li><a href="#a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6">Modifying build flags</a></li>
<li><a href="#454f3ba7-e149-40c3-acb6-d9e0aed33575">Applying a patch</a></li>
<li><a href="#80f5fd18-70ac-4dee-a784-ab78c0a1069d">Adding extra files</a></li>
<li><a href="#f5e94c00-76bb-468c-896a-be015f947270">Changing recipe feature configuration</a></li>
<li><a href="#5a6c603b-af2d-45ae-81a6-7748692924f2">Changing recipe Kconfig configuration</a></li>
</ul>
</li>
<li><a href="#d3aa691d-a9df-4d7e-94cb-af28e2177486">Standard target filesystem paths</a></li>
<li><a href="#8cf925bb-3283-47f5-8033-85151b2aa166">Running the image in QEMU</a>
<ul>
<li><a href="#2345edb0-38da-465f-94ca-366b3578a234">Automated testing with QEMU</a></li>
</ul>
</li>
<li><a href="#89dd2d47-b589-4fcb-92f2-c13c3aa91480">Debugging</a>
<ul>
<li><a href="#8628f96d-b068-4d4a-82b7-65e70f80af30">Metadata</a></li>
<li><a href="#f82572d9-a37f-423d-9c46-5de277952cd5">Run-time software</a></li>
</ul>
</li>
<li><a href="#50ecb4f8-0fef-4298-9f92-3d89b1c4a47d">Choosing a board</a></li>
<li><a href="#9dd87647-f7dd-4435-b527-2a990d5239c3">Licenses</a>
<ul>
<li><a href="#bcd83893-9335-4693-8f50-ac4b0a807761">License compliance</a></li>
</ul>
</li>
<li><a href="#635714a5-4def-4468-88f3-a30e4128c720">Toaster</a></li>
<li><a href="#d106ee59-cbac-4ba2-b886-68266957e19e">Good practices</a></li>
<li><a href="#cabd0da0-d7ec-4bdc-80db-34a2563ab39e">Config syntax</a></li>
<li><a href="#70e610ae-be41-48f0-ab91-b7fa3e82851c">Templates</a>
<ul>
<li><a href="#3b6f0f7c-d816-4b65-8096-dc2e720a8f68"><code>local.conf</code></a></li>
<li><a href="#7d86ced6-7905-4d3d-9739-42965f71fb1c">Recipe</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-links" class="outline-2">
<h2 id="links">Links</h2>
<div class="outline-text-2" id="text-links">
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/">Yocto Docs</a> (<a href="https://docs.yoctoproject.org/singleindex.html">single page</a>; <a href="https://docs.yoctoproject.org/genindex.html">index</a>)
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/ref-manual/index.html">Reference manual</a>
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/ref-manual/structure.html">Directory structure</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/classes.html">Classes</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/tasks.html">Tasks</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/devtool-reference.html">Devtool</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/features.html">Selectable features</a>
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/ref-manual/features.html#machine-features">Machine-relevant</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/features.html#distro-features">Distro-relevant</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/features.html#image-features">Image-relevant</a></li>
</ul></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/variables.html">Variables</a></li>
<li><a href="https://docs.yoctoproject.org/ref-manual/varlocality.html">Variable contexts</a></li>
</ul></li>
<li><a href="https://docs.yoctoproject.org/bitbake/2.6/index.html">Bitbake</a>
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html">Syntax</a>
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html#variable-flags">Task-specific variable flags</a></li>
</ul></li>
<li><a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-fetching.html">Fetching</a></li>
<li><a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-ref-variables.html">Variables (BitBake-specific)</a></li>
</ul></li>
<li><a href="https://docs.yoctoproject.org/sdk-manual/index.html">eSDK and app development</a></li>
<li><a href="https://docs.yoctoproject.org/dev-manual/index.html">Development guide</a>
<ul class="org-ul">
<li><a href="https://docs.yoctoproject.org/dev-manual/packages.html">Working with packages</a></li>
<li><a href="https://docs.yoctoproject.org/dev-manual/debugging.html">Debugging tools and techniques</a></li>
<li><a href="https://docs.yoctoproject.org/dev-manual/qemu.html">Using QEMU with Yocto</a></li>
<li><a href="https://docs.yoctoproject.org/dev-manual/sbom.html">Creating a Software Bill of Materials (SBOM)</a></li>
</ul></li>
<li><a href="https://docs.yoctoproject.org/test-manual/index.html">Testing</a></li>
</ul></li>
<li>Layers
<ul class="org-ul">
<li><a href="https://www.yoctoproject.org/development/yocto-project-compatible-layers/">Yocto Project Curated Layer Index</a></li>
<li><a href="https://layers.openembedded.org/layerindex/branch/master/layers/">OpenEmbedded Layer Index</a></li>
</ul></li>
<li>Code examples
<ul class="org-ul">
<li><a href="https://github.com/shni9045/Qt5-Yocto">Qt5 + Yocto on RPi-4B</a></li>
</ul></li>
<li>Misc.
<ul class="org-ul">
<li><a href="https://developer.ridgerun.com/wiki/index.php/Preparing_Yocto_Development_Environment_for_Debugging">Preparing Yocto Development Environment for Debugging</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLD4M5FoHz-TxMfBFrDKfIS_GLY25Qsfyj">Live Coding with Yocto Project</a></li>
<li><a href="https://www.khronos.org/opengles/">OpenGL ES overview</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-terminology" class="outline-2">
<h2 id="terminology">Terminology</h2>
<div class="outline-text-2" id="text-terminology">
</div>
<div id="outline-container-d2fee7d5-7007-4e33-85cb-6c9a370990fd" class="outline-3">
<h3 id="d2fee7d5-7007-4e33-85cb-6c9a370990fd">Append</h3>
<div class="outline-text-3" id="text-d2fee7d5-7007-4e33-85cb-6c9a370990fd">
<ul class="org-ul">
<li>append files have a <code>.bbappend</code> suffix</li>
<li>these override/extend their eponymous <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> files (a <code>%</code> character acts as a
wildcard), e.g.
<ul class="org-ul">
<li><code>my-app_1.2.3.bbappend</code> applies only for the 1.2.3 version</li>
<li><code>my-app_1.2.%.bbappend</code> applies only for the 1.2.y version</li>
<li><code>my-app_1.%.bbappend</code> applies only for the 1.x and 1.x.y versions</li>
<li><code>my-app_%.bbappend</code> applies for any version</li>
</ul></li>
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> basically just appends their contents to the end of the
corresponding <code>.bb</code> file</li>
<li>where there are multiple append files for the same <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> in different
<a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a>, the layer&rsquo;s priority decides the order they&rsquo;ll be applied in</li>
</ul>
</div>
</div>
