content/yocto.org
*** BitBake
:PROPERTIES:
:ID:       623a901f-d7c6-44b6-97a0-e2bea2f861bc
:CUSTOM_ID: 623a901f-d7c6-44b6-97a0-e2bea2f861bc
:END:
- the task scheduler and execution engine, used by the
  [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][OpenEmbedded Build System]]
- a web-based interface for BitBake and its metadata exists called [[#635714a5-4def-4468-88f3-a30e4128c720][Toaster]]
- while you can use most variables in any context, some variables are
  associated with a particular context or scope (more on this [[https://docs.yoctoproject.org/ref-manual/varlocality.html][here]])
  - variables defined in [[#73837aae-7e38-4040-99e9-e5b43fd673ca][config]] files are global, available to every [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
  - variables defined within [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] files are local to specific recipe only,
    i.e. during the execution of its tasks
- the parsing order of global config variables is as follows:
  - =build/conf/local.conf=
  - =<layer>/conf/machines/<machine>.conf=
  - =<layer>/conf/distro/<distro>.conf=
- notable variables include (complete list [[https://docs.yoctoproject.org/ref-manual/variables.html][here]]):
  - =MACHINE=, the target machine (e.g. =beaglebone-yocto= for BeagleBone Black)
  - =DISTRO=, is set to a [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]] configuration
  - =PACKAGE_CLASSES=, to set one or more [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packaging]] format(s) to package data up
    into
  - =SDKMACHINE=, indicates the architecture that a generated [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK]] is to run on
  - =EXTRA_IMAGE_FEATURES=, for extra [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] packages
  - the =SYSROOT_*= variables, which control how [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroots]] are created and stored
- how to use it (more commands [[#6118f330-5f11-4f7e-8073-017544523f59][here]]):
  - =bitbake <recipe>= runs a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
  - ~bitbake -c listtasks <recipe>~ lists all tasks involved a particular [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
    (the =-c= flag is simply running a special task within that recipe called
    =do_listtasks=)
*** BSP
:PROPERTIES:
:ID:       c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2
:CUSTOM_ID: c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2
:END:
- board support package; a collection ([[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]]) of drivers, definitions, et al.,
  for a particular board or hardware configuration
- the =meta-yocto-bsp= [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] (which [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] includes) is a core layer containing
  BSPs for various machines that Yocto Project supports
  (e.g. =beaglebone-yocto=)
*** Build Directory
:PROPERTIES:
:ID:       51cba0dc-6701-431d-9b93-9b2e39761fbc
:CUSTOM_ID: 51cba0dc-6701-431d-9b93-9b2e39761fbc
:END:
- AKA an individual project; a build environment
- this term helps distinguish it from the [[#f9b4ec65-a1e4-457a-a977-a5fb8c519c59][source directory]] that it may or may
  not lie within
- a build environment is created (and/or entered into) when we =source= a setup
  environment script, e.g. =oe-init-build-env= (an optional arg lets us specify
  the name of the directory; defaults to just =build/=)
- the =TOPDIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points here
- the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] repo doesn't track these files
- a build usually just involves adding [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]]; we customise/tweak it by
  creating our own custom layers
- when troubleshooting a build, it may be helpful to [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-intro.html#generating-dependency-graphs][generate a dependency
  graph]] (see the =-g= and =-u= flags)
- the build directory's structure and contents are described [[#77644b46-c404-4635-8cd4-f6d741c9f579][here]]; more
  complete documentation can be found [[https://docs.yoctoproject.org/ref-manual/structure.html][here]]
*** Class
:PROPERTIES:
:ID:       1f78978c-9d22-4d70-9aab-de96ee8ab69a
:CUSTOM_ID: 1f78978c-9d22-4d70-9aab-de96ee8ab69a
:END:
- contain info that's useful to share between [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]; typically this is
  common build information (e.g. how to build a Linux kernel; how to build an
  autotools project)
- have the =.bbclass= suffix
- the class =classes/base.bbclass= is implicitly inherited in every [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
- are pulled in by [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] with the =inherit= keyword
- class files are global entities, unlike [[#97e812dc-9fef-4f72-a931-4ae140862170][include]] files, which are more local;
  class files can be inherited by any [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], any [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]]
*** Configuration
:PROPERTIES:
:ID:       73837aae-7e38-4040-99e9-e5b43fd673ca
:CUSTOM_ID: 73837aae-7e38-4040-99e9-e5b43fd673ca
:END:
- these files instruct what to build and what to put into the image to support
  a particular platform
- have the =.conf= suffix
- configure several areas:
  - machine-specific config (i.e. machine definitions; see
    e.g. =meta-yocto-bsp/conf/machine/=)
  - [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]] config (e.g. for [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] itself)
  - compiler tuning
  - general common config options
  - user config options
- =conf/local.conf= from the [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build directory]] contains user-defined [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]]
  that affect every build
- =conf/local.conf= from a particular [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] defines stuff for a layer like its
  name, priority, dependencies on other layers, etc.
- for config syntax, see [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html][here]]
- a list of variables is given [[https://docs.yoctoproject.org/ref-manual/variables.html][here]]; applicable contexts are given [[https://docs.yoctoproject.org/ref-manual/varlocality.html][here]]
