yocto.html
<div id="outline-container-623a901f-d7c6-44b6-97a0-e2bea2f861bc" class="outline-3">
<h3 id="623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</h3>
<div class="outline-text-3" id="text-623a901f-d7c6-44b6-97a0-e2bea2f861bc">
<ul class="org-ul">
<li>the task scheduler and execution engine, used by the
<a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">OpenEmbedded Build System</a></li>
<li>a web-based interface for BitBake and its metadata exists called <a href="#635714a5-4def-4468-88f3-a30e4128c720">Toaster</a></li>
<li>while you can use most variables in any context, some variables are
associated with a particular context or scope (more on this <a href="https://docs.yoctoproject.org/ref-manual/varlocality.html">here</a>)
<ul class="org-ul">
<li>variables defined in <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">config</a> files are global, available to every <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
<li>variables defined within <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> files are local to specific recipe only,
i.e. during the execution of its tasks</li>
</ul></li>
<li>the parsing order of global config variables is as follows:
<ul class="org-ul">
<li><code>build/conf/local.conf</code></li>
<li><code>&lt;layer&gt;/conf/machines/&lt;machine&gt;.conf</code></li>
<li><code>&lt;layer&gt;/conf/distro/&lt;distro&gt;.conf</code></li>
</ul></li>
<li>notable variables include (complete list <a href="https://docs.yoctoproject.org/ref-manual/variables.html">here</a>):
<ul class="org-ul">
<li><code>MACHINE</code>, the target machine (e.g. <code>beaglebone-yocto</code> for BeagleBone Black)</li>
<li><code>DISTRO</code>, is set to a <a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a> configuration</li>
<li><code>PACKAGE_CLASSES</code>, to set one or more <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packaging</a> format(s) to package data up
into</li>
<li><code>SDKMACHINE</code>, indicates the architecture that a generated <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK</a> is to run on</li>
<li><code>EXTRA_IMAGE_FEATURES</code>, for extra <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> packages</li>
<li>the <code>SYSROOT_*</code> variables, which control how <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroots</a> are created and stored</li>
</ul></li>
<li>how to use it (more commands <a href="#6118f330-5f11-4f7e-8073-017544523f59">here</a>):
<ul class="org-ul">
<li><code>bitbake &lt;recipe&gt;</code> runs a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
<li><code>bitbake -c listtasks &lt;recipe&gt;</code> lists all tasks involved a particular <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>
(the <code>-c</code> flag is simply running a special task within that recipe called
<code>do_listtasks</code>)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2" class="outline-3">
<h3 id="c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</h3>
<div class="outline-text-3" id="text-c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">
<ul class="org-ul">
<li>board support package; a collection (<a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a>) of drivers, definitions, et al.,
for a particular board or hardware configuration</li>
<li>the <code>meta-yocto-bsp</code> <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> (which <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> includes) is a core layer containing
BSPs for various machines that Yocto Project supports
(e.g. <code>beaglebone-yocto</code>)</li>
</ul>
</div>
</div>
<div id="outline-container-51cba0dc-6701-431d-9b93-9b2e39761fbc" class="outline-3">
<h3 id="51cba0dc-6701-431d-9b93-9b2e39761fbc">Build Directory</h3>
<div class="outline-text-3" id="text-51cba0dc-6701-431d-9b93-9b2e39761fbc">
<ul class="org-ul">
<li>AKA an individual project; a build environment</li>
<li>this term helps distinguish it from the <a href="#f9b4ec65-a1e4-457a-a977-a5fb8c519c59">source directory</a> that it may or may
not lie within</li>
<li>a build environment is created (and/or entered into) when we <code>source</code> a setup
environment script, e.g. <code>oe-init-build-env</code> (an optional arg lets us specify
the name of the directory; defaults to just <code>build/</code>)</li>
<li>the <code>TOPDIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points here</li>
<li>the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> repo doesn&rsquo;t track these files</li>
<li>a build usually just involves adding <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a>; we customise/tweak it by
creating our own custom layers</li>
<li>when troubleshooting a build, it may be helpful to <a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-intro.html#generating-dependency-graphs">generate a dependency
graph</a> (see the <code>-g</code> and <code>-u</code> flags)</li>
<li>the build directory&rsquo;s structure and contents are described <a href="#77644b46-c404-4635-8cd4-f6d741c9f579">here</a>; more
complete documentation can be found <a href="https://docs.yoctoproject.org/ref-manual/structure.html">here</a></li>
</ul>
</div>
</div>
<div id="outline-container-1f78978c-9d22-4d70-9aab-de96ee8ab69a" class="outline-3">
<h3 id="1f78978c-9d22-4d70-9aab-de96ee8ab69a">Class</h3>
<div class="outline-text-3" id="text-1f78978c-9d22-4d70-9aab-de96ee8ab69a">
<ul class="org-ul">
<li>contain info that&rsquo;s useful to share between <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>; typically this is
common build information (e.g. how to build a Linux kernel; how to build an
autotools project)</li>
<li>have the <code>.bbclass</code> suffix</li>
<li>the class <code>classes/base.bbclass</code> is implicitly inherited in every <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
<li>are pulled in by <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> with the <code>inherit</code> keyword</li>
<li>class files are global entities, unlike <a href="#97e812dc-9fef-4f72-a931-4ae140862170">include</a> files, which are more local;
class files can be inherited by any <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, any <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a></li>
</ul>
</div>
</div>
<div id="outline-container-73837aae-7e38-4040-99e9-e5b43fd673ca" class="outline-3">
<h3 id="73837aae-7e38-4040-99e9-e5b43fd673ca">Configuration</h3>
<div class="outline-text-3" id="text-73837aae-7e38-4040-99e9-e5b43fd673ca">
<ul class="org-ul">
<li>these files instruct what to build and what to put into the image to support
a particular platform</li>
<li>have the <code>.conf</code> suffix</li>
<li>configure several areas:
<ul class="org-ul">
<li>machine-specific config (i.e. machine definitions; see
e.g. <code>meta-yocto-bsp/conf/machine/</code>)</li>
<li><a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a> config (e.g. for <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> itself)</li>
<li>compiler tuning</li>
<li>general common config options</li>
<li>user config options</li>
</ul></li>
<li><code>conf/local.conf</code> from the <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build directory</a> contains user-defined <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a>
that affect every build</li>
<li><code>conf/local.conf</code> from a particular <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> defines stuff for a layer like its
name, priority, dependencies on other layers, etc.</li>
<li>for config syntax, see <a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-metadata.html">here</a></li>
<li>a list of variables is given <a href="https://docs.yoctoproject.org/ref-manual/variables.html">here</a>; applicable contexts are given <a href="https://docs.yoctoproject.org/ref-manual/varlocality.html">here</a></li>
</ul>
</div>
</div>
