content/yocto.org
*** Dependency
:PROPERTIES:
:ID:       ff999862-e2a2-482c-93a4-55151cb59154
:CUSTOM_ID: ff999862-e2a2-482c-93a4-55151cb59154
:END:
- things that are specified by [[#b1a75489-4822-43b0-8fd4-639d535cad33][metadata]]
- the term could be referring to a few different things:
  - build-time
    - compilers and other build tools, static libraries, etc.
    - a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] can express such a dependency with the =DEPENDS= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]]
  - run-time
    - fonts, icons, dynamic libraries, plugins, language interpreters, etc.
    - a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] can express such a dependency with the =RDEPENDS= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]]
    - the results of most [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] are [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] managed by the package manager,
      which will by extension manage package dependencies
    - there are also the self-explanatory =RCONFLICTS=, and =RREPLACES=
  - tasks
    - [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] expresses dependencies by having tasks depend the completion of
      other tasks
    - [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OE-Core]] provides a vast set of [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]] to handle the default task
      dependencies commonly used
- also, when a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] depends on X, this can mean:
  - we need to build the particular recipe called X
    - a recipe can satisfy this dependency by just being named =X_<version>.bb=
  - we need the functionality called X, and the particular implementation
    doesn't matter
    - a recipe can satisfy this dependency by adding X to the =PROVIDES= string
      in its [[#73837aae-7e38-4040-99e9-e5b43fd673ca][config]]
- multiple recipes can satisfy a dependency
  - the =PREFERRED_PROVIDER_*= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] indicate to [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] which ones we prefer
    (e.g. =PREFERRED_PROVIDER_virtual/kernel= might be set to =linux-yocto=)
  - all else being equal, the highest version of a provider takes precedence
    - if we want to dodge bleeding-edge development versions, we can soften this
      behaviour by setting =DEFAULT_PREFERENCE= to =-1= (picks the stable version by
      default)
    - or we can override this completely with =PREFERRED_VERSION_*=, which is
      often done in [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSPs]] for bootloaders and whatnot
*** Devtool
:PROPERTIES:
:ID:       28a59763-8b1e-4c36-8c07-aafde51a8081
:CUSTOM_ID: 28a59763-8b1e-4c36-8c07-aafde51a8081
:END:
- a command-line tool that comes with an [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][eSDK]]
- it assists with the creation/modification/updating of [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]
- an eSDK extends a regular SDK by including devtool, allowing one to
  externally:
  - generate [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]
  - build [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]
  - build [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]]
  - install [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] in the internal toolchain
  - deploy [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] to a particular target (i.e. directly, for testing
    purposes, not to a package feed)
  - launch the image in QEMU
- devtool can be used within the eSDK environment (i.e. once we've run the
  eSDK environment setup script), but essentially, an eSDK is a snapshot of
  the environment used to create it, thus all devtool commands are available
  inside the original Yocto [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build environment]]
- devtool creates for itself a special "workspace" [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]], within which one can
  add new [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] or modifications to existing [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]
- run =devtool --help= to see all the commands
- devtool can automatically generate a recipe from an external git repository;
  currently it can generate a (tentative/to be modified) recipe for projects
  based on the following:
  - autotools (autoconf and automake)
  - cmake
  - scons
  - qmake
  - a plain Makefile
  - the Node.js module
  - python modules that use setuptools or distutils
- more on this [[https://docs.yoctoproject.org/sdk-manual/extensible.html][here]]; quick reference [[https://docs.yoctoproject.org/ref-manual/devtool-reference.html][here]]
*** Distro
:PROPERTIES:
:ID:       887aaab6-76ef-43b5-8592-127935253e7a
:CUSTOM_ID: 887aaab6-76ef-43b5-8592-127935253e7a
:END:
- an abstraction of the finished system
- basically a selection of software components not yet tailored for the
  specifics of the hardware
  - when a machine supports a feature, this does not imply that the target
    system supports it; the distro must provide its underlying base
  - e.g. if machine supports Wi-Fi but the distro does not, apps will be built
    with Wi-Fi support disabled (system won't have Wi-Fi support); if the
    distro has Wi-Fi support but the machine does not, the modules and apps
    needed for the Wi-Fi will not be installed in images built for that
    machine (but the distro and its modules will have support for Wi-Fi
    enabled)
- the reference distro, [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]], for example, may be tweaked by
  machine-specific or image-specific definitions
- we can set the =DISTRO= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] to point to a particular distro [[#73837aae-7e38-4040-99e9-e5b43fd673ca][configuration]]
  (e.g. if set to "poky", it will refer to =meta-poky/conf/distro/poky.conf=)
  - if =DISTRO= is left blank, a set of default configurations will be used;
    these are specified in =meta/conf/distro/defaultsetup.conf=
- see [[https://docs.yoctoproject.org/ref-manual/features.html#distro-features][here]] for how to enable distro-relevant features (e.g. include vfat
  support)
  - machine-relevants features, on the other hand, are shown [[https://docs.yoctoproject.org/ref-manual/features.html#machine-features][here]]
