yocto.html
<div id="outline-container-ff999862-e2a2-482c-93a4-55151cb59154" class="outline-3">
<h3 id="ff999862-e2a2-482c-93a4-55151cb59154">Dependency</h3>
<div class="outline-text-3" id="text-ff999862-e2a2-482c-93a4-55151cb59154">
<ul class="org-ul">
<li>things that are specified by <a href="#b1a75489-4822-43b0-8fd4-639d535cad33">metadata</a></li>
<li>the term could be referring to a few different things:
<ul class="org-ul">
<li>build-time
<ul class="org-ul">
<li>compilers and other build tools, static libraries, etc.</li>
<li>a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> can express such a dependency with the <code>DEPENDS</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a></li>
</ul></li>
<li>run-time
<ul class="org-ul">
<li>fonts, icons, dynamic libraries, plugins, language interpreters, etc.</li>
<li>a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> can express such a dependency with the <code>RDEPENDS</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a></li>
<li>the results of most <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> are <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> managed by the package manager,
which will by extension manage package dependencies</li>
<li>there are also the self-explanatory <code>RCONFLICTS</code>, and <code>RREPLACES</code></li>
</ul></li>
<li>tasks
<ul class="org-ul">
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> expresses dependencies by having tasks depend the completion of
other tasks</li>
<li><a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OE-Core</a> provides a vast set of <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a> to handle the default task
dependencies commonly used</li>
</ul></li>
</ul></li>
<li>also, when a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> depends on X, this can mean:
<ul class="org-ul">
<li>we need to build the particular recipe called X
<ul class="org-ul">
<li>a recipe can satisfy this dependency by just being named <code>X_&lt;version&gt;.bb</code></li>
</ul></li>
<li>we need the functionality called X, and the particular implementation
doesn&rsquo;t matter
<ul class="org-ul">
<li>a recipe can satisfy this dependency by adding X to the <code>PROVIDES</code> string
in its <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">config</a></li>
</ul></li>
</ul></li>
<li>multiple recipes can satisfy a dependency
<ul class="org-ul">
<li>the <code>PREFERRED_PROVIDER_*</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> indicate to <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> which ones we prefer
(e.g. <code>PREFERRED_PROVIDER_virtual/kernel</code> might be set to <code>linux-yocto</code>)</li>
<li>all else being equal, the highest version of a provider takes precedence
<ul class="org-ul">
<li>if we want to dodge bleeding-edge development versions, we can soften this
behaviour by setting <code>DEFAULT_PREFERENCE</code> to <code>-1</code> (picks the stable version by
default)</li>
<li>or we can override this completely with <code>PREFERRED_VERSION_*</code>, which is
often done in <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSPs</a> for bootloaders and whatnot</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-28a59763-8b1e-4c36-8c07-aafde51a8081" class="outline-3">
<h3 id="28a59763-8b1e-4c36-8c07-aafde51a8081">Devtool</h3>
<div class="outline-text-3" id="text-28a59763-8b1e-4c36-8c07-aafde51a8081">
<ul class="org-ul">
<li>a command-line tool that comes with an <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">eSDK</a></li>
<li>it assists with the creation/modification/updating of <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a></li>
<li>an eSDK extends a regular SDK by including devtool, allowing one to
externally:
<ul class="org-ul">
<li>generate <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a></li>
<li>build <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a></li>
<li>build <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a></li>
<li>install <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> in the internal toolchain</li>
<li>deploy <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> to a particular target (i.e. directly, for testing
purposes, not to a package feed)</li>
<li>launch the image in QEMU</li>
</ul></li>
<li>devtool can be used within the eSDK environment (i.e. once we&rsquo;ve run the
eSDK environment setup script), but essentially, an eSDK is a snapshot of
the environment used to create it, thus all devtool commands are available
inside the original Yocto <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build environment</a></li>
<li>devtool creates for itself a special &ldquo;workspace&rdquo; <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a>, within which one can
add new <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> or modifications to existing <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a></li>
<li>run <code>devtool --help</code> to see all the commands</li>
<li>devtool can automatically generate a recipe from an external git repository;
currently it can generate a (tentative/to be modified) recipe for projects
based on the following:
<ul class="org-ul">
<li>autotools (autoconf and automake)</li>
<li>cmake</li>
<li>scons</li>
<li>qmake</li>
<li>a plain Makefile</li>
<li>the Node.js module</li>
<li>python modules that use setuptools or distutils</li>
</ul></li>
<li>more on this <a href="https://docs.yoctoproject.org/sdk-manual/extensible.html">here</a>; quick reference <a href="https://docs.yoctoproject.org/ref-manual/devtool-reference.html">here</a></li>
</ul>
</div>
</div>
<div id="outline-container-887aaab6-76ef-43b5-8592-127935253e7a" class="outline-3">
<h3 id="887aaab6-76ef-43b5-8592-127935253e7a">Distro</h3>
<div class="outline-text-3" id="text-887aaab6-76ef-43b5-8592-127935253e7a">
<ul class="org-ul">
<li>an abstraction of the finished system</li>
<li>basically a selection of software components not yet tailored for the
specifics of the hardware
<ul class="org-ul">
<li>when a machine supports a feature, this does not imply that the target
system supports it; the distro must provide its underlying base</li>
<li>e.g. if machine supports Wi-Fi but the distro does not, apps will be built
with Wi-Fi support disabled (system won&rsquo;t have Wi-Fi support); if the
distro has Wi-Fi support but the machine does not, the modules and apps
needed for the Wi-Fi will not be installed in images built for that
machine (but the distro and its modules will have support for Wi-Fi
enabled)</li>
</ul></li>
<li>the reference distro, <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a>, for example, may be tweaked by
machine-specific or image-specific definitions</li>
<li>we can set the <code>DISTRO</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> to point to a particular distro <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">configuration</a>
(e.g. if set to &ldquo;poky&rdquo;, it will refer to <code>meta-poky/conf/distro/poky.conf</code>)
<ul class="org-ul">
<li>if <code>DISTRO</code> is left blank, a set of default configurations will be used;
these are specified in <code>meta/conf/distro/defaultsetup.conf</code></li>
</ul></li>
<li>see <a href="https://docs.yoctoproject.org/ref-manual/features.html#distro-features">here</a> for how to enable distro-relevant features (e.g. include vfat
support)
<ul class="org-ul">
<li>machine-relevants features, on the other hand, are shown <a href="https://docs.yoctoproject.org/ref-manual/features.html#machine-features">here</a></li>
</ul></li>
</ul>
</div>
</div>
