content/yocto.org
*** eSDK
:PROPERTIES:
:ID:       ec39dfb8-2723-41a2-ad1e-26ae052595d9
:CUSTOM_ID: ec39dfb8-2723-41a2-ad1e-26ae052595d9
:END:
- an SDK is a standalone cross-development toolchain and libraries for
  building stuff against the target environment on the device; they are
  generated against a particular [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
  - note that even where host and target are the same architecture, this is in
    some sense still a cross-build (i.e. not a native build), because the
    target binary uses a [[#d955a4e4-3e7c-478b-8e57-286a7c194852][staged root filesystem]] to find its dependencies
  - only where the SDK was to run on the target itself would we call it a
    native SDK (but targets usually aren't powerful enough for this job
    anyway)
- the SDK may be intended to run on some machine other than the host it was
  generated in (that of an application developer); this avoids other
  developers needing a full installation of the Yocto Project just to build
  [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] for the device
- a standard SDK consists of:
  - cross-development toolchain (compiler, debugger, and other tools)
  - development libraries, headers, and symbols for everything that will be
    present on the target
  - environment setup script (defines variables for SDK usage)
  - potentially it may also rely on QEMU to emulate the target
- an /eSDK/ (the "e" stands for "extensible") is all this, plus [[#28a59763-8b1e-4c36-8c07-aafde51a8081][devtool]]
  - thus, for example, we could generate an eSDK against one of the standard
    [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] (like =core-image-full-cmdline=), then build and install any extra
    dependencies into the SDK using the Extensible SDK (normally, we would
    generate an SDK against a customised [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] that already fits out
    application needs)
- the SDK would be distributed in addition to the target image/distribution
  (otherwise how would they test the software they're building for it?)
- we generate an SDK installer for a dev environment for some target [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] by
  running the =populate_sdk= or =populate_sdk_ext= tasks for that image's [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
  - the installer script will be named something like
    =poky-<c_library>-<host_machine>-<target_image>-<target_machine>-toolchain-<version>.sh=,
    and once generated can be found in =tmp/deploy/sdk/=
  - by default this script will install to a place in =/opt/poky/=
  - once installed, within it will be found a dev environment setup script
    - this is much like the =oe-init-build-env= script that sets up the
      [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build directory]]
      - but don't have them both sourced at the same time!
    - note that this environment may not yet be plug-and-play; we may still need
      to add flags, namely, to =CC=, =CXX=, =CPP=, =AS=, and =LD=
      - e.g. ARM compilers may work for a wide range of ARM processors; we may
        need to supply more info (e.g. specifying the kind of FPU present)
      - also, we may need to set the [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroot]] sysroot; but such a sysroot will be
        provided within the SDK
  - the installer is built for a particular machine given by =SDKMACHINE=, which
    is set by default to the same machine as the build host (=BUILD_ARCH=)
    - we just need to change this value to something else
  - pre-built SDK installers also exist (see [[https://downloads.yoctoproject.org/releases/yocto/yocto-4.0/toolchain/x86_64/][here]], for example)
- note that if we only need the generic toolchain and debugging tools, we can
  just build the =meta-toolchain= [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] (likewise will be found in
  =tmp/deploy/sdk/= once generated)
  - this is used mainly for Linux kernel and bootloader development and their
    debugging processes
*** Fetcher
:PROPERTIES:
:ID:       e2c85bd3-accf-49ea-97ad-fa47a1bb272b
:CUSTOM_ID: e2c85bd3-accf-49ea-97ad-fa47a1bb272b
:END:
- when executing =do_fetch=, [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] employs /fetcher modules/ to fetch resources
  from the filesystem or network
- the URL prefix of a path (e.g. =file://=, =https://=, =git://=, =az://=) determines
  how the resource will be fetched
- in the case of git, the trailing =branch=<branch_name>= parameter specifies
  the desired branch; alternatively, the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] can set =SRCREV= to a particular
  commit
- some [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]] of concern:
  - =DL_DIR= (which defaults to =downloads= in our [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build directory]])
    - this controls where downloaded files are cached
    - it's consulted by the fetcher first in case we already have the resource
    - we can set this to a shared location to share this cache with other
      developers
    - if we want a shareable download cache, we shouls also enable the tarball
      generation for the SCM backends in the download folder; add
      =BB_GENERATE_MIRROR_TARBALLS = "1"= to your project's =conf/local.conf=
  - =MIRRORS=
    - points to a set of known caching mirrors
    - this will be searched before the fetcher bothers obtaining the resource
      directly
  - =PREMIRRORS=
    - points to a set of mirrors that will be searched immediately before
      =MIRRORS=
    - companies usually point these at caching servers hosted on the local
      network, for when wider internet access is restricted
      - if we want to disable fetching from the internet entirely (e.g. for
        cleanroom implementations), we can set =BB_NO_NETWORK= to ="1"= in our
        =local.conf=
