yocto.html
<div id="outline-container-ec39dfb8-2723-41a2-ad1e-26ae052595d9" class="outline-3">
<h3 id="ec39dfb8-2723-41a2-ad1e-26ae052595d9">eSDK</h3>
<div class="outline-text-3" id="text-ec39dfb8-2723-41a2-ad1e-26ae052595d9">
<ul class="org-ul">
<li>an SDK is a standalone cross-development toolchain and libraries for
building stuff against the target environment on the device; they are
generated against a particular <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>
<ul class="org-ul">
<li>note that even where host and target are the same architecture, this is in
some sense still a cross-build (i.e. not a native build), because the
target binary uses a <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">staged root filesystem</a> to find its dependencies</li>
<li>only where the SDK was to run on the target itself would we call it a
native SDK (but targets usually aren&rsquo;t powerful enough for this job
anyway)</li>
</ul></li>
<li>the SDK may be intended to run on some machine other than the host it was
generated in (that of an application developer); this avoids other
developers needing a full installation of the Yocto Project just to build
<a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> for the device</li>
<li>a standard SDK consists of:
<ul class="org-ul">
<li>cross-development toolchain (compiler, debugger, and other tools)</li>
<li>development libraries, headers, and symbols for everything that will be
present on the target</li>
<li>environment setup script (defines variables for SDK usage)</li>
<li>potentially it may also rely on QEMU to emulate the target</li>
</ul></li>
<li>an <i>eSDK</i> (the &ldquo;e&rdquo; stands for &ldquo;extensible&rdquo;) is all this, plus <a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">devtool</a>
<ul class="org-ul">
<li>thus, for example, we could generate an eSDK against one of the standard
<a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> (like <code>core-image-full-cmdline</code>), then build and install any extra
dependencies into the SDK using the Extensible SDK (normally, we would
generate an SDK against a customised <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> that already fits out
application needs)</li>
</ul></li>
<li>the SDK would be distributed in addition to the target image/distribution
(otherwise how would they test the software they&rsquo;re building for it?)</li>
<li>we generate an SDK installer for a dev environment for some target <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> by
running the <code>populate_sdk</code> or <code>populate_sdk_ext</code> tasks for that image&rsquo;s <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>
<ul class="org-ul">
<li>the installer script will be named something like
<code>poky-&lt;c_library&gt;-&lt;host_machine&gt;-&lt;target_image&gt;-&lt;target_machine&gt;-toolchain-&lt;version&gt;.sh</code>,
and once generated can be found in <code>tmp/deploy/sdk/</code></li>
<li>by default this script will install to a place in <code>/opt/poky/</code></li>
<li>once installed, within it will be found a dev environment setup script
<ul class="org-ul">
<li>this is much like the <code>oe-init-build-env</code> script that sets up the
<a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build directory</a>
<ul class="org-ul">
<li>but don&rsquo;t have them both sourced at the same time!</li>
</ul></li>
<li>note that this environment may not yet be plug-and-play; we may still need
to add flags, namely, to <code>CC</code>, <code>CXX</code>, <code>CPP</code>, <code>AS</code>, and <code>LD</code>
<ul class="org-ul">
<li>e.g. ARM compilers may work for a wide range of ARM processors; we may
need to supply more info (e.g. specifying the kind of FPU present)</li>
<li>also, we may need to set the <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroot</a> sysroot; but such a sysroot will be
provided within the SDK</li>
</ul></li>
</ul></li>
<li>the installer is built for a particular machine given by <code>SDKMACHINE</code>, which
is set by default to the same machine as the build host (<code>BUILD_ARCH</code>)
<ul class="org-ul">
<li>we just need to change this value to something else</li>
</ul></li>
<li>pre-built SDK installers also exist (see <a href="https://downloads.yoctoproject.org/releases/yocto/yocto-4.0/toolchain/x86_64/">here</a>, for example)</li>
</ul></li>
<li>note that if we only need the generic toolchain and debugging tools, we can
just build the <code>meta-toolchain</code> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> (likewise will be found in
<code>tmp/deploy/sdk/</code> once generated)
<ul class="org-ul">
<li>this is used mainly for Linux kernel and bootloader development and their
debugging processes</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-e2c85bd3-accf-49ea-97ad-fa47a1bb272b" class="outline-3">
<h3 id="e2c85bd3-accf-49ea-97ad-fa47a1bb272b">Fetcher</h3>
<div class="outline-text-3" id="text-e2c85bd3-accf-49ea-97ad-fa47a1bb272b">
<ul class="org-ul">
<li>when executing <code>do_fetch</code>, <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> employs <i>fetcher modules</i> to fetch resources
from the filesystem or network</li>
<li>the URL prefix of a path (e.g. <code>file://</code>, <code>https://</code>, <code>git://</code>, <code>az://</code>) determines
how the resource will be fetched</li>
<li>in the case of git, the trailing <code>branch=&lt;branch_name&gt;</code> parameter specifies
the desired branch; alternatively, the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> can set <code>SRCREV</code> to a particular
commit</li>
<li>some <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a> of concern:
<ul class="org-ul">
<li><code>DL_DIR</code> (which defaults to <code>downloads</code> in our <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build directory</a>)
<ul class="org-ul">
<li>this controls where downloaded files are cached</li>
<li>it&rsquo;s consulted by the fetcher first in case we already have the resource</li>
<li>we can set this to a shared location to share this cache with other
developers</li>
<li>if we want a shareable download cache, we shouls also enable the tarball
generation for the SCM backends in the download folder; add
<code>BB_GENERATE_MIRROR_TARBALLS = "1"</code> to your project&rsquo;s <code>conf/local.conf</code></li>
</ul></li>
<li><code>MIRRORS</code>
<ul class="org-ul">
<li>points to a set of known caching mirrors</li>
<li>this will be searched before the fetcher bothers obtaining the resource
directly</li>
</ul></li>
<li><code>PREMIRRORS</code>
<ul class="org-ul">
<li>points to a set of mirrors that will be searched immediately before
<code>MIRRORS</code></li>
<li>companies usually point these at caching servers hosted on the local
network, for when wider internet access is restricted
<ul class="org-ul">
<li>if we want to disable fetching from the internet entirely (e.g. for
cleanroom implementations), we can set <code>BB_NO_NETWORK</code> to <code>"1"</code> in our
<code>local.conf</code></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
