content/yocto.org
*** Image
:PROPERTIES:
:ID:       d04f848b-f29b-4fc5-b2c6-1c2331456bf1
:CUSTOM_ID: d04f848b-f29b-4fc5-b2c6-1c2331456bf1
:END:
- something that can be flashed/extracted, which may include a rootfs, a
  bootloader, device tree binary, and kernel
- common formats are =.sdcard=, =.tar.gz=, =.dd=, et al.
- image [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] are usually gathered in something like
  =<layer>/<recipe>/images/=
  - e.g. the =core-image-minimal= recipe is found in
    =meta/recipes-core/images/coreimage-minimal.bb=
- some image [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] that the [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][OpenEmbedded build system]] provides out of the
  box (found in =meta*/recipes*/images/*.bb=):
  - =core-image-minimal=
    - a small console-based system
    - useful for tests and as a basis point for further customised images
  - =core-image-base=
    - console-only, provides additional basic hardware support
  - =core-image-minimal-initramfs=
    - as above, but built as a ramdisk
  - =core-image-weston=
    - provides Wayland protocol libraries and the reference Weston compositor
  - =core-image-x11=
    - a basic image with support for graphics through an X11 server and a
      terminal app (=xterminal=)
  - =core-image-sato=
    - a full graphical system based on Sato, a mobile graphical environment
      built on X11 and GNOME
    - the image also includes several apps including a terminal, editor, and
      file manager
  - =core-image-full-cmdline=
    - console-only image with more full-featured Linux system functionality
      installed
- the list of [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] that will be installed into an image is defined by the
  =IMAGE_INSTALL= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]]
  - usually we would add packages to this variable in the image's [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], not
    our =conf/local.conf=
- we can also enable image-relevant features by appending to the
  =IMAGE_FEATURES= and =EXTRA_IMAGE_FEATURES= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]] (the former would
  typically be used in a [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]]/[[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], the latter in a =conf/local.conf=)
  - for example: =debug-tweaks= for some quality-of-life stuff; =dev-pkgs= to
    include development libraries and headers for all the installed packages
    (more on these [[https://docs.yoctoproject.org/ref-manual/features.html#image-features][here]])
- there's also =PACKAGE_EXCLUDE= to exclude particular [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]]
  - this will only exclude packages that are explicitly installed; if an
    excluded package is a dependency for something, [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] will throw an
    error
- the =IMAGE_FSTYPES= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] lets you specify one or more filesystem types for
  the root filesystem to be generated as (the =IMAGE_TYPES= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] just lists
  all supported types)
- during image generation, any non-target =postinst= scripts for each [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]]
  will be run
*** Include
:PROPERTIES:
:ID:       97e812dc-9fef-4f72-a931-4ae140862170
:CUSTOM_ID: 97e812dc-9fef-4f72-a931-4ae140862170
:END:
- have a =.inc= suffix
- contain info common to several [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]], allowing information to be shared
  among them
- include files are local entities, unlike [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] files, which are global;
  include files reside alongside [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]], and exist to avoid duplication
- are pulled in by [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] with the =include= or =require= keywords (=require=
  produces an error if the file doesn't exist; =include= does not)
