yocto.html
<div id="outline-container-d04f848b-f29b-4fc5-b2c6-1c2331456bf1" class="outline-3">
<h3 id="d04f848b-f29b-4fc5-b2c6-1c2331456bf1">Image</h3>
<div class="outline-text-3" id="text-d04f848b-f29b-4fc5-b2c6-1c2331456bf1">
<ul class="org-ul">
<li>something that can be flashed/extracted, which may include a rootfs, a
bootloader, device tree binary, and kernel</li>
<li>common formats are <code>.sdcard</code>, <code>.tar.gz</code>, <code>.dd</code>, et al.</li>
<li>image <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> are usually gathered in something like
<code>&lt;layer&gt;/&lt;recipe&gt;/images/</code>
<ul class="org-ul">
<li>e.g. the <code>core-image-minimal</code> recipe is found in
<code>meta/recipes-core/images/coreimage-minimal.bb</code></li>
</ul></li>
<li>some image <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> that the <a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">OpenEmbedded build system</a> provides out of the
box (found in <code>meta*/recipes*/images/*.bb</code>):
<ul class="org-ul">
<li><code>core-image-minimal</code>
<ul class="org-ul">
<li>a small console-based system</li>
<li>useful for tests and as a basis point for further customised images</li>
</ul></li>
<li><code>core-image-base</code>
<ul class="org-ul">
<li>console-only, provides additional basic hardware support</li>
</ul></li>
<li><code>core-image-minimal-initramfs</code>
<ul class="org-ul">
<li>as above, but built as a ramdisk</li>
</ul></li>
<li><code>core-image-weston</code>
<ul class="org-ul">
<li>provides Wayland protocol libraries and the reference Weston compositor</li>
</ul></li>
<li><code>core-image-x11</code>
<ul class="org-ul">
<li>a basic image with support for graphics through an X11 server and a
terminal app (<code>xterminal</code>)</li>
</ul></li>
<li><code>core-image-sato</code>
<ul class="org-ul">
<li>a full graphical system based on Sato, a mobile graphical environment
built on X11 and GNOME</li>
<li>the image also includes several apps including a terminal, editor, and
file manager</li>
</ul></li>
<li><code>core-image-full-cmdline</code>
<ul class="org-ul">
<li>console-only image with more full-featured Linux system functionality
installed</li>
</ul></li>
</ul></li>
<li>the list of <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> that will be installed into an image is defined by the
<code>IMAGE_INSTALL</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a>
<ul class="org-ul">
<li>usually we would add packages to this variable in the image&rsquo;s <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, not
our <code>conf/local.conf</code></li>
</ul></li>
<li>we can also enable image-relevant features by appending to the
<code>IMAGE_FEATURES</code> and <code>EXTRA_IMAGE_FEATURES</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a> (the former would
typically be used in a <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a>/<a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, the latter in a <code>conf/local.conf</code>)
<ul class="org-ul">
<li>for example: <code>debug-tweaks</code> for some quality-of-life stuff; <code>dev-pkgs</code> to
include development libraries and headers for all the installed packages
(more on these <a href="https://docs.yoctoproject.org/ref-manual/features.html#image-features">here</a>)</li>
</ul></li>
<li>there&rsquo;s also <code>PACKAGE_EXCLUDE</code> to exclude particular <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a>
<ul class="org-ul">
<li>this will only exclude packages that are explicitly installed; if an
excluded package is a dependency for something, <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> will throw an
error</li>
</ul></li>
<li>the <code>IMAGE_FSTYPES</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> lets you specify one or more filesystem types for
the root filesystem to be generated as (the <code>IMAGE_TYPES</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> just lists
all supported types)</li>
<li>during image generation, any non-target <code>postinst</code> scripts for each <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a>
will be run</li>
</ul>
</div>
</div>
<div id="outline-container-97e812dc-9fef-4f72-a931-4ae140862170" class="outline-3">
<h3 id="97e812dc-9fef-4f72-a931-4ae140862170">Include</h3>
<div class="outline-text-3" id="text-97e812dc-9fef-4f72-a931-4ae140862170">
<ul class="org-ul">
<li>have a <code>.inc</code> suffix</li>
<li>contain info common to several <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>, allowing information to be shared
among them</li>
<li>include files are local entities, unlike <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> files, which are global;
include files reside alongside <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>, and exist to avoid duplication</li>
<li>are pulled in by <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> with the <code>include</code> or <code>require</code> keywords (<code>require</code>
produces an error if the file doesn&rsquo;t exist; <code>include</code> does not)</li>
</ul>
</div>
</div>
