content/yocto.org
*** Layer
:PROPERTIES:
:ID:       d4009f0f-f371-454b-b30f-7fda430c0028
:CUSTOM_ID: d4009f0f-f371-454b-b30f-7fda430c0028
:END:
- a repo that contains a collection of related [[#b1a75489-4822-43b0-8fd4-639d535cad33][metadata]] (with usually at least
  one [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]])
- repos have the naming convention =meta-*= (because layers hold metadata)
- repos may have separate branches of support for specific Yocto versions by
  codename (Fido, Dizzy, Morty, Pyro, etc.)
- layers are used to extend the stable base that comes with Yocto
- every layer contains a =conf/layer.conf= file
  - this is the layer's analogue of the [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build-specific]] =local.conf=
  - we should always consider moving most of the stuff in our top-level 
- there are different types of layers, reflecting the fact that we can extend
  different parts of Yocto, which includes:
  - [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] layers
  - [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]] layers (we may write of these for a particular project)
  - container layers (a layer that just contains/groups together other layers)
  - software layers
  - mixin layers (small layers created (usually by the community) specifically
    for adding some feature to an existing LTS release, e.g. =meta-lts-mixins=)
- layers have dependencies on other layers
- the [[https://www.yoctoproject.org/development/yocto-project-compatible-layers/][Yocto Project Curated Layer Index]] and [[https://layers.openembedded.org/layerindex/branch/master/layers/][OpenEmbedded Layer Index]] both
  contain layers from which you can use or leverage
- the core [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]] are:
  - =meta=
    - the OpenEmbedded core
    - supports seven different processor architectures (ARM, ARM64, x86,
      x86-64, PowerPC, PowerPC 64, MIPS, MIPS64, RISC-V32, and RISC-V 64),
      only supporting platforms to be emulated by QEMU
  - =meta-poky=
    - [[#b1a75489-4822-43b0-8fd4-639d535cad33][metadata]] specific to the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]]
    - serves as a kind of curated template for developing a custom [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]]
  - =meta-yocto-bsp=
    - contains reference [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSPs]] for various machines that Yocto Project supports
      out of the box
- we can create the skeleton of a new custom layer with the
  =scripts/yocto-layer= script
- we can create and/or include layers in a [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build]] with the =bitbake-layers=
  script, which adds it to =conf/bblayers.conf= on our behalf
  - by doing so, the layer's path is appended to the =BBPATH= variable
  - thus we may first need to copy the layer directory (=meta-whatever/=) to a
    suitable location (the default meta layers are in [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky's]] top-level
    directory)
- layers usually contain a =README=; read it
- layers have priorities
  - this value, along with the recipe version number, helps [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] choose
    which [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] to use when the recipe is included by more than one layer,
    and vice versa for [[#d2fee7d5-7007-4e33-85cb-6c9a370990fd][append]] files (higher priority = appended first)
  - [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] belonging to the higher priority layer will be used even if the
    recipe version in that layer is lower
  - the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] layer and the [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OpenEmbedded-Core]] layer have a lower priority than
    [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] and [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][eSDK]] layers, since the latter sit on top of the former
- some widely used [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] layers:
  - =meta-allwinner= (AllWinner)
  - =meta-amd=
  - =meta-intel=
  - =meta-freescale= and =meta-freescale-3rdparty= (NXP)
  - =meta-raspberrypi=
  - =meta-riscv= (e.g. for a VisionFive board)
  - =meta-ti= (Texas Instruments)
*** Metadata
:PROPERTIES:
:ID:       b1a75489-4822-43b0-8fd4-639d535cad33
:CUSTOM_ID: b1a75489-4822-43b0-8fd4-639d535cad33
:END:
- stuff that's parsed during a [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][build]]; what a [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] contains
- in other words: [[#73837aae-7e38-4040-99e9-e5b43fd673ca][configs]], [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]], and [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] (associated with =.conf=,
  =.bbclass=, and =.bb=​/​=.bbappend= files respectively)
  - [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] parses a layer's configs first, then uses the definitions therein
    to locate the rest of it
- metadata express [[#ff999862-e2a2-482c-93a4-55151cb59154][dependencies]] on other metadata
- [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OpenEmbedded-Core]] (the =meta= [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]]) is an important set of validated metadata
- in the context of the kernel, metadata might also refer to kernel config
  fragments and features contained in the =yocto-kernel-cache= (a separate git
  repo that provides patches and configuration for the =linux-yocto= kernel
  tree)
*** OpenEmbedded-Core
:PROPERTIES:
:ID:       76978d0b-92f6-40cf-b827-01bd45fd4391
:CUSTOM_ID: 76978d0b-92f6-40cf-b827-01bd45fd4391
:END:
- AKA /OE-Core/
- this is the core [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] of [[#b1a75489-4822-43b0-8fd4-639d535cad33][metadata]], sourced from OpenEmbedded; namely, a
  base layer of [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]], [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]], and associated files
- it is found in =meta/=
*** OpenEmbedded Build System
:PROPERTIES:
:ID:       6ba19863-6771-4f13-9d20-1d4dec02ae6c
:CUSTOM_ID: 6ba19863-6771-4f13-9d20-1d4dec02ae6c
:END:
- the build system
- utilises [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] as a task scheduler and execution engine
- usually, a full build takes ~1 hour, downloads ~4GB of source, and outputs
  ~24GB of files
- in addition to the [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] destined for the target, builds may also need to
  build:
  - the cross-toolchain
  - an internal version of QEMU (which can be run via the =runqemu= wrapper
    script)
