yocto.html
<div id="outline-container-d4009f0f-f371-454b-b30f-7fda430c0028" class="outline-3">
<h3 id="d4009f0f-f371-454b-b30f-7fda430c0028">Layer</h3>
<div class="outline-text-3" id="text-d4009f0f-f371-454b-b30f-7fda430c0028">
<ul class="org-ul">
<li>a repo that contains a collection of related <a href="#b1a75489-4822-43b0-8fd4-639d535cad33">metadata</a> (with usually at least
one <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>)</li>
<li>repos have the naming convention <code>meta-*</code> (because layers hold metadata)</li>
<li>repos may have separate branches of support for specific Yocto versions by
codename (Fido, Dizzy, Morty, Pyro, etc.)</li>
<li>layers are used to extend the stable base that comes with Yocto</li>
<li>every layer contains a <code>conf/layer.conf</code> file
<ul class="org-ul">
<li>this is the layer&rsquo;s analogue of the <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build-specific</a> <code>local.conf</code></li>
<li>we should always consider moving most of the stuff in our top-level</li>
</ul></li>
<li>there are different types of layers, reflecting the fact that we can extend
different parts of Yocto, which includes:
<ul class="org-ul">
<li><a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> layers</li>
<li><a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a> layers (we may write of these for a particular project)</li>
<li>container layers (a layer that just contains/groups together other layers)</li>
<li>software layers</li>
<li>mixin layers (small layers created (usually by the community) specifically
for adding some feature to an existing LTS release, e.g. <code>meta-lts-mixins</code>)</li>
</ul></li>
<li>layers have dependencies on other layers</li>
<li>the <a href="https://www.yoctoproject.org/development/yocto-project-compatible-layers/">Yocto Project Curated Layer Index</a> and <a href="https://layers.openembedded.org/layerindex/branch/master/layers/">OpenEmbedded Layer Index</a> both
contain layers from which you can use or leverage</li>
<li>the core <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a> are:
<ul class="org-ul">
<li><code>meta</code>
<ul class="org-ul">
<li>the OpenEmbedded core</li>
<li>supports seven different processor architectures (ARM, ARM64, x86,
x86-64, PowerPC, PowerPC 64, MIPS, MIPS64, RISC-V32, and RISC-V 64),
only supporting platforms to be emulated by QEMU</li>
</ul></li>
<li><code>meta-poky</code>
<ul class="org-ul">
<li><a href="#b1a75489-4822-43b0-8fd4-639d535cad33">metadata</a> specific to the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> <a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a></li>
<li>serves as a kind of curated template for developing a custom <a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a></li>
</ul></li>
<li><code>meta-yocto-bsp</code>
<ul class="org-ul">
<li>contains reference <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSPs</a> for various machines that Yocto Project supports
out of the box</li>
</ul></li>
</ul></li>
<li>we can create the skeleton of a new custom layer with the
<code>scripts/yocto-layer</code> script</li>
<li>we can create and/or include layers in a <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build</a> with the <code>bitbake-layers</code>
script, which adds it to <code>conf/bblayers.conf</code> on our behalf
<ul class="org-ul">
<li>by doing so, the layer&rsquo;s path is appended to the <code>BBPATH</code> variable</li>
<li>thus we may first need to copy the layer directory (<code>meta-whatever/</code>) to a
suitable location (the default meta layers are in <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky&rsquo;s</a> top-level
directory)</li>
</ul></li>
<li>layers usually contain a <code>README</code>; read it</li>
<li>layers have priorities
<ul class="org-ul">
<li>this value, along with the recipe version number, helps <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> choose
which <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> to use when the recipe is included by more than one layer,
and vice versa for <a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">append</a> files (higher priority = appended first)</li>
<li><a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> belonging to the higher priority layer will be used even if the
recipe version in that layer is lower</li>
<li>the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> layer and the <a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</a> layer have a lower priority than
<a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> and <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">eSDK</a> layers, since the latter sit on top of the former</li>
</ul></li>
<li>some widely used <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> layers:
<ul class="org-ul">
<li><code>meta-allwinner</code> (AllWinner)</li>
<li><code>meta-amd</code></li>
<li><code>meta-intel</code></li>
<li><code>meta-freescale</code> and <code>meta-freescale-3rdparty</code> (NXP)</li>
<li><code>meta-raspberrypi</code></li>
<li><code>meta-riscv</code> (e.g. for a VisionFive board)</li>
<li><code>meta-ti</code> (Texas Instruments)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-b1a75489-4822-43b0-8fd4-639d535cad33" class="outline-3">
<h3 id="b1a75489-4822-43b0-8fd4-639d535cad33">Metadata</h3>
<div class="outline-text-3" id="text-b1a75489-4822-43b0-8fd4-639d535cad33">
<ul class="org-ul">
<li>stuff that&rsquo;s parsed during a <a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">build</a>; what a <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> contains</li>
<li>in other words: <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">configs</a>, <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a>, and <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> (associated with <code>.conf</code>,
<code>.bbclass</code>, and <code>.bb</code>/<code>.bbappend</code> files respectively)
<ul class="org-ul">
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> parses a layer&rsquo;s configs first, then uses the definitions therein
to locate the rest of it</li>
</ul></li>
<li>metadata express <a href="#ff999862-e2a2-482c-93a4-55151cb59154">dependencies</a> on other metadata</li>
<li><a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</a> (the <code>meta</code> <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a>) is an important set of validated metadata</li>
<li>in the context of the kernel, metadata might also refer to kernel config
fragments and features contained in the <code>yocto-kernel-cache</code> (a separate git
repo that provides patches and configuration for the <code>linux-yocto</code> kernel
tree)</li>
</ul>
</div>
</div>
<div id="outline-container-76978d0b-92f6-40cf-b827-01bd45fd4391" class="outline-3">
<h3 id="76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</h3>
<div class="outline-text-3" id="text-76978d0b-92f6-40cf-b827-01bd45fd4391">
<ul class="org-ul">
<li>AKA <i>OE-Core</i></li>
<li>this is the core <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> of <a href="#b1a75489-4822-43b0-8fd4-639d535cad33">metadata</a>, sourced from OpenEmbedded; namely, a
base layer of <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>, <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a>, and associated files</li>
<li>it is found in <code>meta/</code></li>
</ul>
</div>
</div>
<div id="outline-container-6ba19863-6771-4f13-9d20-1d4dec02ae6c" class="outline-3">
<h3 id="6ba19863-6771-4f13-9d20-1d4dec02ae6c">OpenEmbedded Build System</h3>
<div class="outline-text-3" id="text-6ba19863-6771-4f13-9d20-1d4dec02ae6c">
<ul class="org-ul">
<li>the build system</li>
<li>utilises <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> as a task scheduler and execution engine</li>
<li>usually, a full build takes ~1 hour, downloads ~4GB of source, and outputs
~24GB of files</li>
<li>in addition to the <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> destined for the target, builds may also need to
build:
<ul class="org-ul">
<li>the cross-toolchain</li>
<li>an internal version of QEMU (which can be run via the <code>runqemu</code> wrapper
script)</li>
</ul></li>
</ul>
</div>
</div>
