content/yocto.org
*** Package
:PROPERTIES:
:ID:       ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e
:CUSTOM_ID: ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e
:END:
- an output of a [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][baked]] [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
- may be wrapped in an archival format: =.deb=, =.ipk=, =.rpm=, or plain =.tar=
  - the =PACKAGE_CLASSES= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] lets us set one or more [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packaging]] formats for
    our recipes to be packaged up into; we list any of the package [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]]
    like =package_rpm=, =package_deb=, etc.
  - the first package format in the list will be the one used for [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]]
    generation
- packages can include scripts to be run as part of their installation/removal
  to the live target (OR to a root filesystem before being burnt into an
  [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]])
  - such scripts fall into the following categories:
    - =preinst=
      - executes before the package is unpacked
      - if the package has services, it must take this opportunity to stop
        them prior to installation or upgrade
      - also used for data migration
    - =postinst=
      - executes after unpacking
      - typically this will be to complete any required configuration of the
        package
      - if the package has services, it has the opportunity to start or
        restart them here
      - if this script succeeds, the package is marked as installed
        - NOTE: =.rpm= packages whose script runs on the target should always
          return 0; presumably installation failure is signalled some other
          way
      - note that unlike the other hooks, this one is invoked during the
        creation of a root filesystem [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]], i.e. when the package is
        installed onto that filesystem prior to it being burnt to an image
        - sometimes the script will need to be delayed until the first boot
          (the script might need to be executed on the device itself); to
          delay script execution until boot time, we can instead use
          =postinst_ontarget=
        - it's very important that we make sure all =postinst= scripts for
          packages that are installed into the image can be run at the time
          when the root filesystem is created during the build on the host
          system (if we enable =read-only-rootfs=, then the =do_rootfs= task will
          automatically fail if it finds any =postinst_ontarget= scripts)
        - most of the out-of-the-box post-install scripts are engineered so
          that they can run during root filesystem creation; for custom
          scripts, it's up to us to check
        - some common problems that prevent post-install scripts from running
          during root filesystem creation:
          - not using =${D}= in front of absolute paths (=${D}= is the root
            filesystem root on the host during image creation, and blank on
            the target at runtime)
          - attempting to run processes that are specific to or dependent on
            the target architecture (you can work around this by using native
            tools, which run on the host system, to accomplish the same tasks,
            or by alternatively running the processes under QEMU, which has
            the =qemu_run_binary= function; for more info, see the =qemu= [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]])
    - =prerm=
      - usually this is to stop any daemon associated with a package before
        removing files associated with the package
    - =postrm=
      - commonly this is to modify links or other files created by the
        package
  - the systemd and update-rc.d [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]] provide some default scripts, which
    may be customised to our purposes
- note that the =PN=, =PV=, =PR=, variables refer to [[#49922abe-989a-4049-a4e1-d9cd49db6f60][/recipes/]], not packages (the
  use of the letter =P= is a historical misnomers; recipes used to be called
  packages)
*** Package feed
:PROPERTIES:
:ID:       729ed304-8a4e-40f7-a72e-eec793809f77
:CUSTOM_ID: 729ed304-8a4e-40f7-a72e-eec793809f77
:END:
- a package feed is a directory containing binary [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]]
- these "feed" the construction of [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] (e.g. during =do_rootfs=) or [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDKs]]
- the local [[#a2382d7c-15f0-4838-83d5-3c982eaedc05][=tmp/deploy/=]] directory of our [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build]] is one such feed, but a feed
  can also be a shared web server
- package feeds can also be used to facilitate extending or updating existing
  images on devices at runtime, should runtime package management be enabled
- as such, a package feed may need to be accessible remotely (either
  internally in our local development environment, or publicly) so as to:
  - easily test an updated package during the development stage, i.e. on the
    deployed system, without having to completely re-install that system
  - make it possible to install additional packages onto a deployed system
  - update products in the field
- to produce a solid package feed, we must ensure that we have consistent
  increments in the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][=PR=]] variable whenever a [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]] is changed
  - doing this manually can be cumbersome; we can let a [[#cd11671a-4982-43d0-92eb-f510bf1b5d22][=PR= service]] manage it
    for us
- whenever we modify or add packages to a package feed, we'll need to rebuild
  the package index with =bitbake package-index= so that (presumably, building
  an [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] would require the =do_package_index= task, and so we wouldn't need to
  do this in that case)
- the simplest way to expose as package feed: run =python3 -m http.server 5678=
  within e.g. =tmp/deploy/rmp/=
- to add support for package management to an [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]], we must:
  - point =PACKAGE_FEED_URIS= to our http address and given port
  - add =package_management= to =EXTRA_IMAGE_FEATURES=
    - this will add stuff to the [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] needed that it can access the server
      and has the utilities needed to install, remove, and upgrade its
      packages
- of course, the device itself must run the package manager (=opkg=, =apt=,
  =dnf= etc.) to update/install packages
- obviously, we'll need to test stuff before deploying (the testing effort is
  enormous to verify all different upgrade scenarios; a full image upgrade is
  way safer)
