yocto.html
<div id="outline-container-ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e" class="outline-3">
<h3 id="ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">Package</h3>
<div class="outline-text-3" id="text-ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">
<ul class="org-ul">
<li>an output of a <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">baked</a> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
<li>may be wrapped in an archival format: <code>.deb</code>, <code>.ipk</code>, <code>.rpm</code>, or plain <code>.tar</code>
<ul class="org-ul">
<li>the <code>PACKAGE_CLASSES</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> lets us set one or more <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packaging</a> formats for
our recipes to be packaged up into; we list any of the package <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a>
like <code>package_rpm</code>, <code>package_deb</code>, etc.</li>
<li>the first package format in the list will be the one used for <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>
generation</li>
</ul></li>
<li>packages can include scripts to be run as part of their installation/removal
to the live target (OR to a root filesystem before being burnt into an
<a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>)
<ul class="org-ul">
<li>such scripts fall into the following categories:
<ul class="org-ul">
<li><code>preinst</code>
<ul class="org-ul">
<li>executes before the package is unpacked</li>
<li>if the package has services, it must take this opportunity to stop
them prior to installation or upgrade</li>
<li>also used for data migration</li>
</ul></li>
<li><code>postinst</code>
<ul class="org-ul">
<li>executes after unpacking</li>
<li>typically this will be to complete any required configuration of the
package</li>
<li>if the package has services, it has the opportunity to start or
restart them here</li>
<li>if this script succeeds, the package is marked as installed
<ul class="org-ul">
<li>NOTE: <code>.rpm</code> packages whose script runs on the target should always
return 0; presumably installation failure is signalled some other
way</li>
</ul></li>
<li>note that unlike the other hooks, this one is invoked during the
creation of a root filesystem <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>, i.e. when the package is
installed onto that filesystem prior to it being burnt to an image
<ul class="org-ul">
<li>sometimes the script will need to be delayed until the first boot
(the script might need to be executed on the device itself); to
delay script execution until boot time, we can instead use
<code>postinst_ontarget</code></li>
<li>it&rsquo;s very important that we make sure all <code>postinst</code> scripts for
packages that are installed into the image can be run at the time
when the root filesystem is created during the build on the host
system (if we enable <code>read-only-rootfs</code>, then the <code>do_rootfs</code> task will
automatically fail if it finds any <code>postinst_ontarget</code> scripts)</li>
<li>most of the out-of-the-box post-install scripts are engineered so
that they can run during root filesystem creation; for custom
scripts, it&rsquo;s up to us to check</li>
<li>some common problems that prevent post-install scripts from running
during root filesystem creation:
<ul class="org-ul">
<li>not using <code>${D}</code> in front of absolute paths (<code>${D}</code> is the root
filesystem root on the host during image creation, and blank on
the target at runtime)</li>
<li>attempting to run processes that are specific to or dependent on
the target architecture (you can work around this by using native
tools, which run on the host system, to accomplish the same tasks,
or by alternatively running the processes under QEMU, which has
the <code>qemu_run_binary</code> function; for more info, see the <code>qemu</code> <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a>)</li>
</ul></li>
</ul></li>
</ul></li>
<li><code>prerm</code>
<ul class="org-ul">
<li>usually this is to stop any daemon associated with a package before
removing files associated with the package</li>
</ul></li>
<li><code>postrm</code>
<ul class="org-ul">
<li>commonly this is to modify links or other files created by the
package</li>
</ul></li>
</ul></li>
<li>the systemd and update-rc.d <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a> provide some default scripts, which
may be customised to our purposes</li>
</ul></li>
<li>note that the <code>PN</code>, <code>PV</code>, <code>PR</code>, variables refer to <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60"><i>recipes</i></a>, not packages (the
use of the letter <code>P</code> is a historical misnomers; recipes used to be called
packages)</li>
</ul>
</div>
</div>
<div id="outline-container-729ed304-8a4e-40f7-a72e-eec793809f77" class="outline-3">
<h3 id="729ed304-8a4e-40f7-a72e-eec793809f77">Package feed</h3>
<div class="outline-text-3" id="text-729ed304-8a4e-40f7-a72e-eec793809f77">
<ul class="org-ul">
<li>a package feed is a directory containing binary <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a></li>
<li>these &ldquo;feed&rdquo; the construction of <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> (e.g. during <code>do_rootfs</code>) or <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDKs</a></li>
<li>the local <a href="#a2382d7c-15f0-4838-83d5-3c982eaedc05"><code>tmp/deploy/</code></a> directory of our <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build</a> is one such feed, but a feed
can also be a shared web server</li>
<li>package feeds can also be used to facilitate extending or updating existing
images on devices at runtime, should runtime package management be enabled</li>
<li>as such, a package feed may need to be accessible remotely (either
internally in our local development environment, or publicly) so as to:
<ul class="org-ul">
<li>easily test an updated package during the development stage, i.e. on the
deployed system, without having to completely re-install that system</li>
<li>make it possible to install additional packages onto a deployed system</li>
<li>update products in the field</li>
</ul></li>
<li>to produce a solid package feed, we must ensure that we have consistent
increments in the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60"><code>PR</code></a> variable whenever a <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a> is changed
<ul class="org-ul">
<li>doing this manually can be cumbersome; we can let a <a href="#cd11671a-4982-43d0-92eb-f510bf1b5d22"><code>PR</code> service</a> manage it
for us</li>
</ul></li>
<li>whenever we modify or add packages to a package feed, we&rsquo;ll need to rebuild
the package index with <code>bitbake package-index</code> so that (presumably, building
an <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> would require the <code>do_package_index</code> task, and so we wouldn&rsquo;t need to
do this in that case)</li>
<li>the simplest way to expose as package feed: run <code>python3 -m http.server 5678</code>
within e.g. <code>tmp/deploy/rmp/</code></li>
<li>to add support for package management to an <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>, we must:
<ul class="org-ul">
<li>point <code>PACKAGE_FEED_URIS</code> to our http address and given port</li>
<li>add <code>package_management</code> to <code>EXTRA_IMAGE_FEATURES</code>
<ul class="org-ul">
<li>this will add stuff to the <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> needed that it can access the server
and has the utilities needed to install, remove, and upgrade its
packages</li>
</ul></li>
</ul></li>
<li>of course, the device itself must run the package manager (<code>opkg</code>, <code>apt</code>,
<code>dnf</code> etc.) to update/install packages</li>
<li>obviously, we&rsquo;ll need to test stuff before deploying (the testing effort is
enormous to verify all different upgrade scenarios; a full image upgrade is
way safer)</li>
</ul>
</div>
</div>
