content/yocto.org
*** Package group
:PROPERTIES:
:ID:       4f2876d0-3b4a-4be0-9f24-12b4922f7bb6
:CUSTOM_ID: 4f2876d0-3b4a-4be0-9f24-12b4922f7bb6
:END:
- a package group is a kind of [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] that has the sole purpose of creating
  dependencies to simplify [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] creation
- a package group recipe bundles multiple packages together and then, instead
  of having to explicitly specify each package in the =IMAGE_INSTALL= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]],
  one can simply specify the package group name
- the =packagegroup= [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] sets default values appropriate for package group
  recipes (=PACKAGES=, =PACKAGE_ARCH=, =ALLOW_EMPTY=, etc.); all package group
  recipes should inherit this class
- more on this [[https://docs.yoctoproject.org/dev-manual/customizing-images.html#customizing-images-using-custom-package-groups][here]]
*** =PR= Service
:PROPERTIES:
:ID:       cd11671a-4982-43d0-92eb-f510bf1b5d22
:CUSTOM_ID: cd11671a-4982-43d0-92eb-f510bf1b5d22
:END:
- the PR service, part of [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]], increments the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][=PR=]] variable on our behalf
  every time it detects a [[#8254517c-069f-4c02-bcc0-989e195a3cdc][checksum]] change in a task
- normally we would have to increment it manually every time we change
  something; this just makes it easier
- it works by appending the =PR= value with an additional incrementing value;
  e.g. if we have set =PR= to =r34=, then after subsequent =PR= service
  interactions, it will become =r34.1=, =r34.2=, =r34.3=, and so on
- this ensures [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] in our [[#729ed304-8a4e-40f7-a72e-eec793809f77][package feed]] increment linearly, and stay
  compatible with existing package manager apps (rpm, apt, opkg)
- we can still override =PR= in exceptional cases though
- the PR service is disabled by default; we can enable it to run locally by
  adding =PRSERV_HOST = "localhost:0"= to our =local.conf=
  - this approach is adequate when the build happens on a single computer,
    which builds every package of the package feed; [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] will start and
    stop the server at each build
- for setups with multiple computers pushing to a shared [[#729ed304-8a4e-40f7-a72e-eec793809f77][package feed]], we must
  share a single PR service
  - in this case, we would start the PR service on a server using the
    =bitbake-prserv= command, and then point our =PRSERV_HOST= to that server
*** Poky
:PROPERTIES:
:ID:       b00db72c-5c93-441d-887d-9878b84ec993
:CUSTOM_ID: b00db72c-5c93-441d-887d-9878b84ec993
:END:
- a reference distro provided by Yocto to serve as a base for adapting to your
  purposes
- specifically, it's [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OE-Core]] with an extra [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] on top
- thus it's also a vehicle by which to download the Yocto Project proper: just
  git clone =git://git.yoctoproject.org/poky.git= and then check out the most
  recent release version
*** Pseudo
:PROPERTIES:
:ID:       a4dfc074-83f5-47c6-a5c4-c1b6153b906a
:CUSTOM_ID: a4dfc074-83f5-47c6-a5c4-c1b6153b906a
:END:
- [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] has to turn a tree into an image, but this may require doing things
  normally reserved for root (e.g. set the UID and GID of files)
- Pseudo overrides syscalls in order to set up a fake root environment;
  instead of doing the actual root operations, it records what needs to be
  done when the image is generated
- the per-recipe =.db= (database) files where such info is stored can be found
  in the subdirectory of =tmp/work/= in our [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build directory]] where the recipe is
  found
