yocto.html
<div id="outline-container-4f2876d0-3b4a-4be0-9f24-12b4922f7bb6" class="outline-3">
<h3 id="4f2876d0-3b4a-4be0-9f24-12b4922f7bb6">Package group</h3>
<div class="outline-text-3" id="text-4f2876d0-3b4a-4be0-9f24-12b4922f7bb6">
<ul class="org-ul">
<li>a package group is a kind of <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> that has the sole purpose of creating
dependencies to simplify <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> creation</li>
<li>a package group recipe bundles multiple packages together and then, instead
of having to explicitly specify each package in the <code>IMAGE_INSTALL</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a>,
one can simply specify the package group name</li>
<li>the <code>packagegroup</code> <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> sets default values appropriate for package group
recipes (<code>PACKAGES</code>, <code>PACKAGE_ARCH</code>, <code>ALLOW_EMPTY</code>, etc.); all package group
recipes should inherit this class</li>
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/customizing-images.html#customizing-images-using-custom-package-groups">here</a></li>
</ul>
</div>
</div>
<div id="outline-container-cd11671a-4982-43d0-92eb-f510bf1b5d22" class="outline-3">
<h3 id="cd11671a-4982-43d0-92eb-f510bf1b5d22"><code>PR</code> Service</h3>
<div class="outline-text-3" id="text-cd11671a-4982-43d0-92eb-f510bf1b5d22">
<ul class="org-ul">
<li>the PR service, part of <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a>, increments the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60"><code>PR</code></a> variable on our behalf
every time it detects a <a href="#8254517c-069f-4c02-bcc0-989e195a3cdc">checksum</a> change in a task</li>
<li>normally we would have to increment it manually every time we change
something; this just makes it easier</li>
<li>it works by appending the <code>PR</code> value with an additional incrementing value;
e.g. if we have set <code>PR</code> to <code>r34</code>, then after subsequent <code>PR</code> service
interactions, it will become <code>r34.1</code>, <code>r34.2</code>, <code>r34.3</code>, and so on</li>
<li>this ensures <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> in our <a href="#729ed304-8a4e-40f7-a72e-eec793809f77">package feed</a> increment linearly, and stay
compatible with existing package manager apps (rpm, apt, opkg)</li>
<li>we can still override <code>PR</code> in exceptional cases though</li>
<li>the PR service is disabled by default; we can enable it to run locally by
adding <code>PRSERV_HOST = "localhost:0"</code> to our <code>local.conf</code>
<ul class="org-ul">
<li>this approach is adequate when the build happens on a single computer,
which builds every package of the package feed; <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> will start and
stop the server at each build</li>
</ul></li>
<li>for setups with multiple computers pushing to a shared <a href="#729ed304-8a4e-40f7-a72e-eec793809f77">package feed</a>, we must
share a single PR service
<ul class="org-ul">
<li>in this case, we would start the PR service on a server using the
<code>bitbake-prserv</code> command, and then point our <code>PRSERV_HOST</code> to that server</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-b00db72c-5c93-441d-887d-9878b84ec993" class="outline-3">
<h3 id="b00db72c-5c93-441d-887d-9878b84ec993">Poky</h3>
<div class="outline-text-3" id="text-b00db72c-5c93-441d-887d-9878b84ec993">
<ul class="org-ul">
<li>a reference distro provided by Yocto to serve as a base for adapting to your
purposes</li>
<li>specifically, it&rsquo;s <a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OE-Core</a> with an extra <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> on top</li>
<li>thus it&rsquo;s also a vehicle by which to download the Yocto Project proper: just
git clone <code>git://git.yoctoproject.org/poky.git</code> and then check out the most
recent release version</li>
</ul>
</div>
</div>
<div id="outline-container-a4dfc074-83f5-47c6-a5c4-c1b6153b906a" class="outline-3">
<h3 id="a4dfc074-83f5-47c6-a5c4-c1b6153b906a">Pseudo</h3>
<div class="outline-text-3" id="text-a4dfc074-83f5-47c6-a5c4-c1b6153b906a">
<ul class="org-ul">
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> has to turn a tree into an image, but this may require doing things
normally reserved for root (e.g. set the UID and GID of files)</li>
<li>Pseudo overrides syscalls in order to set up a fake root environment;
instead of doing the actual root operations, it records what needs to be
done when the image is generated</li>
<li>the per-recipe <code>.db</code> (database) files where such info is stored can be found
in the subdirectory of <code>tmp/work/</code> in our <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build directory</a> where the recipe is
found</li>
</ul>
</div>
</div>
