content/yocto.org
*** Recipe
:PROPERTIES:
:ID:       49922abe-989a-4049-a4e1-d9cd49db6f60
:CUSTOM_ID: 49922abe-989a-4049-a4e1-d9cd49db6f60
:END:
- script(s) containing a set of tasks for building one or more components
  (synonymous with what Buildroot calls packages)
- have the =.bb= suffix, named like =<package-name>_<version>.bb=
  - recipes that are build tools often have a =-native= suffix, indicating that
    they're to be run during the build process
- these are fed into [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]]
- recipes have to describe their [[#ff999862-e2a2-482c-93a4-55151cb59154][dependencies]]
- a recipe may produce [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]]
  - more sophisticated recipes may split to-be-installed contents into several
    sub-packages; these sub-packages might be optional features, modules, or
    any other set of files that is optional to install
- recipes follow a standard set of steps for each [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]] they build:
  - fetch source from somewhere
  - extract source
  - patch the source if necessary
  - configure
  - compile
  - copy (or "install") the generated files to a directory tree
  - package it up
  - run QA checks, tests
- each of these steps have task names like =do_fetch=, =do_unpack=, =do_patch=,
  =do_configure=, =do_compile=, =do_install=, and =do_package=; the full list of tasks
  is given [[https://docs.yoctoproject.org/ref-manual/tasks.html][here]]
  - =do_build= is a default meta-task, which depends on (triggers) all of them
- recipes can pull in [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] files and [[#97e812dc-9fef-4f72-a931-4ae140862170][include]] files
  - some tasks are predefined and available in some of the [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][classes]] that [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]]
    comes with, e.g. the =autotools= class provides implementations of the
    =do_configure=, =do_compile=, and =do_install= tasks; a recipe author ought to
    use these where possible
- and they can be overridden or extended with [[#d2fee7d5-7007-4e33-85cb-6c9a370990fd][append]] files
- =PN= is a [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] that gives the recipe name (or alternatively, the name of
  the resulting [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]])
- recipes have recipe /versions/
  - the newest version is always the one built, except where the older
    version's [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] has a higher priority (recipe version numbers only matter
    when the layer priorities are the same), or if we give explicit preference
    for a particular version
  - the complete version string looks like =${PE}:${PV}-${PR}=, where the three
    [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]] refer to the recipe's epoch, version, and revision numbers
    - =PE=
      - has the most priority, but is rarely changed from the default =0=
      - we would only change it if we were changing our versioning schema in a
        way that would otherwise break the usual ordering
    - =PV=
      - this is normally extracted from the recipe filename
      - however, the recipe might modify it if it's being built from a
        development/unstable branch, say
    - =PR=
      - this defaults to =r0=, and usually incremented to =r1=, =r2=, etc.
      - when =PV= increases, =PR= is conventionally reset back to =r0=
      - different packages can have the same =PV=; this might indicate that
        there were fixes applied on top of the upstream version of the package
      - a [[#cd11671a-4982-43d0-92eb-f510bf1b5d22][=PR= service]] can be used to automate the management of =PR=, which can
        be cumbersome to increment manually
*** SBOM
:PROPERTIES:
:ID:       ee4d8327-cb6b-4b13-8ca2-3d77cce33a81
:CUSTOM_ID: ee4d8327-cb6b-4b13-8ca2-3d77cce33a81
:END:
- software bill of materials
- we might provide one when we distribute our software, offering a description
  of all the components we used, their corresponding licenses, their
  dependencies, the changes that were applied and the known vulnerabilities
  that were fixed
- this can be used by the recipients of the software to assess their exposure
  to license compliance and security vulnerability issues
- the [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][build system]] can generate such documentation for us, in SPDX format,
  based on all the [[#b1a75489-4822-43b0-8fd4-639d535cad33][metadata]] it used to build the software [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]]
  - more on this [[https://docs.yoctoproject.org/dev-manual/sbom.html][here]]
*** sstate-cache
:PROPERTIES:
:ID:       8254517c-069f-4c02-bcc0-989e195a3cdc
:CUSTOM_ID: 8254517c-069f-4c02-bcc0-989e195a3cdc
:END:
- the shared state cache
- contains snapshots of build artefacts, used to speed up builds
- the =SSTATE_DIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points to the local cache directory for [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build]]
  - we can change this to some other, shared directory if we like
  - we can also point this to URL that uses a different [[#e2c85bd3-accf-49ea-97ad-fa47a1bb272b][fetcher]], like =https=
- and we can add mirrors to =SSTATE_MIRRORS= (which is consulted first)
- cached build artifacts are each assigned a checksum
  - this checksum indicates the state of play when they were built, so as to
    determine whether it can be used or must be rebuilt
  - the information used in the checksum depends on the task and what it does
    - [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] can automatically detect much of this, including what variables
      the task depends on (more on this [[https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-execution.html#checksums-signatures][here]])
    - to find out what variables a task depends on, see [[https://docs.yoctoproject.org/dev-manual/debugging.html#viewing-task-variable-dependencies][here]]
*** Source Directory
:PROPERTIES:
:ID:       f9b4ec65-a1e4-457a-a977-a5fb8c519c59
:CUSTOM_ID: f9b4ec65-a1e4-457a-a977-a5fb8c519c59
:END:
- AKA the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] directory; refers to the top level of the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] git repo we
  cloned locally; more generally, the top-level directory of /any/ [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]]
- this term helps distinguish it from the [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build directory]] (which may or may
  not lie within it)
- the source directory structure is described [[https://docs.yoctoproject.org/ref-manual/structure.html][here]]
