yocto.html
<div id="outline-container-49922abe-989a-4049-a4e1-d9cd49db6f60" class="outline-3">
<h3 id="49922abe-989a-4049-a4e1-d9cd49db6f60">Recipe</h3>
<div class="outline-text-3" id="text-49922abe-989a-4049-a4e1-d9cd49db6f60">
<ul class="org-ul">
<li>script(s) containing a set of tasks for building one or more components
(synonymous with what Buildroot calls packages)</li>
<li>have the <code>.bb</code> suffix, named like <code>&lt;package-name&gt;_&lt;version&gt;.bb</code>
<ul class="org-ul">
<li>recipes that are build tools often have a <code>-native</code> suffix, indicating that
they&rsquo;re to be run during the build process</li>
</ul></li>
<li>these are fed into <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a></li>
<li>recipes have to describe their <a href="#ff999862-e2a2-482c-93a4-55151cb59154">dependencies</a></li>
<li>a recipe may produce <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a>
<ul class="org-ul">
<li>more sophisticated recipes may split to-be-installed contents into several
sub-packages; these sub-packages might be optional features, modules, or
any other set of files that is optional to install</li>
</ul></li>
<li>recipes follow a standard set of steps for each <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a> they build:
<ul class="org-ul">
<li>fetch source from somewhere</li>
<li>extract source</li>
<li>patch the source if necessary</li>
<li>configure</li>
<li>compile</li>
<li>copy (or &ldquo;install&rdquo;) the generated files to a directory tree</li>
<li>package it up</li>
<li>run QA checks, tests</li>
</ul></li>
<li>each of these steps have task names like <code>do_fetch</code>, <code>do_unpack</code>, <code>do_patch</code>,
<code>do_configure</code>, <code>do_compile</code>, <code>do_install</code>, and <code>do_package</code>; the full list of tasks
is given <a href="https://docs.yoctoproject.org/ref-manual/tasks.html">here</a>
<ul class="org-ul">
<li><code>do_build</code> is a default meta-task, which depends on (triggers) all of them</li>
</ul></li>
<li>recipes can pull in <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> files and <a href="#97e812dc-9fef-4f72-a931-4ae140862170">include</a> files
<ul class="org-ul">
<li>some tasks are predefined and available in some of the <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">classes</a> that <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a>
comes with, e.g. the <code>autotools</code> class provides implementations of the
<code>do_configure</code>, <code>do_compile</code>, and <code>do_install</code> tasks; a recipe author ought to
use these where possible</li>
</ul></li>
<li>and they can be overridden or extended with <a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">append</a> files</li>
<li><code>PN</code> is a <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> that gives the recipe name (or alternatively, the name of
the resulting <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a>)</li>
<li>recipes have recipe <i>versions</i>
<ul class="org-ul">
<li>the newest version is always the one built, except where the older
version&rsquo;s <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> has a higher priority (recipe version numbers only matter
when the layer priorities are the same), or if we give explicit preference
for a particular version</li>
<li>the complete version string looks like <code>${PE}:${PV}-${PR}</code>, where the three
<a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a> refer to the recipe&rsquo;s epoch, version, and revision numbers
<ul class="org-ul">
<li><code>PE</code>
<ul class="org-ul">
<li>has the most priority, but is rarely changed from the default <code>0</code></li>
<li>we would only change it if we were changing our versioning schema in a
way that would otherwise break the usual ordering</li>
</ul></li>
<li><code>PV</code>
<ul class="org-ul">
<li>this is normally extracted from the recipe filename</li>
<li>however, the recipe might modify it if it&rsquo;s being built from a
development/unstable branch, say</li>
</ul></li>
<li><code>PR</code>
<ul class="org-ul">
<li>this defaults to <code>r0</code>, and usually incremented to <code>r1</code>, <code>r2</code>, etc.</li>
<li>when <code>PV</code> increases, <code>PR</code> is conventionally reset back to <code>r0</code></li>
<li>different packages can have the same <code>PV</code>; this might indicate that
there were fixes applied on top of the upstream version of the package</li>
<li>a <a href="#cd11671a-4982-43d0-92eb-f510bf1b5d22"><code>PR</code> service</a> can be used to automate the management of <code>PR</code>, which can
be cumbersome to increment manually</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-ee4d8327-cb6b-4b13-8ca2-3d77cce33a81" class="outline-3">
<h3 id="ee4d8327-cb6b-4b13-8ca2-3d77cce33a81">SBOM</h3>
<div class="outline-text-3" id="text-ee4d8327-cb6b-4b13-8ca2-3d77cce33a81">
<ul class="org-ul">
<li>software bill of materials</li>
<li>we might provide one when we distribute our software, offering a description
of all the components we used, their corresponding licenses, their
dependencies, the changes that were applied and the known vulnerabilities
that were fixed</li>
<li>this can be used by the recipients of the software to assess their exposure
to license compliance and security vulnerability issues</li>
<li>the <a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">build system</a> can generate such documentation for us, in SPDX format,
based on all the <a href="#b1a75489-4822-43b0-8fd4-639d535cad33">metadata</a> it used to build the software <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a>
<ul class="org-ul">
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/sbom.html">here</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-8254517c-069f-4c02-bcc0-989e195a3cdc" class="outline-3">
<h3 id="8254517c-069f-4c02-bcc0-989e195a3cdc">sstate-cache</h3>
<div class="outline-text-3" id="text-8254517c-069f-4c02-bcc0-989e195a3cdc">
<ul class="org-ul">
<li>the shared state cache</li>
<li>contains snapshots of build artefacts, used to speed up builds</li>
<li>the <code>SSTATE_DIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points to the local cache directory for <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build</a>
<ul class="org-ul">
<li>we can change this to some other, shared directory if we like</li>
<li>we can also point this to URL that uses a different <a href="#e2c85bd3-accf-49ea-97ad-fa47a1bb272b">fetcher</a>, like <code>https</code></li>
</ul></li>
<li>and we can add mirrors to <code>SSTATE_MIRRORS</code> (which is consulted first)</li>
<li>cached build artifacts are each assigned a checksum
<ul class="org-ul">
<li>this checksum indicates the state of play when they were built, so as to
determine whether it can be used or must be rebuilt</li>
<li>the information used in the checksum depends on the task and what it does
<ul class="org-ul">
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> can automatically detect much of this, including what variables
the task depends on (more on this <a href="https://docs.yoctoproject.org/bitbake/2.6/bitbake-user-manual/bitbake-user-manual-execution.html#checksums-signatures">here</a>)</li>
<li>to find out what variables a task depends on, see <a href="https://docs.yoctoproject.org/dev-manual/debugging.html#viewing-task-variable-dependencies">here</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-f9b4ec65-a1e4-457a-a977-a5fb8c519c59" class="outline-3">
<h3 id="f9b4ec65-a1e4-457a-a977-a5fb8c519c59">Source Directory</h3>
<div class="outline-text-3" id="text-f9b4ec65-a1e4-457a-a977-a5fb8c519c59">
<ul class="org-ul">
<li>AKA the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> directory; refers to the top level of the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> git repo we
cloned locally; more generally, the top-level directory of <i>any</i> <a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a></li>
<li>this term helps distinguish it from the <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build directory</a> (which may or may
not lie within it)</li>
<li>the source directory structure is described <a href="https://docs.yoctoproject.org/ref-manual/structure.html">here</a></li>
</ul>
</div>
</div>
