content/yocto.org
*** Sysroot
:PROPERTIES:
:ID:       d955a4e4-3e7c-478b-8e57-286a7c194852
:CUSTOM_ID: d955a4e4-3e7c-478b-8e57-286a7c194852
:END:
- the location of a staged version of a root filesystem
- in the context of the [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][OpenEmbedded build system]], and of the Yocto Project,
  each [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] can have two sysroots:
  - a /target/ sysroot contains all the /target libraries and headers/ needed for
    building/running the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]; typically this might include libc, kernel
    headers, other shared libs or binaries compiled against libc, etc.
  - a /native/ sysroot contains all the /host files and executables/ needed for
    building the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
- a multilib toolchain can contain multiple variants of libc binaries, each
  compiled for a target instruction set, and possibly optimised for a specific
  CPU core
- the =SYSROOT_*= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]] control how sysroots are created and stored
*** =wic=
:PROPERTIES:
:ID:       b64a1dac-73c7-403b-9f43-2530b4fd9669
:CUSTOM_ID: b64a1dac-73c7-403b-9f43-2530b4fd9669
:END:
- wic is a utility for generating partitioned [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] out of a set of existing
  build artifacts
  - the name "wic" is derived from OpenEmbedded Image Creator (oeic); the "oe"
    diphthong was promoted to the letter "w" because that's how you say it
- the scheme for partitioning can be specified in a separate "kickstart" file
  (=.wks=)
  - the language definition for kickstart files can be seen [[https://docs.yoctoproject.org/dev/ref-manual/kickstart.html][here]]
  - a [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]] might include multiple such files (in the =wic/= directory) to
    specify different image layouts
- configuration also includes specifying the type of compression used
- to use it, "wic" must be included in the =IMAGE_FSTYPES= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] with the
  name of the kickstart file (or alternatively, we can set the =WKS_FILE=
  variable)
  - this might be part of a [[#73837aae-7e38-4040-99e9-e5b43fd673ca][machine config]], for example; layouts are often
    tied to the specifics of the machine and how it boots
- a =.wic= file is a partitioned image that can be written straight to the
  target's disk or sd card (e.g. with =dd=)
- read more about this tool [[https://docs.yoctoproject.org/dev/dev-manual/wic.html][here]]
* Build directory contents
:PROPERTIES:
:ID:       77644b46-c404-4635-8cd4-f6d741c9f579
:CUSTOM_ID: 77644b46-c404-4635-8cd4-f6d741c9f579
:END:
*** =conf/=
:PROPERTIES:
:ID:       436f2635-0396-4400-a62f-30ca113b090c
:CUSTOM_ID: 436f2635-0396-4400-a62f-30ca113b090c
:END:
- this directory is all we need for a build; deleting all but this one
  will recreate the build from scratch
  - you may want to just delete =tmp/= though (leaving =downloads/= and
    =sstate-cache/= as is), just so we're not starting from absolutely nothing
- =local.conf=
  - config for this particular build
  - usually we wouldn't share this file per se---it's not under source control
    management, and may differ between developers---but rather a [[#dfb22ff0-7a48-4df5-b479-d591750e0354][custom distro
    layer]] or some such
- =bblayers.conf=
  - tells [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] what [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]] (collections of metadata) to pull in to the
    build environment, and their locations as absolute paths; we can
    optionally use the =bitbake-layers= tool to include them here;
    e.g. =bitbake-layers add-layer ./meta-blahblah/=
  - initially this will include the =meta=, =meta-poky=, and =meta-yocto-bsp= layers
  - the order in which the layers are listed will determine the order that
    BitBake will parse them
- =templateconf.cfg=
  - this will point to the directory from which =oe-init-build-env= obtained
    the default configuration to populate this directory with initially
  - this will be whatever the =TEMPLATECONF= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] is set to, a variable
    which is set in the =.templateconf= file, and which [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] sets to
    =meta-poky/conf/templates/default/=
*** =downloads/=
:PROPERTIES:
:ID:       8924a89f-2052-4370-a549-a61d2475454b
:CUSTOM_ID: 8924a89f-2052-4370-a549-a61d2475454b
:END:
- a download cache, stores downloaded source and other artifacts
  (unpacking and patching happens in =work/=, not here)
- the =DL_DIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points here
- only appears once we run a build the first time
*** =sstate-cache/=
:PROPERTIES:
:ID:       3a21f6aa-2b60-4879-bf5b-9b19213bd3a8
:CUSTOM_ID: 3a21f6aa-2b60-4879-bf5b-9b19213bd3a8
:END:
- contains the [[#8254517c-069f-4c02-bcc0-989e195a3cdc][shared state cache]]
- the =SSTATE_DIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points here
- this directory may need cleaning from time to time, since it keeps growing
  after every build
  - after multiple build iterations, the cache can contain multiple cache
    files for a given package, consuming a substantial amount of disk space;
    however, only the most recent ones are likely to be reused
  - do something like =find build/sstate-cache -type f -mtime +$DAYS -delete= to
    delete stuff at least =$DAYS= days old
    - this relies on the fact that [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] touches the sstate cache files as
      it accesses them, when it has write access to the cache
  - or, if available from [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OpenEmbedded-Core]], do =sstate-cache-management.sh
    --remove-duplicated --cache-dir=build/sstate-cache= to remove duplicates
    - this one is more cautious and selective
*** =tmp/=
:PROPERTIES:
:ID:       12ea9557-5155-49bc-830c-ce2cd727489d
:CUSTOM_ID: 12ea9557-5155-49bc-830c-ce2cd727489d
:END:
- contains the build artifacts ([[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]], [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]], [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK installers]])
- the =TMPDIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points here
- only appears once we run a build the first time
- looking in here can sometimes help diagnose failed builds
