yocto.html
<div id="outline-container-d955a4e4-3e7c-478b-8e57-286a7c194852" class="outline-3">
<h3 id="d955a4e4-3e7c-478b-8e57-286a7c194852">Sysroot</h3>
<div class="outline-text-3" id="text-d955a4e4-3e7c-478b-8e57-286a7c194852">
<ul class="org-ul">
<li>the location of a staged version of a root filesystem</li>
<li>in the context of the <a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">OpenEmbedded build system</a>, and of the Yocto Project,
each <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> can have two sysroots:
<ul class="org-ul">
<li>a <i>target</i> sysroot contains all the <i>target libraries and headers</i> needed for
building/running the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>; typically this might include libc, kernel
headers, other shared libs or binaries compiled against libc, etc.</li>
<li>a <i>native</i> sysroot contains all the <i>host files and executables</i> needed for
building the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
</ul></li>
<li>a multilib toolchain can contain multiple variants of libc binaries, each
compiled for a target instruction set, and possibly optimised for a specific
CPU core</li>
<li>the <code>SYSROOT_*</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a> control how sysroots are created and stored</li>
</ul>
</div>
</div>
<div id="outline-container-b64a1dac-73c7-403b-9f43-2530b4fd9669" class="outline-3">
<h3 id="b64a1dac-73c7-403b-9f43-2530b4fd9669"><code>wic</code></h3>
<div class="outline-text-3" id="text-b64a1dac-73c7-403b-9f43-2530b4fd9669">
<ul class="org-ul">
<li>wic is a utility for generating partitioned <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> out of a set of existing
build artifacts
<ul class="org-ul">
<li>the name &ldquo;wic&rdquo; is derived from OpenEmbedded Image Creator (oeic); the &ldquo;oe&rdquo;
diphthong was promoted to the letter &ldquo;w&rdquo; because that&rsquo;s how you say it</li>
</ul></li>
<li>the scheme for partitioning can be specified in a separate &ldquo;kickstart&rdquo; file
(<code>.wks</code>)
<ul class="org-ul">
<li>the language definition for kickstart files can be seen <a href="https://docs.yoctoproject.org/dev/ref-manual/kickstart.html">here</a></li>
<li>a <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a> might include multiple such files (in the <code>wic/</code> directory) to
specify different image layouts</li>
</ul></li>
<li>configuration also includes specifying the type of compression used</li>
<li>to use it, &ldquo;wic&rdquo; must be included in the <code>IMAGE_FSTYPES</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> with the
name of the kickstart file (or alternatively, we can set the <code>WKS_FILE</code>
variable)
<ul class="org-ul">
<li>this might be part of a <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">machine config</a>, for example; layouts are often
tied to the specifics of the machine and how it boots</li>
</ul></li>
<li>a <code>.wic</code> file is a partitioned image that can be written straight to the
target&rsquo;s disk or sd card (e.g. with <code>dd</code>)</li>
<li>read more about this tool <a href="https://docs.yoctoproject.org/dev/dev-manual/wic.html">here</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-77644b46-c404-4635-8cd4-f6d741c9f579" class="outline-2">
<h2 id="77644b46-c404-4635-8cd4-f6d741c9f579">Build directory contents</h2>
<div class="outline-text-2" id="text-77644b46-c404-4635-8cd4-f6d741c9f579">
</div>
<div id="outline-container-436f2635-0396-4400-a62f-30ca113b090c" class="outline-3">
<h3 id="436f2635-0396-4400-a62f-30ca113b090c"><code>conf/</code></h3>
<div class="outline-text-3" id="text-436f2635-0396-4400-a62f-30ca113b090c">
<ul class="org-ul">
<li>this directory is all we need for a build; deleting all but this one
will recreate the build from scratch
<ul class="org-ul">
<li>you may want to just delete <code>tmp/</code> though (leaving <code>downloads/</code> and
<code>sstate-cache/</code> as is), just so we&rsquo;re not starting from absolutely nothing</li>
</ul></li>
<li><code>local.conf</code>
<ul class="org-ul">
<li>config for this particular build</li>
<li>usually we wouldn&rsquo;t share this file per se&#x2014;it&rsquo;s not under source control
management, and may differ between developers&#x2014;but rather a <a href="#dfb22ff0-7a48-4df5-b479-d591750e0354">custom distro
layer</a> or some such</li>
</ul></li>
<li><code>bblayers.conf</code>
<ul class="org-ul">
<li>tells <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> what <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a> (collections of metadata) to pull in to the
build environment, and their locations as absolute paths; we can
optionally use the <code>bitbake-layers</code> tool to include them here;
e.g. <code>bitbake-layers add-layer ./meta-blahblah/</code></li>
<li>initially this will include the <code>meta</code>, <code>meta-poky</code>, and <code>meta-yocto-bsp</code> layers</li>
<li>the order in which the layers are listed will determine the order that
BitBake will parse them</li>
</ul></li>
<li><code>templateconf.cfg</code>
<ul class="org-ul">
<li>this will point to the directory from which <code>oe-init-build-env</code> obtained
the default configuration to populate this directory with initially</li>
<li>this will be whatever the <code>TEMPLATECONF</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> is set to, a variable
which is set in the <code>.templateconf</code> file, and which <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> sets to
<code>meta-poky/conf/templates/default/</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-8924a89f-2052-4370-a549-a61d2475454b" class="outline-3">
<h3 id="8924a89f-2052-4370-a549-a61d2475454b"><code>downloads/</code></h3>
<div class="outline-text-3" id="text-8924a89f-2052-4370-a549-a61d2475454b">
<ul class="org-ul">
<li>a download cache, stores downloaded source and other artifacts
(unpacking and patching happens in <code>work/</code>, not here)</li>
<li>the <code>DL_DIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points here</li>
<li>only appears once we run a build the first time</li>
</ul>
</div>
</div>
<div id="outline-container-3a21f6aa-2b60-4879-bf5b-9b19213bd3a8" class="outline-3">
<h3 id="3a21f6aa-2b60-4879-bf5b-9b19213bd3a8"><code>sstate-cache/</code></h3>
<div class="outline-text-3" id="text-3a21f6aa-2b60-4879-bf5b-9b19213bd3a8">
<ul class="org-ul">
<li>contains the <a href="#8254517c-069f-4c02-bcc0-989e195a3cdc">shared state cache</a></li>
<li>the <code>SSTATE_DIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points here</li>
<li>this directory may need cleaning from time to time, since it keeps growing
after every build
<ul class="org-ul">
<li>after multiple build iterations, the cache can contain multiple cache
files for a given package, consuming a substantial amount of disk space;
however, only the most recent ones are likely to be reused</li>
<li>do something like <code>find build/sstate-cache -type f -mtime +$DAYS -delete</code> to
delete stuff at least <code>$DAYS</code> days old
<ul class="org-ul">
<li>this relies on the fact that <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> touches the sstate cache files as
it accesses them, when it has write access to the cache</li>
</ul></li>
<li>or, if available from <a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</a>, do <code>sstate-cache-management.sh
    --remove-duplicated --cache-dir=build/sstate-cache</code> to remove duplicates
<ul class="org-ul">
<li>this one is more cautious and selective</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-12ea9557-5155-49bc-830c-ce2cd727489d" class="outline-3">
<h3 id="12ea9557-5155-49bc-830c-ce2cd727489d"><code>tmp/</code></h3>
<div class="outline-text-3" id="text-12ea9557-5155-49bc-830c-ce2cd727489d">
<ul class="org-ul">
<li>contains the build artifacts (<a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a>, <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a>, <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK installers</a>)</li>
<li>the <code>TMPDIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points here</li>
<li>only appears once we run a build the first time</li>
<li>looking in here can sometimes help diagnose failed builds</li>
</ul>
</div>
