content/yocto.org
***** =tmp/work/=
:PROPERTIES:
:ID:       6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f
:CUSTOM_ID: 6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f
:END:
- the main build directory
- this includes the staging areas for the root filesystem and other
  [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]-specific [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroots]], execution logs, et al.
- the trees within this directory are sorted by
  =<arch>/<recipe_name>/<recipe_version>/=
  - the need for multiple architectures arises from the fact that some
    packages may be for the host and some for the target, and even for
    those with the same target, source artifacts may be
    architecture-general or architecture-specific
  - the =WORKDIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] will point to a recipe subdirectory in here
- an example of what the top-level might look like:
  - =all-poky-linux/=
    - for arch-agnostic packages; mostly scripts and stuff
  - =core2-64-poky-linux/=
    - for packages common to x86-64-based targets using the optimisation
      tuned for =core2-64=
  - =qemux86_64-poky-linux/=
    - for packages specific to the =qemux86-64= machine
  - =x86_64-linux/=
    - for packages that are targeted to run on the build host machine
- within each [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] subdirectory will be found something like the
  following:
  - =sources/=
    - extracted source code of the software to be built
  - =image/=
    - the files that will be installed by the recipe
  - =package/=
    - contains the output of the =do_package= task /before/ the output is
      (optionally) split into sub-packages
  - =packages-split/=
    - contains the output of the =do_package= task /after/ the output is been
      (optionally) split into sub-packages
    - contains subdirectories for each individual package created by the
      recipe
  - =temp/=
    - stores [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]]'s task code and execution logs
  - =pseudo/=
    - contains the [[#a4dfc074-83f5-47c6-a5c4-c1b6153b906a][Pseudo]] database and log for any tasks executed under
      pseudo for the recipe
  - =recipe-sysroot/=
    - a directory populated with the target dependencies of the recipe
    - looks like the target filesystem and contains libraries that the
      recipe might need to link against (e.g. libc/busybox)
  - =recipe-sysroot-native/=
    - a directory populated with the native dependencies of the recipe
    - usually means tools needed to build the recipe (e.g. compiler,
      autoconf, libtool)
  - =build/=
    - this subdirectory applies only to recipes that support builds
      where the source is separate from the build artifacts
***** =tmp/work-shared/=
:PROPERTIES:
:ID:       42ecbafa-3bd4-4d87-b351-017b5f0edb00
:CUSTOM_ID: 42ecbafa-3bd4-4d87-b351-017b5f0edb00
:END:
- a work directory used for sharing the source code with multiple
  recipes
- this is only used by a subset of recipes, such as =linux-yocto= and =gcc=
***** =tmp/deploy/=
:PROPERTIES:
:ID:       a2382d7c-15f0-4838-83d5-3c982eaedc05
:CUSTOM_ID: a2382d7c-15f0-4838-83d5-3c982eaedc05
:END:
- the final binaries to be deployed on the target
- the =DEPLOY_DIR= [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] points here
******* =tmp/deploy/images/=
:PROPERTIES:
:ID:       96cb9dc9-6536-41bf-aa3f-d1d5dd58b173
:CUSTOM_ID: 96cb9dc9-6536-41bf-aa3f-d1d5dd58b173
:END:
- the bootloader, kernel, and rootfs [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] destined for the target
******* =tmp/deploy/<package_type>/=
:PROPERTIES:
:ID:       f163942c-16fc-48bb-98d8-a083d6f78260
:CUSTOM_ID: f163942c-16fc-48bb-98d8-a083d6f78260
:END:
- [[#729ed304-8a4e-40f7-a72e-eec793809f77][package feeds]] for the different kinds of [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] (deb, rpm, etc.) that were
  built (and perhaps put into one of the [[#96cb9dc9-6536-41bf-aa3f-d1d5dd58b173][images just mentioned]])
******* =tmp/deploy/licenses/=
:PROPERTIES:
:ID:       175e15db-e46d-4bee-92ec-a624b83c74d9
:CUSTOM_ID: 175e15db-e46d-4bee-92ec-a624b83c74d9
:END:
- contains the license files extracted from each [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]]
- =package.manifest= lists all packages in the image
- =image_license.manifest= lists the recipe names, versions, licenses, and the
  packages files available in the image, but not installed inside the rootfs
  (most notably, those of the bootloader, the kernel, and DTB files)
- =license.manifest= lists what is not included above, i.e. for the /installed/
  packages (we would typically use this manifest for copyleft compliance
  auditing)
******* =tmp/deploy/sdk/=
:PROPERTIES:
:ID:       8740c2c8-f495-4768-90df-e6b5a8db0022
:CUSTOM_ID: 8740c2c8-f495-4768-90df-e6b5a8db0022
:END:
- contains generated installer scripts for setting up the [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK]] environment
***** =tmp/sysroots-components/=
:PROPERTIES:
:ID:       dbeacf3e-590d-40b2-ae9b-b783984f2959
:CUSTOM_ID: dbeacf3e-590d-40b2-ae9b-b783984f2959
:END:
- contains components that are shared among [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]-specific [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroots]];
  =recipe-sysroot= and =recipe-sysroot-native=
***** =tmp/log/=
:PROPERTIES:
:ID:       d199bf7e-3375-4127-9c14-0bd47e3b9f1c
:CUSTOM_ID: d199bf7e-3375-4127-9c14-0bd47e3b9f1c
:END:
- contains general [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] logs that are non-specific to a particular [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]
- examples include logs output from the =do_check_pkg=, =do_distro_check=
  tasks
- running a build does not necessarily mean this directory will show up
* Setting up a build
:PROPERTIES:
:ID:       afbb604b-6575-481f-8619-e8e36f81855c
:CUSTOM_ID: afbb604b-6575-481f-8619-e8e36f81855c
:END:
- install [[https://docs.yoctoproject.org/4.0.4/ref-manual/system-requirements.html#required-packages-for-the-build-host][required packages]]
- download [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] and check out one of the release versions
  #+begin_src bash
    git clone git://git.yoctoproject.org/poky.git -b kirkstone # latest LTS release as of 01/2024
  #+end_src
- source the setup script to create/enter the [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build]] environment
  #+begin_src bash
    source oe-init-build-env # an optional arg names the new directory; defaults to 'build'
  #+end_src
