yocto.html
<div id="outline-container-6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f" class="outline-4">
<h4 id="6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f"><code>tmp/work/</code></h4>
<div class="outline-text-4" id="text-6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f">
<ul class="org-ul">
<li>the main build directory</li>
<li>this includes the staging areas for the root filesystem and other
<a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>-specific <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroots</a>, execution logs, et al.</li>
<li>the trees within this directory are sorted by
<code>&lt;arch&gt;/&lt;recipe_name&gt;/&lt;recipe_version&gt;/</code>
<ul class="org-ul">
<li>the need for multiple architectures arises from the fact that some
packages may be for the host and some for the target, and even for
those with the same target, source artifacts may be
architecture-general or architecture-specific</li>
<li>the <code>WORKDIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> will point to a recipe subdirectory in here</li>
</ul></li>
<li>an example of what the top-level might look like:
<ul class="org-ul">
<li><code>all-poky-linux/</code>
<ul class="org-ul">
<li>for arch-agnostic packages; mostly scripts and stuff</li>
</ul></li>
<li><code>core2-64-poky-linux/</code>
<ul class="org-ul">
<li>for packages common to x86-64-based targets using the optimisation
tuned for <code>core2-64</code></li>
</ul></li>
<li><code>qemux86_64-poky-linux/</code>
<ul class="org-ul">
<li>for packages specific to the <code>qemux86-64</code> machine</li>
</ul></li>
<li><code>x86_64-linux/</code>
<ul class="org-ul">
<li>for packages that are targeted to run on the build host machine</li>
</ul></li>
</ul></li>
<li>within each <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> subdirectory will be found something like the
following:
<ul class="org-ul">
<li><code>sources/</code>
<ul class="org-ul">
<li>extracted source code of the software to be built</li>
</ul></li>
<li><code>image/</code>
<ul class="org-ul">
<li>the files that will be installed by the recipe</li>
</ul></li>
<li><code>package/</code>
<ul class="org-ul">
<li>contains the output of the <code>do_package</code> task <i>before</i> the output is
(optionally) split into sub-packages</li>
</ul></li>
<li><code>packages-split/</code>
<ul class="org-ul">
<li>contains the output of the <code>do_package</code> task <i>after</i> the output is been
(optionally) split into sub-packages</li>
<li>contains subdirectories for each individual package created by the
recipe</li>
</ul></li>
<li><code>temp/</code>
<ul class="org-ul">
<li>stores <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a>&rsquo;s task code and execution logs</li>
</ul></li>
<li><code>pseudo/</code>
<ul class="org-ul">
<li>contains the <a href="#a4dfc074-83f5-47c6-a5c4-c1b6153b906a">Pseudo</a> database and log for any tasks executed under
pseudo for the recipe</li>
</ul></li>
<li><code>recipe-sysroot/</code>
<ul class="org-ul">
<li>a directory populated with the target dependencies of the recipe</li>
<li>looks like the target filesystem and contains libraries that the
recipe might need to link against (e.g. libc/busybox)</li>
</ul></li>
<li><code>recipe-sysroot-native/</code>
<ul class="org-ul">
<li>a directory populated with the native dependencies of the recipe</li>
<li>usually means tools needed to build the recipe (e.g. compiler,
autoconf, libtool)</li>
</ul></li>
<li><code>build/</code>
<ul class="org-ul">
<li>this subdirectory applies only to recipes that support builds
where the source is separate from the build artifacts</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-42ecbafa-3bd4-4d87-b351-017b5f0edb00" class="outline-4">
<h4 id="42ecbafa-3bd4-4d87-b351-017b5f0edb00"><code>tmp/work-shared/</code></h4>
<div class="outline-text-4" id="text-42ecbafa-3bd4-4d87-b351-017b5f0edb00">
<ul class="org-ul">
<li>a work directory used for sharing the source code with multiple
recipes</li>
<li>this is only used by a subset of recipes, such as <code>linux-yocto</code> and <code>gcc</code></li>
</ul>
</div>
</div>
<div id="outline-container-a2382d7c-15f0-4838-83d5-3c982eaedc05" class="outline-4">
<h4 id="a2382d7c-15f0-4838-83d5-3c982eaedc05"><code>tmp/deploy/</code></h4>
<div class="outline-text-4" id="text-a2382d7c-15f0-4838-83d5-3c982eaedc05">
<ul class="org-ul">
<li>the final binaries to be deployed on the target</li>
<li>the <code>DEPLOY_DIR</code> <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> points here</li>
</ul>
</div>
<div id="outline-container-96cb9dc9-6536-41bf-aa3f-d1d5dd58b173" class="outline-5">
<h5 id="96cb9dc9-6536-41bf-aa3f-d1d5dd58b173"><code>tmp/deploy/images/</code></h5>
<div class="outline-text-5" id="text-96cb9dc9-6536-41bf-aa3f-d1d5dd58b173">
<ul class="org-ul">
<li>the bootloader, kernel, and rootfs <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> destined for the target</li>
</ul>
</div>
</div>
<div id="outline-container-f163942c-16fc-48bb-98d8-a083d6f78260" class="outline-5">
<h5 id="f163942c-16fc-48bb-98d8-a083d6f78260"><code>tmp/deploy/&lt;package_type&gt;/</code></h5>
<div class="outline-text-5" id="text-f163942c-16fc-48bb-98d8-a083d6f78260">
<ul class="org-ul">
<li><a href="#729ed304-8a4e-40f7-a72e-eec793809f77">package feeds</a> for the different kinds of <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> (deb, rpm, etc.) that were
built (and perhaps put into one of the <a href="#96cb9dc9-6536-41bf-aa3f-d1d5dd58b173">images just mentioned</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-175e15db-e46d-4bee-92ec-a624b83c74d9" class="outline-5">
<h5 id="175e15db-e46d-4bee-92ec-a624b83c74d9"><code>tmp/deploy/licenses/</code></h5>
<div class="outline-text-5" id="text-175e15db-e46d-4bee-92ec-a624b83c74d9">
<ul class="org-ul">
<li>contains the license files extracted from each <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a></li>
<li><code>package.manifest</code> lists all packages in the image</li>
<li><code>image_license.manifest</code> lists the recipe names, versions, licenses, and the
packages files available in the image, but not installed inside the rootfs
(most notably, those of the bootloader, the kernel, and DTB files)</li>
<li><code>license.manifest</code> lists what is not included above, i.e. for the <i>installed</i>
packages (we would typically use this manifest for copyleft compliance
auditing)</li>
</ul>
</div>
</div>
<div id="outline-container-8740c2c8-f495-4768-90df-e6b5a8db0022" class="outline-5">
<h5 id="8740c2c8-f495-4768-90df-e6b5a8db0022"><code>tmp/deploy/sdk/</code></h5>
<div class="outline-text-5" id="text-8740c2c8-f495-4768-90df-e6b5a8db0022">
<ul class="org-ul">
<li>contains generated installer scripts for setting up the <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK</a> environment</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-dbeacf3e-590d-40b2-ae9b-b783984f2959" class="outline-4">
<h4 id="dbeacf3e-590d-40b2-ae9b-b783984f2959"><code>tmp/sysroots-components/</code></h4>
<div class="outline-text-4" id="text-dbeacf3e-590d-40b2-ae9b-b783984f2959">
<ul class="org-ul">
<li>contains components that are shared among <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>-specific <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroots</a>;
<code>recipe-sysroot</code> and <code>recipe-sysroot-native</code></li>
</ul>
</div>
</div>
<div id="outline-container-d199bf7e-3375-4127-9c14-0bd47e3b9f1c" class="outline-4">
<h4 id="d199bf7e-3375-4127-9c14-0bd47e3b9f1c"><code>tmp/log/</code></h4>
<div class="outline-text-4" id="text-d199bf7e-3375-4127-9c14-0bd47e3b9f1c">
<ul class="org-ul">
<li>contains general <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> logs that are non-specific to a particular <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a></li>
<li>examples include logs output from the <code>do_check_pkg</code>, <code>do_distro_check</code>
tasks</li>
<li>running a build does not necessarily mean this directory will show up</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-afbb604b-6575-481f-8619-e8e36f81855c" class="outline-2">
<h2 id="afbb604b-6575-481f-8619-e8e36f81855c">Setting up a build</h2>
<div class="outline-text-2" id="text-afbb604b-6575-481f-8619-e8e36f81855c">
<ul class="org-ul">
<li>install <a href="https://docs.yoctoproject.org/4.0.4/ref-manual/system-requirements.html#required-packages-for-the-build-host">required packages</a></li>
<li><p>
download <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> and check out one of the release versions
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone git://git.yoctoproject.org/poky.git -b kirkstone <span class="org-comment-delimiter"># </span><span class="org-comment">latest LTS release as of 01/2024</span>
</pre>
</div></li>
<li><p>
source the setup script to create/enter the <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build</a> environment
</p>
<div class="org-src-container">
<pre class="src src-bash">source oe-init-build-env <span class="org-comment-delimiter"># </span><span class="org-comment">an optional arg names the new directory; defaults to 'build'</span>
</pre>
</div></li>
</ul>
</div>
</div>
