content/yocto.org
* Useful commands
:PROPERTIES:
:ID:       6118f330-5f11-4f7e-8073-017544523f59
:CUSTOM_ID: 6118f330-5f11-4f7e-8073-017544523f59
:END:
- run a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] (usually one for an [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]]):
  #+begin_src bash
    bitbake $recipe_name
  #+end_src
- run a particular task of a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]:
  #+begin_src bash
    bitbake -c $task_name $recipe_name
  #+end_src
- list all tasks involved in a particular [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]:
  #+begin_src bash
    bitbake -c listtasks $recipe_name
  #+end_src
- show [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variable]] values currently configured:
  #+begin_src bash
    bitbake-env
  #+end_src
- list [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][variables]] in a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]:
  #+begin_src bash
    bitbake -e $recipe_name # the 'e' stands for 'environment'
  #+end_src
- list all currently configured [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]]:
  #+begin_src bash
    bitbake-layers show-layers
  #+end_src
- list all [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] available:
  #+begin_src bash
    bitbake-layers show-recipes
    # or
    bitbake -s
  #+end_src
- configure the kernel via menuconfig:
  #+begin_src bash
    bitbake $kernel -c menuconfig # e.g. linux-yocto
  #+end_src
- shows all changes made since the last generation of [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]:
  #+begin_src bash
    bitbake-whatchanged $recipe_name
  #+end_src
-  list available overrides for a specific machine:
  #+begin_src bash
    bitbake-getvar OVERRIDES
  #+end_src
- optional frontends:
  #+begin_src bash
    bitbake -u ncurses # TUI
    bitbake -u hob # GUI
    bitbake -u goggle # simpler GUI
  #+end_src
- generate a dependency graph for a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] in graphviz format (=.dot= file):
  #+begin_src bash
    bitbake $recipe_name -g
    # then, to convert them to images
    dot -v -Tpng -o package-depends.png package-depends.dot
    dot -v -Tpng -o pn-depends.png pn-depends.dot
    dot -v -Tsvg -o task-depends.svg task-depends.dot
  #+end_src
- show said dependency graph in a GUI:
  #+begin_src bash
    bitbake $recipe_name -g -u depexp
    bitbake $recipe_name -g -u taskexp
  #+end_src
- generate an SDK/eSDK for a particular [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]:
  #+begin_src bash
    bitbake $image_recipe -c populate_sdk
    # or
    bitbake $image_recipe -c populate_sdk_ext
  #+end_src
- generate a new [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] in the [[#28a59763-8b1e-4c36-8c07-aafde51a8081][workspace]] based on an existing project:
  #+begin_src sh
    devtool add https://github.com/OSSystems/bbexample # or some other project repo
  #+end_src
- to copy/deploy the finished [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] in the [[#28a59763-8b1e-4c36-8c07-aafde51a8081][workspace]] to a [[#d4009f0f-f371-454b-b30f-7fda430c0028][layer]]:
  #+begin_src sh
    devtool finish bbexample ../meta-newlayer/
    # copied to ../meta-newlayer/recipes-bbexample/bbexample/
  #+end_src
* Building a target image
:PROPERTIES:
:ID:       cae0bb7a-04bf-459c-a100-934338ec5ded
:CUSTOM_ID: cae0bb7a-04bf-459c-a100-934338ec5ded
:END:
- [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] provides several [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] to build off of
- see =meta*/recipes*/*images/*.bb= for the full list; the most commonly used
  ones are listed [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][above]]
- once we've entered into the [[#afbb604b-6575-481f-8619-e8e36f81855c][build environment]], and have our [[#3b6f0f7c-d816-4b65-8096-dc2e720a8f68][=local.conf=]] all
  set up, we then just run the desired image recipe with [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]]:
  #+begin_src bash
    bitbake core-image-full-cmdline
  #+end_src
- the resulting =.wic= file (which in some cases may need to be unzipped) can
  then be copied to the target's sd card:
  #+begin_src bash
    sudo dd if=core-image-full-cmdline-${MACHINE}.wic of=/dev/${DEVICE_FILE}
  #+end_src
* Creating a custom image recipe
:PROPERTIES:
:ID:       01866026-d3a7-47e1-8148-12966cdc99df
:CUSTOM_ID: 01866026-d3a7-47e1-8148-12966cdc99df
:END:
- typically, instead of creating an [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]] [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] from scratch, we would pull
  in an existing one (like =core-image-full-cmdline=), and override parts of it
  where necessary
  - this makes code maintenance more manageable, and highlights the functional
    differences
- for example, to use =core-image-full-cmdline= as a base, but include an extra
  app and remove an image feature, we would add a new file,
  =my-image-full-cmdline.bb= (usually in an =images/= subdirectory dedicated to
  image recipes), with something like the following:
  #+begin_src conf
    require recipes-extended/images/core-image-full-cmdline.bb

    IMAGE_FEATURES:remove = "splash"
    CORE_IMAGE_EXTRA_INSTALL += "myapp"
  #+end_src
- if building from scratch, the =core-image= [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] provides image features that
  offer helpful building blocks of commonly used functionality, e.g.:
  #+begin_src conf
    inherit core-image

    IMAGE_FEATURES += "ssh-server-openssh splash"  # we would instead use EXTRA_IMAGE_FEATURES if this were our conf/local.conf
    CORE_IMAGE_EXTRA_INSTALL += "strace"
  #+end_src
