yocto.html
<div id="outline-container-6118f330-5f11-4f7e-8073-017544523f59" class="outline-2">
<h2 id="6118f330-5f11-4f7e-8073-017544523f59">Useful commands</h2>
<div class="outline-text-2" id="text-6118f330-5f11-4f7e-8073-017544523f59">
<ul class="org-ul">
<li><p>
run a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> (usually one for an <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>):
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake $<span class="org-variable-name">recipe_name</span>
</pre>
</div></li>
<li><p>
run a particular task of a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake -c $<span class="org-variable-name">task_name</span> $<span class="org-variable-name">recipe_name</span>
</pre>
</div></li>
<li><p>
list all tasks involved in a particular <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake -c listtasks $<span class="org-variable-name">recipe_name</span>
</pre>
</div></li>
<li><p>
show <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variable</a> values currently configured:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake-env
</pre>
</div></li>
<li><p>
list <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">variables</a> in a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake -e $<span class="org-variable-name">recipe_name</span> <span class="org-comment-delimiter"># </span><span class="org-comment">the 'e' stands for 'environment'</span>
</pre>
</div></li>
<li><p>
list all currently configured <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake-layers show-layers
</pre>
</div></li>
<li><p>
list all <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> available:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake-layers show-recipes
<span class="org-comment-delimiter"># </span><span class="org-comment">or</span>
bitbake -s
</pre>
</div></li>
<li><p>
configure the kernel via menuconfig:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake $<span class="org-variable-name">kernel</span> -c menuconfig <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. linux-yocto</span>
</pre>
</div></li>
<li><p>
shows all changes made since the last generation of <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake-whatchanged $<span class="org-variable-name">recipe_name</span>
</pre>
</div></li>
<li><p>
list available overrides for a specific machine:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake-getvar OVERRIDES
</pre>
</div></li>
<li><p>
optional frontends:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake -u ncurses <span class="org-comment-delimiter"># </span><span class="org-comment">TUI</span>
bitbake -u hob <span class="org-comment-delimiter"># </span><span class="org-comment">GUI</span>
bitbake -u goggle <span class="org-comment-delimiter"># </span><span class="org-comment">simpler GUI</span>
</pre>
</div></li>
<li><p>
generate a dependency graph for a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> in graphviz format (<code>.dot</code> file):
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake $<span class="org-variable-name">recipe_name</span> -g
<span class="org-comment-delimiter"># </span><span class="org-comment">then, to convert them to images</span>
dot -v -Tpng -o package-depends.png package-depends.dot
dot -v -Tpng -o pn-depends.png pn-depends.dot
dot -v -Tsvg -o task-depends.svg task-depends.dot
</pre>
</div></li>
<li><p>
show said dependency graph in a GUI:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake $<span class="org-variable-name">recipe_name</span> -g -u depexp
bitbake $<span class="org-variable-name">recipe_name</span> -g -u taskexp
</pre>
</div></li>
<li><p>
generate an SDK/eSDK for a particular <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake $<span class="org-variable-name">image_recipe</span> -c populate_sdk
<span class="org-comment-delimiter"># </span><span class="org-comment">or</span>
bitbake $<span class="org-variable-name">image_recipe</span> -c populate_sdk_ext
</pre>
</div></li>
<li><p>
generate a new <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> in the <a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">workspace</a> based on an existing project:
</p>
<div class="org-src-container">
<pre class="src src-sh">devtool add https://github.com/OSSystems/bbexample <span class="org-comment-delimiter"># </span><span class="org-comment">or some other project repo</span>
</pre>
</div></li>
<li><p>
to copy/deploy the finished <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> in the <a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">workspace</a> to a <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layer</a>:
</p>
<div class="org-src-container">
<pre class="src src-sh">devtool finish bbexample ../meta-newlayer/
<span class="org-comment-delimiter"># </span><span class="org-comment">copied to ../meta-newlayer/recipes-bbexample/bbexample/</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-cae0bb7a-04bf-459c-a100-934338ec5ded" class="outline-2">
<h2 id="cae0bb7a-04bf-459c-a100-934338ec5ded">Building a target image</h2>
<div class="outline-text-2" id="text-cae0bb7a-04bf-459c-a100-934338ec5ded">
<ul class="org-ul">
<li><a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> provides several <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> to build off of</li>
<li>see <code>meta*/recipes*/*images/*.bb</code> for the full list; the most commonly used
ones are listed <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">above</a></li>
<li><p>
once we&rsquo;ve entered into the <a href="#afbb604b-6575-481f-8619-e8e36f81855c">build environment</a>, and have our <a href="#3b6f0f7c-d816-4b65-8096-dc2e720a8f68"><code>local.conf</code></a> all
set up, we then just run the desired image recipe with <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake core-image-full-cmdline
</pre>
</div></li>
<li><p>
the resulting <code>.wic</code> file (which in some cases may need to be unzipped) can
then be copied to the target&rsquo;s sd card:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo dd <span class="org-variable-name">if</span>=core-image-full-cmdline-${<span class="org-variable-name">MACHINE</span>}.wic <span class="org-variable-name">of</span>=/dev/${<span class="org-variable-name">DEVICE_FILE</span>}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-01866026-d3a7-47e1-8148-12966cdc99df" class="outline-2">
<h2 id="01866026-d3a7-47e1-8148-12966cdc99df">Creating a custom image recipe</h2>
<div class="outline-text-2" id="text-01866026-d3a7-47e1-8148-12966cdc99df">
<ul class="org-ul">
<li>typically, instead of creating an <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a> <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> from scratch, we would pull
in an existing one (like <code>core-image-full-cmdline</code>), and override parts of it
where necessary
<ul class="org-ul">
<li>this makes code maintenance more manageable, and highlights the functional
differences</li>
</ul></li>
<li><p>
for example, to use <code>core-image-full-cmdline</code> as a base, but include an extra
app and remove an image feature, we would add a new file,
<code>my-image-full-cmdline.bb</code> (usually in an <code>images/</code> subdirectory dedicated to
image recipes), with something like the following:
</p>
<div class="org-src-container">
<pre class="src src-conf">require recipes-extended/images/core-image-full-cmdline.bb

<span class="org-variable-name">IMAGE_FEATURES:remove</span> = <span class="org-string">"splash"</span>
<span class="org-variable-name">CORE_IMAGE_EXTRA_INSTALL +</span>= <span class="org-string">"myapp"</span>
</pre>
</div></li>
<li><p>
if building from scratch, the <code>core-image</code> <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> provides image features that
offer helpful building blocks of commonly used functionality, e.g.:
</p>
<div class="org-src-container">
<pre class="src src-conf">inherit core-image

<span class="org-variable-name">IMAGE_FEATURES +</span>= <span class="org-string">"ssh-server-openssh splash"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">we would instead use EXTRA_IMAGE_FEATURES if this were our conf/local.conf</span>
<span class="org-variable-name">CORE_IMAGE_EXTRA_INSTALL +</span>= <span class="org-string">"strace"</span>
</pre>
</div></li>
</ul>
</div>
</div>
