content/yocto.org
* Creating a custom distro configuration
:PROPERTIES:
:ID:       dfb22ff0-7a48-4df5-b479-d591750e0354
:CUSTOM_ID: dfb22ff0-7a48-4df5-b479-d591750e0354
:END:
- the easy option is to pull in the [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] [[#73837aae-7e38-4040-99e9-e5b43fd673ca][config]], and override a few things
  with our changes
- a sample distro file (at say =<layer>/conf/distro/my-distro.conf=) which
  removes X11 support to use the raw framebuffer instead would look something
  like this:
  #+begin_src conf
    require conf/distro/poky.conf

    DISTRO = "my-distro"
    DISTRO_NAME = "my-distro (My New Distro)"
    DISTRO_VERSION = "1.0"
    DISTRO_CODENAME = "codename"
    SDK_VENDOR = "-mydistrosdk"
    SDK_VERSION := "${@'${DISTRO_VERSION}'.replace('snapshot-${DATE}','snapshot')}"

    MAINTAINER = "my-distro <foo@bar.com>"

    DISTRO_FEATURES:remove = "wayland vulkan opengl"
  #+end_src
- to use this distro, we then need to add the following to our =local.conf=:
  #+begin_src conf
    DISTRO = "my-distro"
  #+end_src
* Customising an existing recipe
:PROPERTIES:
:ID:       ad945122-d7c0-44c4-8529-bc5ebd41039f
:CUSTOM_ID: ad945122-d7c0-44c4-8529-bc5ebd41039f
:END:
- to simply modify an existing [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], we just create an [[#d2fee7d5-7007-4e33-85cb-6c9a370990fd][append]] file named
  after it, and make our changes and additions to the configuration therein
*** Modifying build flags
:PROPERTIES:
:ID:       a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6
:CUSTOM_ID: a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6
:END:
- to modify build flags for recipes based on a known build system, the
  following variables are available:
  #+ATTR_HTML: :border 1 :rules all :frame border :width 50%
  | Autotools    | =EXTRA_OECONF=  |
  | Cargo        | =EXTRA_OECARGO= |
  | CMake        | =EXTRA_OECMAKE= |
  | Make         | =EXTRA_OEMAKE=  |
  | Meson        | =EXTRA_OEMESON= |
  | NPM          | =EXTRA_OENPM=   |
  | SCons        | =EXTRA_OESCONS= |
  | WAF          | =EXTRA_OEWAF=   |
- for example, to modify some autoconf flags for an autotools-based recipe,
  our [[#d2fee7d5-7007-4e33-85cb-6c9a370990fd][append]] file would contain something like this:
  #+begin_src conf
    EXTRA_OECONF += "--enable-foo-feature --disable-bar-feature"
    # or, for example, if our change is conditional on the hardware we're building for
    EXTRA_OECONF:append:arm = " --enable-arm-feature"
  #+end_src
*** Applying a patch
:PROPERTIES:
:ID:       454f3ba7-e149-40c3-acb6-d9e0aed33575
:CUSTOM_ID: 454f3ba7-e149-40c3-acb6-d9e0aed33575
:END:
- [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] assumes that every file with a =.patch= or =.diff= extension is a patch
  and applies them accordingly
- so to include a patch, we can simply use =FILESEXTRAPATHS=, which includes new
  directories in the searching algorithm, making the additional file visible
  to [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]], as shown here:
  #+begin_src conf
    FILESEXTRAPATHS:prepend := "${THISDIR}/${PN}-${PV}:" # this will be a subdirectory containing just our patch file
    SRC_URI += "file://mypatch.patch" # append the patch file to the list of source files in this recipe
  #+end_src
- =SRC_URI= lists the source files that are needed for the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] to build
- said files can be local or remote; remote files need to be fetched
- for remote files, each =SRC_URI= entry needs to specify a protocol to tell
  [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] how to pull said file
- for local files, we just need to append to the =FILESEXTRAPATHS= variable
  (not =FILESPATH=) to specify where it can be found
  - to that end, the default locations searched are:
    - =<recipe>-<version>/=
    - =<recipe>/=
    - =files/=
  - in addition, it also checks for =OVERRIDES= for a specific file to be
    overridden in each folder, e.g. for a recipe =foo_1.0.bb= that sets
    =OVERRIDES = "<board>:<arch>"=, the file will be searched in the following
    directories, respecting the exact order shown:
    - =foo-1.0/<board>/=
    - =foo-1.0/<arch>/=
    - =foo-1.0/=
    - =foo/<board>/=
    - =foo/<arch>/=
    - =foo/=
    - =files/<board>/=
    - =files/<arch>/=
    - =files/=
- the prepend operator used above (for =FILESEXTRAPATHS=) is crucial as it
  guarantees that the file is picked from the given directory even if a file
  with the same name is added in the lower priority layers sometime in the
  future
*** Adding extra files
:PROPERTIES:
:ID:       80f5fd18-70ac-4dee-a784-ab78c0a1069d
:CUSTOM_ID: 80f5fd18-70ac-4dee-a784-ab78c0a1069d
:END:
- here we do much the same as [[#454f3ba7-e149-40c3-acb6-d9e0aed33575][above]], however, unlike patches, these extra
  files may need to be installed to the package's filesystem along with the
  rest of the [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] files (see: [[#d3aa691d-a9df-4d7e-94cb-af28e2177486][Standard target filesystem paths]])
- here's an example that adds a new configuration file:
  #+begin_src conf
    FILESEXTRAPATHS:prepend := "${THISDIR}/${PN}-${PV}:" # a subdirectory containing our new file
    SRC_URI += "file://newconfig.conf" # append the file to the list of source files in this recipe

    do_install:append() {
        install -D -m 644 ${WORKDIR}/newconfig.conf \
                          ${D}${sysconfdir}/newconfig.conf
    }
  #+end_src
