yocto.html
<div id="outline-container-dfb22ff0-7a48-4df5-b479-d591750e0354" class="outline-2">
<h2 id="dfb22ff0-7a48-4df5-b479-d591750e0354">Creating a custom distro configuration</h2>
<div class="outline-text-2" id="text-dfb22ff0-7a48-4df5-b479-d591750e0354">
<ul class="org-ul">
<li>the easy option is to pull in the <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">config</a>, and override a few things
with our changes</li>
<li><p>
a sample distro file (at say <code>&lt;layer&gt;/conf/distro/my-distro.conf</code>) which
removes X11 support to use the raw framebuffer instead would look something
like this:
</p>
<div class="org-src-container">
<pre class="src src-conf">require conf/distro/poky.conf

<span class="org-variable-name">DISTRO</span> = <span class="org-string">"my-distro"</span>
<span class="org-variable-name">DISTRO_NAME</span> = <span class="org-string">"my-distro (My New Distro)"</span>
<span class="org-variable-name">DISTRO_VERSION</span> = <span class="org-string">"1.0"</span>
<span class="org-variable-name">DISTRO_CODENAME</span> = <span class="org-string">"codename"</span>
<span class="org-variable-name">SDK_VENDOR</span> = <span class="org-string">"-mydistrosdk"</span>
<span class="org-variable-name">SDK_VERSION :</span>= <span class="org-string">"${@'${DISTRO_VERSION}'.replace('snapshot-${DATE}','snapshot')}"</span>

<span class="org-variable-name">MAINTAINER</span> = <span class="org-string">"my-distro <a href="mailto:foo%40bar.com">&lt;foo@bar.com&gt;</a>"</span>

<span class="org-variable-name">DISTRO_FEATURES:remove</span> = <span class="org-string">"wayland vulkan opengl"</span>
</pre>
</div></li>
<li><p>
to use this distro, we then need to add the following to our <code>local.conf</code>:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">DISTRO</span> = <span class="org-string">"my-distro"</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-ad945122-d7c0-44c4-8529-bc5ebd41039f" class="outline-2">
<h2 id="ad945122-d7c0-44c4-8529-bc5ebd41039f">Customising an existing recipe</h2>
<div class="outline-text-2" id="text-ad945122-d7c0-44c4-8529-bc5ebd41039f">
<ul class="org-ul">
<li>to simply modify an existing <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, we just create an <a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">append</a> file named
after it, and make our changes and additions to the configuration therein</li>
</ul>
</div>
<div id="outline-container-a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6" class="outline-3">
<h3 id="a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6">Modifying build flags</h3>
<div class="outline-text-3" id="text-a1f0a9aa-39d4-4d31-a4d3-57aedcc4e2b6">
<ul class="org-ul">
<li><p>
to modify build flags for recipes based on a known build system, the
following variables are available:
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="border" width="50%">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Autotools</td>
<td class="org-left"><code>EXTRA_OECONF</code></td>
</tr>

<tr>
<td class="org-left">Cargo</td>
<td class="org-left"><code>EXTRA_OECARGO</code></td>
</tr>

<tr>
<td class="org-left">CMake</td>
<td class="org-left"><code>EXTRA_OECMAKE</code></td>
</tr>

<tr>
<td class="org-left">Make</td>
<td class="org-left"><code>EXTRA_OEMAKE</code></td>
</tr>

<tr>
<td class="org-left">Meson</td>
<td class="org-left"><code>EXTRA_OEMESON</code></td>
</tr>

<tr>
<td class="org-left">NPM</td>
<td class="org-left"><code>EXTRA_OENPM</code></td>
</tr>

<tr>
<td class="org-left">SCons</td>
<td class="org-left"><code>EXTRA_OESCONS</code></td>
</tr>

<tr>
<td class="org-left">WAF</td>
<td class="org-left"><code>EXTRA_OEWAF</code></td>
</tr>
</tbody>
</table></li>
<li><p>
for example, to modify some autoconf flags for an autotools-based recipe,
our <a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">append</a> file would contain something like this:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">EXTRA_OECONF +</span>= <span class="org-string">"--enable-foo-feature --disable-bar-feature"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">or, for example, if our change is conditional on the hardware we're building for</span>
<span class="org-variable-name">EXTRA_OECONF:append:arm</span> = <span class="org-string">" --enable-arm-feature"</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-454f3ba7-e149-40c3-acb6-d9e0aed33575" class="outline-3">
<h3 id="454f3ba7-e149-40c3-acb6-d9e0aed33575">Applying a patch</h3>
<div class="outline-text-3" id="text-454f3ba7-e149-40c3-acb6-d9e0aed33575">
<ul class="org-ul">
<li><a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> assumes that every file with a <code>.patch</code> or <code>.diff</code> extension is a patch
and applies them accordingly</li>
<li><p>
so to include a patch, we can simply use <code>FILESEXTRAPATHS</code>, which includes new
directories in the searching algorithm, making the additional file visible
to <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a>, as shown here:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">FILESEXTRAPATHS:prepend :</span>= <span class="org-string">"${THISDIR}/${PN}-${PV}:"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">this will be a subdirectory containing just our patch file</span>
<span class="org-variable-name">SRC_URI +</span>= <span class="org-string">"file://mypatch.patch"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">append the patch file to the list of source files in this recipe</span>
</pre>
</div></li>
<li><code>SRC_URI</code> lists the source files that are needed for the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> to build</li>
<li>said files can be local or remote; remote files need to be fetched</li>
<li>for remote files, each <code>SRC_URI</code> entry needs to specify a protocol to tell
<a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> how to pull said file</li>
<li>for local files, we just need to append to the <code>FILESEXTRAPATHS</code> variable
(not <code>FILESPATH</code>) to specify where it can be found
<ul class="org-ul">
<li>to that end, the default locations searched are:
<ul class="org-ul">
<li><code>&lt;recipe&gt;-&lt;version&gt;/</code></li>
<li><code>&lt;recipe&gt;/</code></li>
<li><code>files/</code></li>
</ul></li>
<li>in addition, it also checks for <code>OVERRIDES</code> for a specific file to be
overridden in each folder, e.g. for a recipe <code>foo_1.0.bb</code> that sets
<code>OVERRIDES = "&lt;board&gt;:&lt;arch&gt;"</code>, the file will be searched in the following
directories, respecting the exact order shown:
<ul class="org-ul">
<li><code>foo-1.0/&lt;board&gt;/</code></li>
<li><code>foo-1.0/&lt;arch&gt;/</code></li>
<li><code>foo-1.0/</code></li>
<li><code>foo/&lt;board&gt;/</code></li>
<li><code>foo/&lt;arch&gt;/</code></li>
<li><code>foo/</code></li>
<li><code>files/&lt;board&gt;/</code></li>
<li><code>files/&lt;arch&gt;/</code></li>
<li><code>files/</code></li>
</ul></li>
</ul></li>
<li>the prepend operator used above (for <code>FILESEXTRAPATHS</code>) is crucial as it
guarantees that the file is picked from the given directory even if a file
with the same name is added in the lower priority layers sometime in the
future</li>
</ul>
</div>
</div>
<div id="outline-container-80f5fd18-70ac-4dee-a784-ab78c0a1069d" class="outline-3">
<h3 id="80f5fd18-70ac-4dee-a784-ab78c0a1069d">Adding extra files</h3>
<div class="outline-text-3" id="text-80f5fd18-70ac-4dee-a784-ab78c0a1069d">
<ul class="org-ul">
<li>here we do much the same as <a href="#454f3ba7-e149-40c3-acb6-d9e0aed33575">above</a>, however, unlike patches, these extra
files may need to be installed to the package&rsquo;s filesystem along with the
rest of the <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> files (see: <a href="#d3aa691d-a9df-4d7e-94cb-af28e2177486">Standard target filesystem paths</a>)</li>
<li><p>
here&rsquo;s an example that adds a new configuration file:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">FILESEXTRAPATHS:prepend :</span>= <span class="org-string">"${THISDIR}/${PN}-${PV}:"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">a subdirectory containing our new file</span>
<span class="org-variable-name">SRC_URI +</span>= <span class="org-string">"file://newconfig.conf"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">append the file to the list of source files in this recipe</span>

do_install:append() {
    install -D -m 644 ${WORKDIR}/newconfig.conf \
                      ${D}${sysconfdir}/newconfig.conf
}
</pre>
</div></li>
</ul>
</div>
</div>
