content/yocto.org
*** Changing recipe feature configuration
:PROPERTIES:
:ID:       f5e94c00-76bb-468c-896a-be015f947270
:CUSTOM_ID: f5e94c00-76bb-468c-896a-be015f947270
:END:
- the [[https://docs.yoctoproject.org/ref-manual/variables.html#term-PACKAGECONFIG][=PACKAGECONFIG=]] variable provides a way for [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]] to define feature
  sets, allowing users to specify configurations more easily
- each "feature set" in a recipe specifies six things:
  - extra build flags needed if the user enables the feature
  - extra build flags needed if the user disables the feature
  - extra build dependencies (=DEPENDS=) if the user enables the feature
  - extra runtime dependencies (=RDEPENDS=) if the user enables the feature
  - extra runtime dependencies (=RRECOMMENDS=) if the user enables the feature
  - any =PACKAGECONFIG= settings that conflict with this feature
- so in our =.bbappend= file, we could just add something like this:
  #+begin_src conf
    PACKAGECONFIG += "feature2"
  #+end_src
- or, to enable the same feature in our [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build's]] =conf/local.conf=, we would
  instead add:
  #+begin_src conf
    PACKAGECONFIG:pn-<recipename>:append = ' feature2'
  #+end_src
- one must look inside a recipe file to see the list of available
  =PACKAGECONFIG= features for a [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]]; there is no tool to list them all
*** Changing recipe Kconfig configuration
:PROPERTIES:
:ID:       5a6c603b-af2d-45ae-81a6-7748692924f2
:CUSTOM_ID: 5a6c603b-af2d-45ae-81a6-7748692924f2
:END:
- if the project is Kconfig-based (the kernel, U-Boot, and BusyBox most
  notably), Yocto has a specialised [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] for modifying whatever default
  Kconfig is present in that project
- to apply our Kconfig, we create a /configuration fragment/ (a file that
  contains said variable settings we wish to apply), give it the suffix =.cfg=,
  and then include it as though it were a patch [[#454f3ba7-e149-40c3-acb6-d9e0aed33575][as demonstrated earlier]]; the
  class will apply it for us automatically
- to generate a configuration fragment that modifies the kernel's config, for
  example, we should do something like this:
  #+begin_src bash
    bitbake virtual/kernel -c menuconfig # make changes here
    bitbake virtual/kernel -c diffconfig # generates the configuration fragment file for us
  #+end_src
  - note that if we wanted to generate the /complete/ configuration file, not
    just the diff fragment, we would run =savedefconfig= instead of =diffconfig=
* Standard target filesystem paths
:PROPERTIES:
:ID:       d3aa691d-a9df-4d7e-94cb-af28e2177486
:CUSTOM_ID: d3aa691d-a9df-4d7e-94cb-af28e2177486
:END:
- variables exist to indicate various paths on the target filesystem; this is
  so that the installation paths of binaries and configuration files can be
  customised depending on the use case
  - e.g. the native SDK binaries require a specific installation path so that
    the binaries don't conflict with the target ones
- these variables are listed in =meta/conf/bitbake.conf=
- here are the most commonly used ones, and their default expanded values:
  #+ATTR_HTML: :border 1 :rules all :frame border :width 75%
  | =base_bindir=   | =/bin/=                    |
  | =base_sbindir=  | =/sbin/=                   |
  | =base_libdir=   | =/lib/= /or/ =/lib64/=         |
  | =sysconfdir=    | =/etc/=                    |
  | =localstatedir= | =/var/=                    |
  | =datadir=       | =/usr/share/=              |
  | =bindir=        | =/usr/bin/=                |
  | =sbindir=       | =/usr/sbin/=               |
  | =libdir=        | =/usr/lib/= /or/ =/usr/lib64/= |
  | =libexecdir=    | =/usr/libexec/=            |
  | =includedir=    | =/usr/include/=            |
- avoid hard-coding paths into [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]; use these
- as an example of where not doing this can go wrong:
  - when using the =usrmerge= [[#887aaab6-76ef-43b5-8592-127935253e7a][distro]] feature, then all recipes will have
    =base_bindir= set to =bindir= (rather than simply having =/bin/= symlink to
    =/usr/bin/=)
  - if a recipe used =/bin/= as a hard coded installation path, then the
    installation won't work as expected
* Running the image in QEMU
:PROPERTIES:
:ID:       8cf925bb-3283-47f5-8033-85151b2aa166
:CUSTOM_ID: 8cf925bb-3283-47f5-8033-85151b2aa166
:END:
- [[#76978d0b-92f6-40cf-b827-01bd45fd4391][OpenEmbedded-Core]] provides a =runqemu= wrapper script:
  #+begin_src bash
    runqemu $arch $kernel_image $filesystem_image
  #+end_src
- the params are somewhat optional though, running =runqemu= by itself will
  usually work; QEMU will infer from the [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build environment]] what to do
  (e.g. it'll run the most recently built image according to timestamp)
- more options are described [[https://docs.yoctoproject.org/dev-manual/qemu.html][here]]; see also the output of =runqemu --help=
*** Automated testing with QEMU
:PROPERTIES:
:ID:       2345edb0-38da-465f-94ca-366b3578a234
:CUSTOM_ID: 2345edb0-38da-465f-94ca-366b3578a234
:END:
- Yocto provides a framework for automated testing in QEMU
- one can execute tests on the images inside the target with the =do_testimage=
  task
- first, we must add the =testimage= [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] to our =IMAGE_CLASSES= list in our
  =local.conf=
- then:
  #+begin_src bash
    bitbake -c testimage $filesystem_image
  #+end_src
- more on this [[https://docs.yoctoproject.org/dev-manual/runtime-testing.html][here]]
* Debugging
:PROPERTIES:
:ID:       89dd2d47-b589-4fcb-92f2-c13c3aa91480
:CUSTOM_ID: 89dd2d47-b589-4fcb-92f2-c13c3aa91480
:END:
