yocto.html
<div id="outline-container-f5e94c00-76bb-468c-896a-be015f947270" class="outline-3">
<h3 id="f5e94c00-76bb-468c-896a-be015f947270">Changing recipe feature configuration</h3>
<div class="outline-text-3" id="text-f5e94c00-76bb-468c-896a-be015f947270">
<ul class="org-ul">
<li>the <a href="https://docs.yoctoproject.org/ref-manual/variables.html#term-PACKAGECONFIG"><code>PACKAGECONFIG</code></a> variable provides a way for <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a> to define feature
sets, allowing users to specify configurations more easily</li>
<li>each &ldquo;feature set&rdquo; in a recipe specifies six things:
<ul class="org-ul">
<li>extra build flags needed if the user enables the feature</li>
<li>extra build flags needed if the user disables the feature</li>
<li>extra build dependencies (<code>DEPENDS</code>) if the user enables the feature</li>
<li>extra runtime dependencies (<code>RDEPENDS</code>) if the user enables the feature</li>
<li>extra runtime dependencies (<code>RRECOMMENDS</code>) if the user enables the feature</li>
<li>any <code>PACKAGECONFIG</code> settings that conflict with this feature</li>
</ul></li>
<li><p>
so in our <code>.bbappend</code> file, we could just add something like this:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">PACKAGECONFIG +</span>= <span class="org-string">"feature2"</span>
</pre>
</div></li>
<li><p>
or, to enable the same feature in our <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build&rsquo;s</a> <code>conf/local.conf</code>, we would
instead add:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">PACKAGECONFIG:pn-&lt;recipename&gt;:append</span> = <span class="org-string">' feature2'</span>
</pre>
</div></li>
<li>one must look inside a recipe file to see the list of available
<code>PACKAGECONFIG</code> features for a <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a>; there is no tool to list them all</li>
</ul>
</div>
</div>
<div id="outline-container-5a6c603b-af2d-45ae-81a6-7748692924f2" class="outline-3">
<h3 id="5a6c603b-af2d-45ae-81a6-7748692924f2">Changing recipe Kconfig configuration</h3>
<div class="outline-text-3" id="text-5a6c603b-af2d-45ae-81a6-7748692924f2">
<ul class="org-ul">
<li>if the project is Kconfig-based (the kernel, U-Boot, and BusyBox most
notably), Yocto has a specialised <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> for modifying whatever default
Kconfig is present in that project</li>
<li>to apply our Kconfig, we create a <i>configuration fragment</i> (a file that
contains said variable settings we wish to apply), give it the suffix <code>.cfg</code>,
and then include it as though it were a patch <a href="#454f3ba7-e149-40c3-acb6-d9e0aed33575">as demonstrated earlier</a>; the
class will apply it for us automatically</li>
<li><p>
to generate a configuration fragment that modifies the kernel&rsquo;s config, for
example, we should do something like this:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake virtual/kernel -c menuconfig <span class="org-comment-delimiter"># </span><span class="org-comment">make changes here</span>
bitbake virtual/kernel -c diffconfig <span class="org-comment-delimiter"># </span><span class="org-comment">generates the configuration fragment file for us</span>
</pre>
</div>
<ul class="org-ul">
<li>note that if we wanted to generate the <i>complete</i> configuration file, not
just the diff fragment, we would run <code>savedefconfig</code> instead of <code>diffconfig</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-d3aa691d-a9df-4d7e-94cb-af28e2177486" class="outline-2">
<h2 id="d3aa691d-a9df-4d7e-94cb-af28e2177486">Standard target filesystem paths</h2>
<div class="outline-text-2" id="text-d3aa691d-a9df-4d7e-94cb-af28e2177486">
<ul class="org-ul">
<li>variables exist to indicate various paths on the target filesystem; this is
so that the installation paths of binaries and configuration files can be
customised depending on the use case
<ul class="org-ul">
<li>e.g. the native SDK binaries require a specific installation path so that
the binaries don&rsquo;t conflict with the target ones</li>
</ul></li>
<li>these variables are listed in <code>meta/conf/bitbake.conf</code></li>
<li><p>
here are the most commonly used ones, and their default expanded values:
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="border" width="75%">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>base_bindir</code></td>
<td class="org-left"><code>/bin/</code></td>
</tr>

<tr>
<td class="org-left"><code>base_sbindir</code></td>
<td class="org-left"><code>/sbin/</code></td>
</tr>

<tr>
<td class="org-left"><code>base_libdir</code></td>
<td class="org-left"><code>/lib/</code> <i>or</i> <code>/lib64/</code></td>
</tr>

<tr>
<td class="org-left"><code>sysconfdir</code></td>
<td class="org-left"><code>/etc/</code></td>
</tr>

<tr>
<td class="org-left"><code>localstatedir</code></td>
<td class="org-left"><code>/var/</code></td>
</tr>

<tr>
<td class="org-left"><code>datadir</code></td>
<td class="org-left"><code>/usr/share/</code></td>
</tr>

<tr>
<td class="org-left"><code>bindir</code></td>
<td class="org-left"><code>/usr/bin/</code></td>
</tr>

<tr>
<td class="org-left"><code>sbindir</code></td>
<td class="org-left"><code>/usr/sbin/</code></td>
</tr>

<tr>
<td class="org-left"><code>libdir</code></td>
<td class="org-left"><code>/usr/lib/</code> <i>or</i> <code>/usr/lib64/</code></td>
</tr>

<tr>
<td class="org-left"><code>libexecdir</code></td>
<td class="org-left"><code>/usr/libexec/</code></td>
</tr>

<tr>
<td class="org-left"><code>includedir</code></td>
<td class="org-left"><code>/usr/include/</code></td>
</tr>
</tbody>
</table></li>
<li>avoid hard-coding paths into <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>; use these</li>
<li>as an example of where not doing this can go wrong:
<ul class="org-ul">
<li>when using the <code>usrmerge</code> <a href="#887aaab6-76ef-43b5-8592-127935253e7a">distro</a> feature, then all recipes will have
<code>base_bindir</code> set to <code>bindir</code> (rather than simply having <code>/bin/</code> symlink to
<code>/usr/bin/</code>)</li>
<li>if a recipe used <code>/bin/</code> as a hard coded installation path, then the
installation won&rsquo;t work as expected</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-8cf925bb-3283-47f5-8033-85151b2aa166" class="outline-2">
<h2 id="8cf925bb-3283-47f5-8033-85151b2aa166">Running the image in QEMU</h2>
<div class="outline-text-2" id="text-8cf925bb-3283-47f5-8033-85151b2aa166">
<ul class="org-ul">
<li><p>
<a href="#76978d0b-92f6-40cf-b827-01bd45fd4391">OpenEmbedded-Core</a> provides a <code>runqemu</code> wrapper script:
</p>
<div class="org-src-container">
<pre class="src src-bash">runqemu $<span class="org-variable-name">arch</span> $<span class="org-variable-name">kernel_image</span> $<span class="org-variable-name">filesystem_image</span>
</pre>
</div></li>
<li>the params are somewhat optional though, running <code>runqemu</code> by itself will
usually work; QEMU will infer from the <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build environment</a> what to do
(e.g. it&rsquo;ll run the most recently built image according to timestamp)</li>
<li>more options are described <a href="https://docs.yoctoproject.org/dev-manual/qemu.html">here</a>; see also the output of <code>runqemu --help</code></li>
</ul>
</div>
<div id="outline-container-2345edb0-38da-465f-94ca-366b3578a234" class="outline-3">
<h3 id="2345edb0-38da-465f-94ca-366b3578a234">Automated testing with QEMU</h3>
<div class="outline-text-3" id="text-2345edb0-38da-465f-94ca-366b3578a234">
<ul class="org-ul">
<li>Yocto provides a framework for automated testing in QEMU</li>
<li>one can execute tests on the images inside the target with the <code>do_testimage</code>
task</li>
<li>first, we must add the <code>testimage</code> <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> to our <code>IMAGE_CLASSES</code> list in our
<code>local.conf</code></li>
<li><p>
then:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake -c testimage $<span class="org-variable-name">filesystem_image</span>
</pre>
</div></li>
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/runtime-testing.html">here</a></li>
</ul>
</div>
</div>
</div>
