content/yocto.org
*** Metadata
:PROPERTIES:
:ID:       8628f96d-b068-4d4a-82b7-65e70f80af30
:CUSTOM_ID: 8628f96d-b068-4d4a-82b7-65e70f80af30
:END:
- to ensure our build has produced the right [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]], [[#729ed304-8a4e-40f7-a72e-eec793809f77][packages]], and [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK]], along
  with the expected contents, we can use =buildhistory=
  - when a recipe is updated for a new version or has its code changed, it may
    influence the contents of the generated packages (and consequently the
    image or SDK)
  - it can be difficult to track package contents; this is where =buildhistory=
    comes in; it keeps a history of the contents of artifacts
  - to enable it:
    #+begin_src conf
      INHERIT += "buildhistory"    # adds the necessary class hooks
      BUILDHISTORY_COMMIT = "1"    # auto-commit to the buildhistory repo on every build
    #+end_src
  - the data is stored under =build/buildhistory/= as text files
  - to compare two buildhistory states, use =buildhistory-diff=
  - for every [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]] build, =buildhistory= will create a list of generated
    sub-packages, installation scripts, a list of file ownership and sizes,
    the dependency relation, et al.
  - additionally, the dependency relationship between the [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]], filesystem
    files, and dependency graph is created for [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][images]] and [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDKs]]
  - more on buildhistory [[https://docs.yoctoproject.org/dev-manual/build-quality.html][here]]
- to inspect how a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe's]] content has been split, check its =packages-split/=
  sub-directory in its respective [[#6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f][=tmp/work/=]] sub-directory
  - this contains a sub-directory for every sub-package, and has its contents
    in the sub-tree
  - this can help diagnose
    - contents not being installed (e.g. error in install script)
    - an app or library config error (e.g. a disabled feature)
    - metadata errors (e.g. wrong package order)
- to inspect what the [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroot]] for the package looks like
  - see =sysroot-destdir/= in its respective [[#6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f][=tmp/work/=]] sub-directory
  - this is helpful for build failures where the package is lacking the
    required headers/dynamic libraries in sysroot
- to inspect already built [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][packages]] in the [[#729ed304-8a4e-40f7-a72e-eec793809f77][package feed]]
  - use the =oe-pkgdata-util= utility
  - with this, we can, for example
    - list all the packages present
    - list the current version of a package
    - list a package's contents
    - find the package associated with a particular file path in [[#d955a4e4-3e7c-478b-8e57-286a7c194852][sysroot]]
- to inspect log files generated by [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]], which trace the execution path of
  tasks
  - the log levels (available within bitbake scripts) are:
    - =bbfatal= (forces the build to stop)
    - =bberror=
    - =bbwarn=
    - =bbnote=
    - =bbplain=
    - =bbdebug=
  - the logging functions used in Python scripts are directly handled by
    BitBake, seen on the console, and stored in the execution log inside
    =tmp/log/cooker/<machine>/=
  - on the other hand, for logging functions used in shell scripts, the
    information is outputted to an individual task log file, which is
    available in =tmp/work/<arch>/<recipe name>/<version>/temp/=
    - inside this =temp= directory, we can inspect the scripts for every task
      with the =run.<task>.<pid>= pattern and use the =log.<task>.<pid>= pattern
      for its output
    - symbolic links point to the last log files using the =log.<task>=
      pattern
    - for example, we can check for =log.do_compile= to verify whether the
      right files were used during the build process
- to debug bitbake variables
  - we can use the =bitbake-getvar= script
  - this script uses the BitBake internal data to get the value of a specific
    variable value (with respect to a particular [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]]), as well as the
    history of modifications made to it that got it there
  - we can use this script to check whether a feature is enabled, or to be
    sure a variable has been expanded as we expect
- to open a development shell
  - use =devshell=
  - when we use this utility, the following takes place:
    - source files are extracted into the working directory
    - patches are applied
    - a new terminal is opened in the working directory
  - all the environment variables needed for the build are available in the
    new terminal, so we can use commands such as =configure= and =make=; the
    commands execute just as if the build system were running them
  - for example, the following the devshell command on the =linux-yocto= recipe
    which builds a kernel:
    #+begin_src bash
      bitbake linux-yocto -c devshell
    #+end_src
    - once inside, we can then, from within =$WORKDIR=, start modifying the
      Linux kernel source code, build it, generate patches, etc.
  - note that changes made inside devshell do not persist between builds;
    ensure you record any critical changes before leaving it (e.g. saving the
    patch to be later added to the recipe)
  - this tool is good for small tasks; for more involved changes, use [[#28a59763-8b1e-4c36-8c07-aafde51a8081][devtool]]
    or some other external toolchain
*** Run-time software
:PROPERTIES:
:ID:       f82572d9-a37f-423d-9c46-5de277952cd5
:CUSTOM_ID: f82572d9-a37f-423d-9c46-5de277952cd5
:END:
- the [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK]] comes with GDB by default
- to use it, we'll need to install =tools-debug=, and probably the debugging
  versions of all packages (they include their debug symbols):
  #+begin_src conf
    IMAGE_FEATURES += "dbg-pkgs tools-debug"
  #+end_src
- =tools-debug= also includes gdbserver, which allows us to debug remotely, and
  also means we won't need debug packages; we can load the debug symbols from
  the host where we run our gdb client, rather than from the debugged process
- note however that we'll still need to compile the target binaries without
  compiler optimisations
