yocto.html
<div id="outline-container-89dd2d47-b589-4fcb-92f2-c13c3aa91480" class="outline-2">
<h2 id="89dd2d47-b589-4fcb-92f2-c13c3aa91480">Debugging</h2>
<div class="outline-text-2" id="text-89dd2d47-b589-4fcb-92f2-c13c3aa91480">
</div>
<div id="outline-container-8628f96d-b068-4d4a-82b7-65e70f80af30" class="outline-3">
<h3 id="8628f96d-b068-4d4a-82b7-65e70f80af30">Metadata</h3>
<div class="outline-text-3" id="text-8628f96d-b068-4d4a-82b7-65e70f80af30">
<ul class="org-ul">
<li>to ensure our build has produced the right <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>, <a href="#729ed304-8a4e-40f7-a72e-eec793809f77">packages</a>, and <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK</a>, along
with the expected contents, we can use <code>buildhistory</code>
<ul class="org-ul">
<li>when a recipe is updated for a new version or has its code changed, it may
influence the contents of the generated packages (and consequently the
image or SDK)</li>
<li>it can be difficult to track package contents; this is where <code>buildhistory</code>
comes in; it keeps a history of the contents of artifacts</li>
<li><p>
to enable it:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">INHERIT +</span>= <span class="org-string">"buildhistory"</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">adds the necessary class hooks</span>
<span class="org-variable-name">BUILDHISTORY_COMMIT</span> = <span class="org-string">"1"</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">auto-commit to the buildhistory repo on every build</span>
</pre>
</div></li>
<li>the data is stored under <code>build/buildhistory/</code> as text files</li>
<li>to compare two buildhistory states, use <code>buildhistory-diff</code></li>
<li>for every <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a> build, <code>buildhistory</code> will create a list of generated
sub-packages, installation scripts, a list of file ownership and sizes,
the dependency relation, et al.</li>
<li>additionally, the dependency relationship between the <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a>, filesystem
files, and dependency graph is created for <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">images</a> and <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDKs</a></li>
<li>more on buildhistory <a href="https://docs.yoctoproject.org/dev-manual/build-quality.html">here</a></li>
</ul></li>
<li>to inspect how a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe&rsquo;s</a> content has been split, check its <code>packages-split/</code>
sub-directory in its respective <a href="#6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f"><code>tmp/work/</code></a> sub-directory
<ul class="org-ul">
<li>this contains a sub-directory for every sub-package, and has its contents
in the sub-tree</li>
<li>this can help diagnose
<ul class="org-ul">
<li>contents not being installed (e.g. error in install script)</li>
<li>an app or library config error (e.g. a disabled feature)</li>
<li>metadata errors (e.g. wrong package order)</li>
</ul></li>
</ul></li>
<li>to inspect what the <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroot</a> for the package looks like
<ul class="org-ul">
<li>see <code>sysroot-destdir/</code> in its respective <a href="#6fad8ef9-3379-4fb8-9bb6-a15c84e8ae4f"><code>tmp/work/</code></a> sub-directory</li>
<li>this is helpful for build failures where the package is lacking the
required headers/dynamic libraries in sysroot</li>
</ul></li>
<li>to inspect already built <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">packages</a> in the <a href="#729ed304-8a4e-40f7-a72e-eec793809f77">package feed</a>
<ul class="org-ul">
<li>use the <code>oe-pkgdata-util</code> utility</li>
<li>with this, we can, for example
<ul class="org-ul">
<li>list all the packages present</li>
<li>list the current version of a package</li>
<li>list a package&rsquo;s contents</li>
<li>find the package associated with a particular file path in <a href="#d955a4e4-3e7c-478b-8e57-286a7c194852">sysroot</a></li>
</ul></li>
</ul></li>
<li>to inspect log files generated by <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a>, which trace the execution path of
tasks
<ul class="org-ul">
<li>the log levels (available within bitbake scripts) are:
<ul class="org-ul">
<li><code>bbfatal</code> (forces the build to stop)</li>
<li><code>bberror</code></li>
<li><code>bbwarn</code></li>
<li><code>bbnote</code></li>
<li><code>bbplain</code></li>
<li><code>bbdebug</code></li>
</ul></li>
<li>the logging functions used in Python scripts are directly handled by
BitBake, seen on the console, and stored in the execution log inside
<code>tmp/log/cooker/&lt;machine&gt;/</code></li>
<li>on the other hand, for logging functions used in shell scripts, the
information is outputted to an individual task log file, which is
available in <code>tmp/work/&lt;arch&gt;/&lt;recipe name&gt;/&lt;version&gt;/temp/</code>
<ul class="org-ul">
<li>inside this <code>temp</code> directory, we can inspect the scripts for every task
with the <code>run.&lt;task&gt;.&lt;pid&gt;</code> pattern and use the <code>log.&lt;task&gt;.&lt;pid&gt;</code> pattern
for its output</li>
<li>symbolic links point to the last log files using the <code>log.&lt;task&gt;</code>
pattern</li>
<li>for example, we can check for <code>log.do_compile</code> to verify whether the
right files were used during the build process</li>
</ul></li>
</ul></li>
<li>to debug bitbake variables
<ul class="org-ul">
<li>we can use the <code>bitbake-getvar</code> script</li>
<li>this script uses the BitBake internal data to get the value of a specific
variable value (with respect to a particular <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>), as well as the
history of modifications made to it that got it there</li>
<li>we can use this script to check whether a feature is enabled, or to be
sure a variable has been expanded as we expect</li>
</ul></li>
<li>to open a development shell
<ul class="org-ul">
<li>use <code>devshell</code></li>
<li>when we use this utility, the following takes place:
<ul class="org-ul">
<li>source files are extracted into the working directory</li>
<li>patches are applied</li>
<li>a new terminal is opened in the working directory</li>
</ul></li>
<li>all the environment variables needed for the build are available in the
new terminal, so we can use commands such as <code>configure</code> and <code>make</code>; the
commands execute just as if the build system were running them</li>
<li><p>
for example, the following the devshell command on the <code>linux-yocto</code> recipe
which builds a kernel:
</p>
<div class="org-src-container">
<pre class="src src-bash">bitbake linux-yocto -c devshell
</pre>
</div>
<ul class="org-ul">
<li>once inside, we can then, from within <code>$WORKDIR</code>, start modifying the
Linux kernel source code, build it, generate patches, etc.</li>
</ul></li>
<li>note that changes made inside devshell do not persist between builds;
ensure you record any critical changes before leaving it (e.g. saving the
patch to be later added to the recipe)</li>
<li>this tool is good for small tasks; for more involved changes, use <a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">devtool</a>
or some other external toolchain</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-f82572d9-a37f-423d-9c46-5de277952cd5" class="outline-3">
<h3 id="f82572d9-a37f-423d-9c46-5de277952cd5">Run-time software</h3>
<div class="outline-text-3" id="text-f82572d9-a37f-423d-9c46-5de277952cd5">
<ul class="org-ul">
<li>the <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK</a> comes with GDB by default</li>
<li><p>
to use it, we&rsquo;ll need to install <code>tools-debug</code>, and probably the debugging
versions of all packages (they include their debug symbols):
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">IMAGE_FEATURES +</span>= <span class="org-string">"dbg-pkgs tools-debug"</span>
</pre>
</div></li>
<li><code>tools-debug</code> also includes gdbserver, which allows us to debug remotely, and
also means we won&rsquo;t need debug packages; we can load the debug symbols from
the host where we run our gdb client, rather than from the debugged process</li>
<li>note however that we&rsquo;ll still need to compile the target binaries without
compiler optimisations</li>
</ul>
</div>
</div>
</div>
