content/yocto.org
* Choosing a board
:PROPERTIES:
:ID:       50ecb4f8-0fef-4298-9f92-3d89b1c4a47d
:CUSTOM_ID: 50ecb4f8-0fef-4298-9f92-3d89b1c4a47d
:END:
- what we need to consider:
  - quality of software support (i.e. at the low level), namely:
    - bootloader (such as U-Boot, GRUB, systemd-boot)
    - linux kernel (for arch, and other required drivers like GPU, WiFi)
    - user-space packages required by hardware acceleration
  - integration inside the Yocto Project as a [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] layer, which would normally
    provide:
    - a reusable disk partition layout (e.g., a [[#b64a1dac-73c7-403b-9f43-2530b4fd9669][=WIC=]] =.wks= template)
    - ready-to-use machine definitions
    - user-space packages integrated for hardware acceleration (usable out of
      the box)
* Licenses
:PROPERTIES:
:ID:       9dd87647-f7dd-4435-b527-2a990d5239c3
:CUSTOM_ID: 9dd87647-f7dd-4435-b527-2a990d5239c3
:END:
- every [[#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e][package]] must include a license
- [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] keeps track of licenses in every [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], and any changes made to them
- NOTE: A [[#49922abe-989a-4049-a4e1-d9cd49db6f60][/recipe/]] itself may be released under a specific license that is
  distinct from the license of the project it represents.  If so, both
  licenses would be considered part of the product.
- once a [[#51cba0dc-6701-431d-9b93-9b2e39761fbc][build]] completes, the list of all licenses used during that build can
  be found in [[#175e15db-e46d-4bee-92ec-a624b83c74d9][=tmp/deploy/licenses/=]]
- projects have different ways of providing their license
  - some just include a =COPYING= or =LICENSE= file containing the license text
  - others use a header note in each file or the main file (e.g. SPDX)
- how does a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] specify the license of its project?
  - =LICENSE= gives the name of the license under which the package was
    released
  - =LIC_FILES_CHKSUM= gives the location of the license file in the source
    code, and a checksum of its text
    - the checksum means changes to the license can be tracked
    - when a different license checksum is detected, [[#623a901f-d7c6-44b6-97a0-e2bea2f861bc][BitBake]] launches a build
      error and points to the project that had its license changed
      - you must be careful when this happens, as the license change may
        impact the use of this software
      - to be able to build anything again, you must change the
        =LIC_FILE_CHKSUM= value accordingly and update the =LICENSE= field to
        match the license change
    - it's good practice to record the reason for the change in a commit
      message for future reference
  - =LICENSE_FLAGS= identifies which license restriction that recipe has
    - if this string is set to ="commercial"= for example, then our build must
      set =LICENSE_FLAGS_ACCEPTED= to include ="commercial"= for a build that
      includes this recipe to actually build
    - =LICENSE_FLAGS_ACCEPTED= can also be set to permit particular license
      terms for particular projects,
      e.g. ="commercial_gstreamer1.0-plugins-ugly"= would mean we're allowed to
      use the =gstreamer1.0-plugins-ugly= recipe in a commercial setting
    - but by default, [[#b00db72c-5c93-441d-887d-9878b84ec993][Poky]] doesn't use any projects that have commercial
      licenses
*** License compliance
:PROPERTIES:
:ID:       bcd83893-9335-4693-8f50-ac4b0a807761
:CUSTOM_ID: bcd83893-9335-4693-8f50-ac4b0a807761
:END:
- most copyleft projects have the following obligations:
  - source code
  - the license text
  - any modifications made to the project
  - any scripts that are required to configure and build it
- sharing source isn't simply a matter of copying =DL_DIR= (the [[#8924a89f-2052-4370-a549-a61d2475454b][=downloads/=]]
  directory) and so on, because that would be copying /all/ sources (including
  proprietary ones), and furthermore, we don't need to share /all/ the sources,
  but only the copyleft-licensed ones
- to achieve licensing compliance, we can generate an [[#ee4d8327-cb6b-4b13-8ca2-3d77cce33a81][SBOM]] in SPDX format
  using the appropriate [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]]:
  #+begin_src conf
    INHERIT += "create-spdx"
  #+end_src
  - more on this [[https://docs.yoctoproject.org/dev-manual/sbom.html][here]]
- an older, inferior method:
  #+begin_src conf
    INHERIT += "archiver"
  #+end_src
  - the default configuration has =COPYLEFT_LICENSE_INCLUDE= set to ="GPL* LGPL*
    AGPL*"=
  - the =COPYLEFT_LICENSE_EXCLUDE= variable can be used to exclude specific
    licenses; by default, this will be set to ="CLOSED Proprietary"=
  - included sources are deployed to the =build/tmp/deploy/sources/<arch>/=
    directories
  - more on this [[https://docs.yoctoproject.org/ref-manual/variables.html#term-ARCHIVER_MODE][here]]; see also the =meta/classes/archiver.bbclass= file
- when providing the source code, the license text is shared inside it
- if we also need to include the license text inside our final [[#d04f848b-f29b-4fc5-b2c6-1c2331456bf1][image]], we can
  add the following to our =build/conf/local.conf=:
  #+begin_src conf
    COPY_LIC_MANIFEST = "1"
    COPY_LIC_DIRS = "1"
    LICENSE_CREATE_PACKAGE = "1"
  #+end_src
  - more on this [[https://docs.yoctoproject.org/dev-manual/licenses.html#providing-license-text][here]]
* Toaster
:PROPERTIES:
:ID:       635714a5-4def-4468-88f3-a30e4128c720
:CUSTOM_ID: 635714a5-4def-4468-88f3-a30e4128c720
:END:
- this is a GUI frontend for [[#73837aae-7e38-4040-99e9-e5b43fd673ca][configuring]] and [[#6ba19863-6771-4f13-9d20-1d4dec02ae6c][building]]
- it runs as a server and accessed via localhost with the browser
- this requires the Python Django framework, and a few others; with =pip= we can
  install them easily:
  #+begin_src bash
    pip3 install --user -r bitbake/toaster-requirements.txt
  #+end_src
- to start the server (which must be done in our dev environment):
  #+begin_src bash
    source oe-init-build-env
    source toaster start
  #+end_src
- then we just open up =127.0.0.1:8000= in the browser
