yocto.html
<div id="outline-container-50ecb4f8-0fef-4298-9f92-3d89b1c4a47d" class="outline-2">
<h2 id="50ecb4f8-0fef-4298-9f92-3d89b1c4a47d">Choosing a board</h2>
<div class="outline-text-2" id="text-50ecb4f8-0fef-4298-9f92-3d89b1c4a47d">
<ul class="org-ul">
<li>what we need to consider:
<ul class="org-ul">
<li>quality of software support (i.e. at the low level), namely:
<ul class="org-ul">
<li>bootloader (such as U-Boot, GRUB, systemd-boot)</li>
<li>linux kernel (for arch, and other required drivers like GPU, WiFi)</li>
<li>user-space packages required by hardware acceleration</li>
</ul></li>
<li>integration inside the Yocto Project as a <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> layer, which would normally
provide:
<ul class="org-ul">
<li>a reusable disk partition layout (e.g., a <a href="#b64a1dac-73c7-403b-9f43-2530b4fd9669"><code>WIC</code></a> <code>.wks</code> template)</li>
<li>ready-to-use machine definitions</li>
<li>user-space packages integrated for hardware acceleration (usable out of
the box)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-9dd87647-f7dd-4435-b527-2a990d5239c3" class="outline-2">
<h2 id="9dd87647-f7dd-4435-b527-2a990d5239c3">Licenses</h2>
<div class="outline-text-2" id="text-9dd87647-f7dd-4435-b527-2a990d5239c3">
<ul class="org-ul">
<li>every <a href="#ac2e7f8f-88a5-4383-83b9-22ff1d5e2f6e">package</a> must include a license</li>
<li><a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> keeps track of licenses in every <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, and any changes made to them</li>
<li>NOTE: A <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60"><i>recipe</i></a> itself may be released under a specific license that is
distinct from the license of the project it represents.  If so, both
licenses would be considered part of the product.</li>
<li>once a <a href="#51cba0dc-6701-431d-9b93-9b2e39761fbc">build</a> completes, the list of all licenses used during that build can
be found in <a href="#175e15db-e46d-4bee-92ec-a624b83c74d9"><code>tmp/deploy/licenses/</code></a></li>
<li>projects have different ways of providing their license
<ul class="org-ul">
<li>some just include a <code>COPYING</code> or <code>LICENSE</code> file containing the license text</li>
<li>others use a header note in each file or the main file (e.g. SPDX)</li>
</ul></li>
<li>how does a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> specify the license of its project?
<ul class="org-ul">
<li><code>LICENSE</code> gives the name of the license under which the package was
released</li>
<li><code>LIC_FILES_CHKSUM</code> gives the location of the license file in the source
code, and a checksum of its text
<ul class="org-ul">
<li>the checksum means changes to the license can be tracked</li>
<li>when a different license checksum is detected, <a href="#623a901f-d7c6-44b6-97a0-e2bea2f861bc">BitBake</a> launches a build
error and points to the project that had its license changed
<ul class="org-ul">
<li>you must be careful when this happens, as the license change may
impact the use of this software</li>
<li>to be able to build anything again, you must change the
<code>LIC_FILE_CHKSUM</code> value accordingly and update the <code>LICENSE</code> field to
match the license change</li>
</ul></li>
<li>it&rsquo;s good practice to record the reason for the change in a commit
message for future reference</li>
</ul></li>
<li><code>LICENSE_FLAGS</code> identifies which license restriction that recipe has
<ul class="org-ul">
<li>if this string is set to <code>"commercial"</code> for example, then our build must
set <code>LICENSE_FLAGS_ACCEPTED</code> to include <code>"commercial"</code> for a build that
includes this recipe to actually build</li>
<li><code>LICENSE_FLAGS_ACCEPTED</code> can also be set to permit particular license
terms for particular projects,
e.g. <code>"commercial_gstreamer1.0-plugins-ugly"</code> would mean we&rsquo;re allowed to
use the <code>gstreamer1.0-plugins-ugly</code> recipe in a commercial setting</li>
<li>but by default, <a href="#b00db72c-5c93-441d-887d-9878b84ec993">Poky</a> doesn&rsquo;t use any projects that have commercial
licenses</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-bcd83893-9335-4693-8f50-ac4b0a807761" class="outline-3">
<h3 id="bcd83893-9335-4693-8f50-ac4b0a807761">License compliance</h3>
<div class="outline-text-3" id="text-bcd83893-9335-4693-8f50-ac4b0a807761">
<ul class="org-ul">
<li>most copyleft projects have the following obligations:
<ul class="org-ul">
<li>source code</li>
<li>the license text</li>
<li>any modifications made to the project</li>
<li>any scripts that are required to configure and build it</li>
</ul></li>
<li>sharing source isn&rsquo;t simply a matter of copying <code>DL_DIR</code> (the <a href="#8924a89f-2052-4370-a549-a61d2475454b"><code>downloads/</code></a>
directory) and so on, because that would be copying <i>all</i> sources (including
proprietary ones), and furthermore, we don&rsquo;t need to share <i>all</i> the sources,
but only the copyleft-licensed ones</li>
<li><p>
to achieve licensing compliance, we can generate an <a href="#ee4d8327-cb6b-4b13-8ca2-3d77cce33a81">SBOM</a> in SPDX format
using the appropriate <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a>:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">INHERIT +</span>= <span class="org-string">"create-spdx"</span>
</pre>
</div>
<ul class="org-ul">
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/sbom.html">here</a></li>
</ul></li>
<li><p>
an older, inferior method:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">INHERIT +</span>= <span class="org-string">"archiver"</span>
</pre>
</div>
<ul class="org-ul">
<li>the default configuration has <code>COPYLEFT_LICENSE_INCLUDE</code> set to <code>"GPL* LGPL*
    AGPL*"</code></li>
<li>the <code>COPYLEFT_LICENSE_EXCLUDE</code> variable can be used to exclude specific
licenses; by default, this will be set to <code>"CLOSED Proprietary"</code></li>
<li>included sources are deployed to the <code>build/tmp/deploy/sources/&lt;arch&gt;/</code>
directories</li>
<li>more on this <a href="https://docs.yoctoproject.org/ref-manual/variables.html#term-ARCHIVER_MODE">here</a>; see also the <code>meta/classes/archiver.bbclass</code> file</li>
</ul></li>
<li>when providing the source code, the license text is shared inside it</li>
<li><p>
if we also need to include the license text inside our final <a href="#d04f848b-f29b-4fc5-b2c6-1c2331456bf1">image</a>, we can
add the following to our <code>build/conf/local.conf</code>:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">COPY_LIC_MANIFEST</span> = <span class="org-string">"1"</span>
<span class="org-variable-name">COPY_LIC_DIRS</span> = <span class="org-string">"1"</span>
<span class="org-variable-name">LICENSE_CREATE_PACKAGE</span> = <span class="org-string">"1"</span>
</pre>
</div>
<ul class="org-ul">
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/licenses.html#providing-license-text">here</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-635714a5-4def-4468-88f3-a30e4128c720" class="outline-2">
<h2 id="635714a5-4def-4468-88f3-a30e4128c720">Toaster</h2>
<div class="outline-text-2" id="text-635714a5-4def-4468-88f3-a30e4128c720">
<ul class="org-ul">
<li>this is a GUI frontend for <a href="#73837aae-7e38-4040-99e9-e5b43fd673ca">configuring</a> and <a href="#6ba19863-6771-4f13-9d20-1d4dec02ae6c">building</a></li>
<li>it runs as a server and accessed via localhost with the browser</li>
<li><p>
this requires the Python Django framework, and a few others; with <code>pip</code> we can
install them easily:
</p>
<div class="org-src-container">
<pre class="src src-bash">pip3 install --user -r bitbake/toaster-requirements.txt
</pre>
</div></li>
<li><p>
to start the server (which must be done in our dev environment):
</p>
<div class="org-src-container">
<pre class="src src-bash">source oe-init-build-env
source toaster start
</pre>
</div></li>
<li>then we just open up <code>127.0.0.1:8000</code> in the browser</li>
</ul>
</div>
</div>
