content/yocto.org
* Good practices
:PROPERTIES:
:ID:       d106ee59-cbac-4ba2-b886-68266957e19e
:CUSTOM_ID: d106ee59-cbac-4ba2-b886-68266957e19e
:END:
- use the =image-buildinfo= [[#1f78978c-9d22-4d70-9aab-de96ee8ab69a][class]] to save build information to the target
  filesystem
  - this helps to manually determine the origin of a given image
  - by default it is saved to =${sysconfdir}/buildinfo=, as specified by
    =IMAGE_BUILDINFO_FILE= (i.e. usually =/etc/buildinfo=)
- avoid creating too many [[#d4009f0f-f371-454b-b30f-7fda430c0028][layers]]
  - e.g. the development of a [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]]-only layer makes sense in the following
    situations:
    - the board is the product, as in the System on Module (SoM) vendors' case
    - when external access to the layer is critical, however, we want to limit
      the access for the non-BSP source
  - using a single layer for a product has advantages, such as:
    - facilitating the development of reusable components, such as a [[#4f2876d0-3b4a-4be0-9f24-12b4922f7bb6][package
      group]] for development tools, or a network utility shared by multiple
      products
    - reducing the risk of unexpected side effects due to changes for a
      specific product or board
    - increasing the reuse of bug fixes across multiple products and reuse of
      BSP low-level components such as the Linux kernel or bootloader
    - boosting standardisation across multiple products, reducing the learning
      curve for new team members
  - start simple; split layers up only when required
- a couple of special [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]] directories we may need to create:
  - =recipes-backport/=
    - sometimes a newer Yocto project release comes along, which we don't move
      to, but which may include a new recipe version with bug fixes or needed
      features
    - in such a case, we can put a backport version of the recipe in here
  - =recipes-staging/=
    - this is for new recipes or [[#d2fee7d5-7007-4e33-85cb-6c9a370990fd][append]] files that include missing package
      configurations or bug fixes that, unlike above, have not yet made their
      way into the Yocto project recipe
    - we would continuously send the recipes/bug fixes in here to the
      respective upstream project (e.g. OpenEmbedded Core)
    - then, once said patch is accepted, we can move this change from
      =recipes-staging= to the =recipes-backport= directory above (the backport
      would then be "official")
    - this approach allows us to keep track of pending upstreaming tasks, and
      makes the task of upgrading our meta layer to a newer Yocto Project
      release easier
- create a [[#dfb22ff0-7a48-4df5-b479-d591750e0354][custom distro]]
  - you should distribute a custom distro, not a =build/conf/local.conf= file
- don't just use an existing image recipe; [[#01866026-d3a7-47e1-8148-12966cdc99df][create a custom one yourself]],
  namely to:
  - reduce the rootfs size
  - reduce the build time
  - reduce the number of licenses to deal with
  - reduce the surface of attack for security breaches
- when doing application development, use the [[#ec39dfb8-2723-41a2-ad1e-26ae052595d9][SDK]]; using Yocto proper is too
  cumbersome for that
- avoid too many patches for the Linux kernel and bootloader
  - if Single-Board Computer (SBC), the number of patches should be minimal
  - if System-On-Module (SOM) with a custom baseboard, the number of patches
    will vary depending on the number of modifications from the vendor
    baseboard hardware design
  - if custom hardware design, then expect to need a custom [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] and,
    consequently, a considerable number of modifications
- if we find we're progressively adding more and more patches to a recipe,
  consider forking the project and applying the patches there
  - this has the advantage of needing a much simpler recipe file
- when creating a [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipe]], don't set =SRCREV= to =AUTOREV=
  - =SRCREV= indicates which source revision to build, and setting it to =AUTOREV=
    means it will automatically fetch the newest
  - we might be tempted to do this while we're working on and making ongoing
    changes to the backing project
  - but unfortunately =AUTOREV= is kind of fragile; it will only re-proc when
    BitBake invalidates the cache of the recipe, but this only happens when we
    modify the recipe itself or when we change something that triggers the
    BitBake cache rebuild, such as changing any =.conf= file
  - for this scenario, use [[#28a59763-8b1e-4c36-8c07-aafde51a8081][devtool]], which allows us to change the code
    directly in the workspace and forces the recipe to use this as the source
- create an [[#ee4d8327-cb6b-4b13-8ca2-3d77cce33a81][SBOM]]
  - it's not created by default
- continuously monitor the project license constraints
  - e.g. to prevent copyleft contamination of our intellectual property
  - project license constraints and the project component's licenses may
    change over time, so we'll need to monitor our license compliance
    continuously
- scan for known Common Vulnerabilities and Exposures (CVEs) for our
  [[#49922abe-989a-4049-a4e1-d9cd49db6f60][recipes]]
  - though we should not be limited to this as our [[#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2][BSP]] components might also
    require security fixes, which the BSP vendors commonly neglect
  - but the paranoia level will depend on the project niche
  - more on this [[https://docs.yoctoproject.org/dev-manual/vulnerabilities.html][here]]
- consider upstreaming work
  - at first, this may not seem worth it for management:
    - uses resources to adapt modifications
    - upstream review feedback may require additional interactions and rework
    - development work not directly connected to the product needs to be done
  - usually, development and management teams underestimate the total cost of
    maintenance, but this is frequently the most expensive part of the
    project, as it lasts for years
  - upstreaming allows us to do the following:
    - avoid work duplication over the years
    - reduce the friction during upgrades for new Yocto Project releases
    - receive critical and constructive feedback about the changes we are
      upstreaming
    - reduce the amount of work with security updates and bug fixes
    - reduce the amount of code we have to maintain
  - upstreaming work is continuous---every time we add a new feature, we
    potentially increase the gap between our code and the upstream---thus we
    may postpone the upstreaming work, but the upstreaming costs will be
    multiplied when you work on updating to the next Yocto Project release
- tackle project risk points and constraints as soon as possible
  - as the software and hardware must work together, a few aspects directly
    depend on our hardware design, e.g.:
    - is amount of memory we intend to use enough or too much?
    - is amount of power hardware uses sufficient for our constraints?
    - is the target GPU capable of rendering the animations we need?
    - do all the planned peripheral devices have available Linux kernel
      drivers ready for use or do we need to plan the development for those?
  - the preceding questions can be answered using a reference or well-known
    board, which we have ready to use BSP
  - this allows us to produce a Minimal Viable Product (MVP) without the need
    to design our custom hardware
  - after we validate the project's risks and constraints, those boards are
    still valuable assets for the following:
    - continuing the development of our software until the custom board and
      BSP are ready for use
    - as a base of comparison with our custom design
    - as a reference to verify whether a bug is specific to our custom board
      and BSP
  - considering we can develop our software using a reference or a well-known
    board, we should postpone the design of a custom board for as long as
    possible
  - delaying the design gives us the freedom to change many aspects of our
    project, such as changing a peripheral because of a specific driver or
    even changing the planned CPU and memory capabilities after maturing the
    application and features
  - when we finally decide to go with a custom design, we should keep it as
    close as possible to the board we choose as a reference
  - of course, sometimes we need to deviate from the reference design, but it
    comes with the risk of introducing design issues and increasing the cost
    of our custom BSP
