yocto.html
<div id="outline-container-d106ee59-cbac-4ba2-b886-68266957e19e" class="outline-2">
<h2 id="d106ee59-cbac-4ba2-b886-68266957e19e">Good practices</h2>
<div class="outline-text-2" id="text-d106ee59-cbac-4ba2-b886-68266957e19e">
<ul class="org-ul">
<li>use the <code>image-buildinfo</code> <a href="#1f78978c-9d22-4d70-9aab-de96ee8ab69a">class</a> to save build information to the target
filesystem
<ul class="org-ul">
<li>this helps to manually determine the origin of a given image</li>
<li>by default it is saved to <code>${sysconfdir}/buildinfo</code>, as specified by
<code>IMAGE_BUILDINFO_FILE</code> (i.e. usually <code>/etc/buildinfo</code>)</li>
</ul></li>
<li>avoid creating too many <a href="#d4009f0f-f371-454b-b30f-7fda430c0028">layers</a>
<ul class="org-ul">
<li>e.g. the development of a <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a>-only layer makes sense in the following
situations:
<ul class="org-ul">
<li>the board is the product, as in the System on Module (SoM) vendors&rsquo; case</li>
<li>when external access to the layer is critical, however, we want to limit
the access for the non-BSP source</li>
</ul></li>
<li>using a single layer for a product has advantages, such as:
<ul class="org-ul">
<li>facilitating the development of reusable components, such as a <a href="#4f2876d0-3b4a-4be0-9f24-12b4922f7bb6">package
group</a> for development tools, or a network utility shared by multiple
products</li>
<li>reducing the risk of unexpected side effects due to changes for a
specific product or board</li>
<li>increasing the reuse of bug fixes across multiple products and reuse of
BSP low-level components such as the Linux kernel or bootloader</li>
<li>boosting standardisation across multiple products, reducing the learning
curve for new team members</li>
</ul></li>
<li>start simple; split layers up only when required</li>
</ul></li>
<li>a couple of special <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a> directories we may need to create:
<ul class="org-ul">
<li><code>recipes-backport/</code>
<ul class="org-ul">
<li>sometimes a newer Yocto project release comes along, which we don&rsquo;t move
to, but which may include a new recipe version with bug fixes or needed
features</li>
<li>in such a case, we can put a backport version of the recipe in here</li>
</ul></li>
<li><code>recipes-staging/</code>
<ul class="org-ul">
<li>this is for new recipes or <a href="#d2fee7d5-7007-4e33-85cb-6c9a370990fd">append</a> files that include missing package
configurations or bug fixes that, unlike above, have not yet made their
way into the Yocto project recipe</li>
<li>we would continuously send the recipes/bug fixes in here to the
respective upstream project (e.g. OpenEmbedded Core)</li>
<li>then, once said patch is accepted, we can move this change from
<code>recipes-staging</code> to the <code>recipes-backport</code> directory above (the backport
would then be &ldquo;official&rdquo;)</li>
<li>this approach allows us to keep track of pending upstreaming tasks, and
makes the task of upgrading our meta layer to a newer Yocto Project
release easier</li>
</ul></li>
</ul></li>
<li>create a <a href="#dfb22ff0-7a48-4df5-b479-d591750e0354">custom distro</a>
<ul class="org-ul">
<li>you should distribute a custom distro, not a <code>build/conf/local.conf</code> file</li>
</ul></li>
<li>don&rsquo;t just use an existing image recipe; <a href="#01866026-d3a7-47e1-8148-12966cdc99df">create a custom one yourself</a>,
namely to:
<ul class="org-ul">
<li>reduce the rootfs size</li>
<li>reduce the build time</li>
<li>reduce the number of licenses to deal with</li>
<li>reduce the surface of attack for security breaches</li>
</ul></li>
<li>when doing application development, use the <a href="#ec39dfb8-2723-41a2-ad1e-26ae052595d9">SDK</a>; using Yocto proper is too
cumbersome for that</li>
<li>avoid too many patches for the Linux kernel and bootloader
<ul class="org-ul">
<li>if Single-Board Computer (SBC), the number of patches should be minimal</li>
<li>if System-On-Module (SOM) with a custom baseboard, the number of patches
will vary depending on the number of modifications from the vendor
baseboard hardware design</li>
<li>if custom hardware design, then expect to need a custom <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> and,
consequently, a considerable number of modifications</li>
</ul></li>
<li>if we find we&rsquo;re progressively adding more and more patches to a recipe,
consider forking the project and applying the patches there
<ul class="org-ul">
<li>this has the advantage of needing a much simpler recipe file</li>
</ul></li>
<li>when creating a <a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipe</a>, don&rsquo;t set <code>SRCREV</code> to <code>AUTOREV</code>
<ul class="org-ul">
<li><code>SRCREV</code> indicates which source revision to build, and setting it to <code>AUTOREV</code>
means it will automatically fetch the newest</li>
<li>we might be tempted to do this while we&rsquo;re working on and making ongoing
changes to the backing project</li>
<li>but unfortunately <code>AUTOREV</code> is kind of fragile; it will only re-proc when
BitBake invalidates the cache of the recipe, but this only happens when we
modify the recipe itself or when we change something that triggers the
BitBake cache rebuild, such as changing any <code>.conf</code> file</li>
<li>for this scenario, use <a href="#28a59763-8b1e-4c36-8c07-aafde51a8081">devtool</a>, which allows us to change the code
directly in the workspace and forces the recipe to use this as the source</li>
</ul></li>
<li>create an <a href="#ee4d8327-cb6b-4b13-8ca2-3d77cce33a81">SBOM</a>
<ul class="org-ul">
<li>it&rsquo;s not created by default</li>
</ul></li>
<li>continuously monitor the project license constraints
<ul class="org-ul">
<li>e.g. to prevent copyleft contamination of our intellectual property</li>
<li>project license constraints and the project component&rsquo;s licenses may
change over time, so we&rsquo;ll need to monitor our license compliance
continuously</li>
</ul></li>
<li>scan for known Common Vulnerabilities and Exposures (CVEs) for our
<a href="#49922abe-989a-4049-a4e1-d9cd49db6f60">recipes</a>
<ul class="org-ul">
<li>though we should not be limited to this as our <a href="#c2a9a4a4-2d14-4ecb-9e99-8525720e1ea2">BSP</a> components might also
require security fixes, which the BSP vendors commonly neglect</li>
<li>but the paranoia level will depend on the project niche</li>
<li>more on this <a href="https://docs.yoctoproject.org/dev-manual/vulnerabilities.html">here</a></li>
</ul></li>
<li>consider upstreaming work
<ul class="org-ul">
<li>at first, this may not seem worth it for management:
<ul class="org-ul">
<li>uses resources to adapt modifications</li>
<li>upstream review feedback may require additional interactions and rework</li>
<li>development work not directly connected to the product needs to be done</li>
</ul></li>
<li>usually, development and management teams underestimate the total cost of
maintenance, but this is frequently the most expensive part of the
project, as it lasts for years</li>
<li>upstreaming allows us to do the following:
<ul class="org-ul">
<li>avoid work duplication over the years</li>
<li>reduce the friction during upgrades for new Yocto Project releases</li>
<li>receive critical and constructive feedback about the changes we are
upstreaming</li>
<li>reduce the amount of work with security updates and bug fixes</li>
<li>reduce the amount of code we have to maintain</li>
</ul></li>
<li>upstreaming work is continuous&#x2014;every time we add a new feature, we
potentially increase the gap between our code and the upstream&#x2014;thus we
may postpone the upstreaming work, but the upstreaming costs will be
multiplied when you work on updating to the next Yocto Project release</li>
</ul></li>
<li>tackle project risk points and constraints as soon as possible
<ul class="org-ul">
<li>as the software and hardware must work together, a few aspects directly
depend on our hardware design, e.g.:
<ul class="org-ul">
<li>is amount of memory we intend to use enough or too much?</li>
<li>is amount of power hardware uses sufficient for our constraints?</li>
<li>is the target GPU capable of rendering the animations we need?</li>
<li>do all the planned peripheral devices have available Linux kernel
drivers ready for use or do we need to plan the development for those?</li>
</ul></li>
<li>the preceding questions can be answered using a reference or well-known
board, which we have ready to use BSP</li>
<li>this allows us to produce a Minimal Viable Product (MVP) without the need
to design our custom hardware</li>
<li>after we validate the project&rsquo;s risks and constraints, those boards are
still valuable assets for the following:
<ul class="org-ul">
<li>continuing the development of our software until the custom board and
BSP are ready for use</li>
<li>as a base of comparison with our custom design</li>
<li>as a reference to verify whether a bug is specific to our custom board
and BSP</li>
</ul></li>
<li>considering we can develop our software using a reference or a well-known
board, we should postpone the design of a custom board for as long as
possible</li>
<li>delaying the design gives us the freedom to change many aspects of our
project, such as changing a peripheral because of a specific driver or
even changing the planned CPU and memory capabilities after maturing the
application and features</li>
<li>when we finally decide to go with a custom design, we should keep it as
close as possible to the board we choose as a reference</li>
<li>of course, sometimes we need to deviate from the reference design, but it
comes with the risk of introducing design issues and increasing the cost
of our custom BSP</li>
</ul></li>
</ul>
</div>
</div>
