content/yocto.org
* Config syntax
:PROPERTIES:
:ID:       cabd0da0-d7ec-4bdc-80db-34a2563ab39e
:CUSTOM_ID: cabd0da0-d7ec-4bdc-80db-34a2563ab39e
:END:
#+begin_src conf
  FOO   = ...  # assignment; variables are lazily resolved
  FOO  := ...  # assignment; variables are immediately resolved
  FOO  ?= ...  # like = but won't overwrite already assigned variable
  FOO ??= ...  # as above, but even weaker; is to ?= what ?= is to =

  FOO += ...   # list-append; automatically inserts an extra space to separate elements
  FOO =+ ...   # list-prepend; automatically inserts an extra space to separate elements
  FOO .= ...   # string-append; no extra space inserted
  FOO =. ...   # string-prepend; no extra space inserted

  FOO[a] = "abc"  # set/modify value of a variable flag (extra info tagged onto a variable)

  FOO:append  = ...  # like .= but will queue the append (overwriting FOO won't squash its effect)
  FOO:prepend = ...  # like =. but will queue the prepend (overwriting FOO won't squash its effect)
  FOO:remove  = ...  # removes a list element (procs after all appends and prepends)

  OVERRIDES = "linux:arm:mymachine"  # for specifying a colon-separated list of flags, such that...
  FOO:linux = ...                    # will proc
  FOO:other = ...                    # won't proc
  FOO:append:arm    = ...            # will proc
  FOO:remove:hello  = ...            # won't proc

  require  # pull in an .inc file; raise a ParseError if it can't be found
  include  # attempt to pull in an .inc file, i.e. as an option

  inherit  # pull in a .bbclass file

  DATE = "${@time.strftime('%Y%m%d',time.gmtime())}"  # inline python code expansion; what comes after the @

  do_install() { # defines a task in shell script (POSIX-compliant stuff only; no bash-isms)
      oe_runmake install DESTDIR=${D}
  }

  do_install:append() { # extend an existing task
      rmdir ${FOO_DIR}
  }

  python do_printdate() { # defines a task in python
      d.setVar("TEXT", "Hello World") # 'd' is a special object for accessing the BitBake environment
      print d.getVar("TEXT")
      import time
      print(time.strftime('%Y%m%d',time.gmtime()))
  }

  python () { # anonymous python task; will be run at the end of parsing
      if d.getVar('SOMEVAR') == 'value':
          d.setVar('ANOTHERVAR', 'value2')
      bb.build.exec_func("do_printdate", d) # manually call some other locally-defined python function
  }

  def get_depends(d): # defines a python utility function (non-task)
      if d.getVar('SOMECONDITION'):
          return "dependencywithcond"
      else:
          return "dependency"
#+end_src
* Templates
:PROPERTIES:
:ID:       70e610ae-be41-48f0-ab91-b7fa3e82851c
:CUSTOM_ID: 70e610ae-be41-48f0-ab91-b7fa3e82851c
:END:
