yocto.html
<div id="outline-container-cabd0da0-d7ec-4bdc-80db-34a2563ab39e" class="outline-2">
<h2 id="cabd0da0-d7ec-4bdc-80db-34a2563ab39e">Config syntax</h2>
<div class="outline-text-2" id="text-cabd0da0-d7ec-4bdc-80db-34a2563ab39e">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">FOO</span>   = ...  <span class="org-comment-delimiter"># </span><span class="org-comment">assignment; variables are lazily resolved</span>
<span class="org-variable-name">FOO  :</span>= ...  <span class="org-comment-delimiter"># </span><span class="org-comment">assignment; variables are immediately resolved</span>
<span class="org-variable-name">FOO  ?</span>= ...  <span class="org-comment-delimiter"># </span><span class="org-comment">like = but won't overwrite already assigned variable</span>
<span class="org-variable-name">FOO ??</span>= ...  <span class="org-comment-delimiter"># </span><span class="org-comment">as above, but even weaker; is to ?= what ?= is to =</span>

<span class="org-variable-name">FOO +</span>= ...   <span class="org-comment-delimiter"># </span><span class="org-comment">list-append; automatically inserts an extra space to separate elements</span>
<span class="org-variable-name">FOO</span> =+ ...   <span class="org-comment-delimiter"># </span><span class="org-comment">list-prepend; automatically inserts an extra space to separate elements</span>
<span class="org-variable-name">FOO .</span>= ...   <span class="org-comment-delimiter"># </span><span class="org-comment">string-append; no extra space inserted</span>
<span class="org-variable-name">FOO</span> =. ...   <span class="org-comment-delimiter"># </span><span class="org-comment">string-prepend; no extra space inserted</span>

<span class="org-variable-name">FOO</span>[<span class="org-constant">a</span>] = <span class="org-string">"abc"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">set/modify value of a variable flag (extra info tagged onto a variable)</span>

<span class="org-variable-name">FOO:append</span>  = ...  <span class="org-comment-delimiter"># </span><span class="org-comment">like .= but will queue the append (overwriting FOO won't squash its effect)</span>
<span class="org-variable-name">FOO:prepend</span> = ...  <span class="org-comment-delimiter"># </span><span class="org-comment">like =. but will queue the prepend (overwriting FOO won't squash its effect)</span>
<span class="org-variable-name">FOO:remove</span>  = ...  <span class="org-comment-delimiter"># </span><span class="org-comment">removes a list element (procs after all appends and prepends)</span>

<span class="org-variable-name">OVERRIDES</span> = <span class="org-string">"linux:arm:mymachine"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">for specifying a colon-separated list of flags, such that...</span>
<span class="org-variable-name">FOO:linux</span> = ...                    <span class="org-comment-delimiter"># </span><span class="org-comment">will proc</span>
<span class="org-variable-name">FOO:other</span> = ...                    <span class="org-comment-delimiter"># </span><span class="org-comment">won't proc</span>
<span class="org-variable-name">FOO:append:arm</span>    = ...            <span class="org-comment-delimiter"># </span><span class="org-comment">will proc</span>
<span class="org-variable-name">FOO:remove:hello</span>  = ...            <span class="org-comment-delimiter"># </span><span class="org-comment">won't proc</span>

require  <span class="org-comment-delimiter"># </span><span class="org-comment">pull in an .inc file; raise a ParseError if it can't be found</span>
include  <span class="org-comment-delimiter"># </span><span class="org-comment">attempt to pull in an .inc file, i.e. as an option</span>

inherit  <span class="org-comment-delimiter"># </span><span class="org-comment">pull in a .bbclass file</span>

<span class="org-variable-name">DATE</span> = <span class="org-string">"${@time.strftime('%Y%m%d',time.gmtime())}"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">inline python code expansion; what comes after the @</span>

<span class="org-type">do_install()</span> { <span class="org-comment-delimiter"># </span><span class="org-comment">defines a task in shell script (POSIX-compliant stuff only; no bash-isms)</span>
    <span class="org-variable-name">oe_runmake install DESTDIR</span>=${D}
}

do_install:append() { <span class="org-comment-delimiter"># </span><span class="org-comment">extend an existing task</span>
    rmdir ${FOO_DIR}
}

<span class="org-type">python do_printdate()</span> { <span class="org-comment-delimiter"># </span><span class="org-comment">defines a task in python</span>
    d.setVar(<span class="org-string">"TEXT"</span>, <span class="org-string">"Hello World"</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">'d' is a special object for accessing the BitBake environment</span>
    print d.getVar(<span class="org-string">"TEXT"</span>)
    import time
    print(time.strftime(<span class="org-string">'%Y%m%d'</span>,time.gmtime()))
}

<span class="org-type">python ()</span> { <span class="org-comment-delimiter"># </span><span class="org-comment">anonymous python task; will be run at the end of parsing</span>
    if d.getVar(<span class="org-string">'SOMEVAR'</span>) == <span class="org-string">'value'</span>:
        d.setVar(<span class="org-string">'ANOTHERVAR'</span>, <span class="org-string">'value2'</span>)
    bb.build.exec_func(<span class="org-string">"do_printdate"</span>, d) <span class="org-comment-delimiter"># </span><span class="org-comment">manually call some other locally-defined python function</span>
}

def get_depends(d): <span class="org-comment-delimiter"># </span><span class="org-comment">defines a python utility function (non-task)</span>
    if d.getVar(<span class="org-string">'SOMECONDITION'</span>):
        return <span class="org-string">"dependencywithcond"</span>
    else:
        return <span class="org-string">"dependency"</span>
</pre>
</div>
</div>
</div>
