content/yocto.org
*** =local.conf=
:PROPERTIES:
:ID:       3b6f0f7c-d816-4b65-8096-dc2e720a8f68
:CUSTOM_ID: 3b6f0f7c-d816-4b65-8096-dc2e720a8f68
:END:
#+begin_src conf
  MACHINE ?= "qemux86-64"                # see meta/conf/machine/ and meta-yocto-bsp/conf/machine/ for more options
  DISTRO ?= "poky"                       # set the policy (distro)
  PACKAGE_CLASSES ?= "package_ipk"       # specify the package format to use
  #SDKMACHINE ?= "x86_64"                # SDK target architecture; only i686, x86_64, aarch64 are supported
  EXTRA_IMAGE_FEATURES ?= "debug-tweaks" # misc. stuff for development, e.g. give ssh root a blank password
  USER_CLASSES ?= "buildstats"           # collect build statistics

  #IMAGE_CLASSES += "testimage"          # enable support for testing the image in QEMU (see testimage.bbclass)
  #IMAGE_CLASSES += "testsdk"            # enable support for testing the SDK (see testsdk.bbclass)
  #TESTIMAGE_AUTO:qemuall = "1"          # run imagetest automatically for qemu* targets

  #OE_TERMINAL = "auto"                  # enable shell when user input is needed, e.g. patch resolution
  PATCHRESOLVE = "noop"                  # disable interactive patch resolution (tasks will just fail instead)

  # fail the build if we're running low on disk space
  BB_DISKMON_DIRS ??= "\
      STOPTASKS,${TMPDIR},1G,100K \
      STOPTASKS,${DL_DIR},1G,100K \
      STOPTASKS,${SSTATE_DIR},1G,100K \
      STOPTASKS,/tmp,100M,100K \
      HALT,${TMPDIR},100M,1K \
      HALT,${DL_DIR},100M,1K \
      HALT,${SSTATE_DIR},100M,1K \
      HALT,/tmp,10M,1K"

  # sstate mirrors (fetch prebuilt build artefacts to speed up the build)
  #BB_HASHSERVE_UPSTREAM = "hashserv.yocto.io:8687"
  #SSTATE_MIRRORS ?= "file://.* http://cdn.jsdelivr.net/yocto/sstate/all/PATH;downloadfilename=PATH"
  # OR
  #SSTATE_MIRRORS ?= "file://.* http://sstate.yoctoproject.org/all/PATH;downloadfilename=PATH"

  PACKAGECONFIG:append:pn-qemu-system-native = " sdl"   # if we're targeting QEMU, enable the SDL UI frontend
  ASSUME_PROVIDED += "libsdl2-native"                   # we need not bother building the SDL library ourselves
  #PACKAGECONFIG:append:pn-qemu-system-native = " gtk+" # enable Gtk UI frontend, which has an actual menu

  #CONF_VERSION = "2"  # version counter, mostly for convenience but completely optional

  #BB_NUMBER_THREADS ?= "${@oe.utils.cpu_count()}"  # max threads for BitBake to dedicate to tasks
  #PARALLEL_MAKE ?= "-j ${@oe.utils.cpu_count()}"   # max threads for make

  # if we want an image based on directfb without x11
  #DISTRO_FEATURES:append = " directfb"
  #DISTRO_FEATURES:remove = "x11"

  #DEBUG_BUILD = "1"                 # optimisation to make debugging easer, at the possible cost of performance
  #INHIBIT_PACKAGE_STRIP = "1"       # disable the stripping of the installed binaries
  #INHIBIT_PACKAGE_DEBUG_SPLIT = "1" # disable the split of the debug information into -dbg files

  # The following options will build a companion 'debug filesystem' in addition
  # to the normal deployable filesystem.  This companion system allows a
  # debugger to know the symbols and related sources.  It can be used to
  # debug a remote 'production' system without having to add the debug symbols
  # and sources to remote system.
  #IMAGE_GEN_DEBUGFS = "1"
  #IMAGE_FSTYPES_DEBUGFS = "tar.gz"

  #require conf/distro/include/security_flags.inc # enable more secure code generation with extra gcc, ld flags

  #INITRAMFS_IMAGE = "core-image-minimal-initramfs"  # for early userspace (e.g. if mounting rootfs requires a module)
  #INITRAMFS_IMAGE_BUNDLE = "1"                      # if we want to embed the initramfs inside the kernel image

  #INIT_MANAGER = "none"  # other options include sysvinit, systemd, mdev-busybox

  # if we want a full set of packages instead of busybox for base utils
  #PREFERRED_PROVIDER_base-utils = "packagegroup-core-base-utils"
  #VIRTUAL-RUNTIME_base-utils = "packagegroup-core-base-utils"
  #VIRTUAL-RUNTIME_base-utils-hwclock = "util-linux-hwclock"
  #VIRTUAL-RUNTIME_base-utils-syslog = "syslog"

  # enable LTO system-wide
  #require conf/distro/include/lto.inc
  #DISTRO_FEATURES:append = " lto"

  SDK_PS1 ?= "${SDK_NAME}${SDK_VENDOR}:\$ " # use this custom prompt when inside the SDK

  # enable local PR service to auto-increment PR whenever a package changes (with some extra sanity checks)
  #PRSERV_HOST = "localhost:0"
  #INHERIT += "buildhistory"
  #BUILDHISTORY_COMMIT = "1"

  # generate a Software Bill of Materials
  # INHERIT += "create-spdx"
  # SPDX_PRETTY = "1" # make the json human-readable/non-minified
#+end_src
