yocto.html
<div id="outline-container-70e610ae-be41-48f0-ab91-b7fa3e82851c" class="outline-2">
<h2 id="70e610ae-be41-48f0-ab91-b7fa3e82851c">Templates</h2>
<div class="outline-text-2" id="text-70e610ae-be41-48f0-ab91-b7fa3e82851c">
</div>
<div id="outline-container-3b6f0f7c-d816-4b65-8096-dc2e720a8f68" class="outline-3">
<h3 id="3b6f0f7c-d816-4b65-8096-dc2e720a8f68"><code>local.conf</code></h3>
<div class="outline-text-3" id="text-3b6f0f7c-d816-4b65-8096-dc2e720a8f68">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">MACHINE ?</span>= <span class="org-string">"qemux86-64"</span>                <span class="org-comment-delimiter"># </span><span class="org-comment">see meta/conf/machine/ and meta-yocto-bsp/conf/machine/ for more options</span>
<span class="org-variable-name">DISTRO ?</span>= <span class="org-string">"poky"</span>                       <span class="org-comment-delimiter"># </span><span class="org-comment">set the policy (distro)</span>
<span class="org-variable-name">PACKAGE_CLASSES ?</span>= <span class="org-string">"package_ipk"</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">specify the package format to use</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">SDKMACHINE ?= "x86_64"                # SDK target architecture; only i686, x86_64, aarch64 are supported</span>
<span class="org-variable-name">EXTRA_IMAGE_FEATURES ?</span>= <span class="org-string">"debug-tweaks"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">misc. stuff for development, e.g. give ssh root a blank password</span>
<span class="org-variable-name">USER_CLASSES ?</span>= <span class="org-string">"buildstats"</span>           <span class="org-comment-delimiter"># </span><span class="org-comment">collect build statistics</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">IMAGE_CLASSES += "testimage"          # enable support for testing the image in QEMU (see testimage.bbclass)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">IMAGE_CLASSES += "testsdk"            # enable support for testing the SDK (see testsdk.bbclass)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">TESTIMAGE_AUTO:qemuall = "1"          # run imagetest automatically for qemu* targets</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">OE_TERMINAL = "auto"                  # enable shell when user input is needed, e.g. patch resolution</span>
<span class="org-variable-name">PATCHRESOLVE</span> = <span class="org-string">"noop"</span>                  <span class="org-comment-delimiter"># </span><span class="org-comment">disable interactive patch resolution (tasks will just fail instead)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">fail the build if we're running low on disk space</span>
<span class="org-variable-name">BB_DISKMON_DIRS ??</span>= <span class="org-string">"\</span>
<span class="org-string">    STOPTASKS,${TMPDIR},1G,100K \</span>
<span class="org-string">    STOPTASKS,${DL_DIR},1G,100K \</span>
<span class="org-string">    STOPTASKS,${SSTATE_DIR},1G,100K \</span>
<span class="org-string">    STOPTASKS,/tmp,100M,100K \</span>
<span class="org-string">    HALT,${TMPDIR},100M,1K \</span>
<span class="org-string">    HALT,${DL_DIR},100M,1K \</span>
<span class="org-string">    HALT,${SSTATE_DIR},100M,1K \</span>
<span class="org-string">    HALT,/tmp,10M,1K"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">sstate mirrors (fetch prebuilt build artefacts to speed up the build)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">BB_HASHSERVE_UPSTREAM = "hashserv.yocto.io:8687"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">SSTATE_MIRRORS ?= "file://.* http://cdn.jsdelivr.net/yocto/sstate/all/PATH;downloadfilename=PATH"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">OR</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">SSTATE_MIRRORS ?= "file://.* http://sstate.yoctoproject.org/all/PATH;downloadfilename=PATH"</span>

<span class="org-variable-name">PACKAGECONFIG:append:pn-qemu-system-native</span> = <span class="org-string">" sdl"</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">if we're targeting QEMU, enable the SDL UI frontend</span>
<span class="org-variable-name">ASSUME_PROVIDED +</span>= <span class="org-string">"libsdl2-native"</span>                   <span class="org-comment-delimiter"># </span><span class="org-comment">we need not bother building the SDL library ourselves</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">PACKAGECONFIG:append:pn-qemu-system-native = " gtk+" # enable Gtk UI frontend, which has an actual menu</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">CONF_VERSION = "2"  # version counter, mostly for convenience but completely optional</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">BB_NUMBER_THREADS ?= "${@oe.utils.cpu_count()}"  # max threads for BitBake to dedicate to tasks</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">PARALLEL_MAKE ?= "-j ${@oe.utils.cpu_count()}"   # max threads for make</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">if we want an image based on directfb without x11</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">DISTRO_FEATURES:append = " directfb"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">DISTRO_FEATURES:remove = "x11"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">DEBUG_BUILD = "1"                 # optimisation to make debugging easer, at the possible cost of performance</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">INHIBIT_PACKAGE_STRIP = "1"       # disable the stripping of the installed binaries</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">INHIBIT_PACKAGE_DEBUG_SPLIT = "1" # disable the split of the debug information into -dbg files</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">The following options will build a companion 'debug filesystem' in addition</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">to the normal deployable filesystem.  This companion system allows a</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">debugger to know the symbols and related sources.  It can be used to</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">debug a remote 'production' system without having to add the debug symbols</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">and sources to remote system.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">IMAGE_GEN_DEBUGFS = "1"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">IMAGE_FSTYPES_DEBUGFS = "tar.gz"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">require conf/distro/include/security_flags.inc # enable more secure code generation with extra gcc, ld flags</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">INITRAMFS_IMAGE = "core-image-minimal-initramfs"  # for early userspace (e.g. if mounting rootfs requires a module)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">INITRAMFS_IMAGE_BUNDLE = "1"                      # if we want to embed the initramfs inside the kernel image</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">INIT_MANAGER = "none"  # other options include sysvinit, systemd, mdev-busybox</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">if we want a full set of packages instead of busybox for base utils</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">PREFERRED_PROVIDER_base-utils = "packagegroup-core-base-utils"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">VIRTUAL-RUNTIME_base-utils = "packagegroup-core-base-utils"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">VIRTUAL-RUNTIME_base-utils-hwclock = "util-linux-hwclock"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">VIRTUAL-RUNTIME_base-utils-syslog = "syslog"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">enable LTO system-wide</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">require conf/distro/include/lto.inc</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">DISTRO_FEATURES:append = " lto"</span>

<span class="org-variable-name">SDK_PS1 ?</span>= <span class="org-string">"${SDK_NAME}${SDK_VENDOR}:\$ "</span> <span class="org-comment-delimiter"># </span><span class="org-comment">use this custom prompt when inside the SDK</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">enable local PR service to auto-increment PR whenever a package changes (with some extra sanity checks)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">PRSERV_HOST = "localhost:0"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">INHERIT += "buildhistory"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">BUILDHISTORY_COMMIT = "1"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">generate a Software Bill of Materials</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">INHERIT += "create-spdx"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">SPDX_PRETTY = "1" # make the json human-readable/non-minified</span>
</pre>
</div>
</div>
</div>
