content/yocto.org
*** Recipe
:PROPERTIES:
:ID:       7d86ced6-7905-4d3d-9739-42965f71fb1c
:CUSTOM_ID: 7d86ced6-7905-4d3d-9739-42965f71fb1c
:END:
#+begin_src conf
  DESCRIPTION = "Simple helloworld application"
  SECTION = "examples"
  LICENSE = "MIT"
  LIC_FILES_CHKSUM = "file://${COMMON_LICENSE_DIR}/MIT;md5=0835ade698e0bcf8506ecda2f7b4f302"

  SRC_URI = "file://myhello.c" # list of all source files in the recipe (just one in this case)

  S = "${WORKDIR}"

  do_compile() {
          ${CC} myhello.c ${LDFLAGS} -o myhello
  }

  do_install() {
          install -D -m 0755 myhello ${D}${bindir}/helloworld  # ${D} is the requisite location inside build/tmp/work/
  }

  # If a project is already based on autotools (or cmake/meson/etc.), then
  # instead of defining the above tasks manually, we can make use of the
  # autotools class. (See existing recipes for tips.)
#+end_src
