yocto.html
<div id="outline-container-7d86ced6-7905-4d3d-9739-42965f71fb1c" class="outline-3">
<h3 id="7d86ced6-7905-4d3d-9739-42965f71fb1c">Recipe</h3>
<div class="outline-text-3" id="text-7d86ced6-7905-4d3d-9739-42965f71fb1c">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">DESCRIPTION</span> = <span class="org-string">"Simple helloworld application"</span>
<span class="org-variable-name">SECTION</span> = <span class="org-string">"examples"</span>
<span class="org-variable-name">LICENSE</span> = <span class="org-string">"MIT"</span>
<span class="org-variable-name">LIC_FILES_CHKSUM</span> = <span class="org-string">"file://${COMMON_LICENSE_DIR}/MIT;md5=0835ade698e0bcf8506ecda2f7b4f302"</span>

<span class="org-variable-name">SRC_URI</span> = <span class="org-string">"file://myhello.c"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">list of all source files in the recipe (just one in this case)</span>

<span class="org-variable-name">S</span> = <span class="org-string">"${WORKDIR}"</span>

<span class="org-type">do_compile()</span> {
        ${CC} myhello.c ${LDFLAGS} -o myhello
}

<span class="org-type">do_install()</span> {
        install -D -m 0755 myhello ${D}${bindir}/helloworld  <span class="org-comment-delimiter"># </span><span class="org-comment">${D} is the requisite location inside build/tmp/work/</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">If a project is already based on autotools (or cmake/meson/etc.), then</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">instead of defining the above tasks manually, we can make use of the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">autotools class. (See existing recipes for tips.)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
